{
    "c4_definicion": {"texto":"The C4 architecture is a model for visualizing software systems.","fonetica":"ðə ˈsi ˈfɔɹ ˈɑɹkɪtɛkʧɚ ɪz ə ˈmɑdəl fɔɹ ˈvɪʒuəˌlaɪzɪŋ ˈsɔftwɛɹ ˈsɪstəmz"},
    "c4_origen": {"texto":"The C4 model was created by Simon Brown.","fonetica":"ðə ˈsi ˈfɔɹ ˈmɑdəl wɑz kɹiˈeɪtɪd baɪ ˈsaɪmən bɹaʊn"},
    "c4_objetivo": {"texto":"The goal of C4 is to simplify architecture communication.","fonetica":"ðə ɡoʊl əv ˈsi ˈfɔɹ ɪz tə ˈsɪmplɪfaɪ ˈɑɹkɪtɛkʧɚ kəˌmjunɪˈkeɪʃən"},
    "c4_niveles": {"texto":"C4 uses four levels of diagrams.","fonetica":"ˈsi ˈfɔɹ ˈjusɪz fɔɹ ˈlɛvəlz əv ˈdaɪəˌɡɹæmz"},
    "c4_contexto": {"texto":"The first level is the context diagram.","fonetica":"ðə fɝst ˈlɛvəl ɪz ðə ˈkɑntɛkst ˈdaɪəˌɡɹæm"},
    "c4_contenedor": {"texto":"The second level is the container diagram.","fonetica":"ðə ˈsɛkənd ˈlɛvəl ɪz ðə kənˈteɪnɚ ˈdaɪəˌɡɹæm"},
    "c4_componentes": {"texto":"The third level is the component diagram.","fonetica":"ðə θɝd ˈlɛvəl ɪz ðə kəmˈpoʊnənt ˈdaɪəˌɡɹæm"},
    "c4_codigo": {"texto":"The fourth level is the code diagram.","fonetica":"ðə fɔɹθ ˈlɛvəl ɪz ðə koʊd ˈdaɪəˌɡɹæm"},
    "c4_comunicacion": {"texto":"C4 improves communication between technical and non-technical teams.","fonetica":"ˈsi ˈfɔɹ ɪmˈpɹuvz kəˌmjunɪˈkeɪʃən bɪˈtwin ˈtɛknɪkəl ænd nɑn-ˈtɛknɪkəl timz"},
    "c4_abstraccion": {"texto":"Each C4 level provides a different level of abstraction.","fonetica":"iʧ ˈsi ˈfɔɹ ˈlɛvəl pɹəˈvaɪdz ə ˈdɪfɚənt ˈlɛvəl əv æbˈstɹækʃən"},
    "c4_universidad": {"texto":"C4 is used in universities and companies to teach architecture.","fonetica":"ˈsi ˈfɔɹ ɪz juzd ɪn ˌjunəˈvɝsɪtiz ænd ˈkʌmpəniz tə tiʧ ˈɑɹkɪtɛkʧɚ"},
    "c4_documentacion": {"texto":"The C4 model helps document systems clearly.","fonetica":"ðə ˈsi ˈfɔɹ ˈmɑdəl hɛlps ˈdɑkjəmɛnt ˈsɪstəmz ˈklɪɹli"},
    "c4_comprension": {"texto":"C4 diagrams facilitate understanding of complex systems.","fonetica":"ˈsi ˈfɔɹ ˈdaɪəˌɡɹæmz fəˈsɪləˌteɪt ˌʌndɚˈstændɪŋ əv ˈkɑmplɛks ˈsɪstəmz"},
    "c4_equipo": {"texto":"C4 enables everyone on the team to share the same vision.","fonetica":"ˈsi ˈfɔɹ ɪˈneɪbəlz ˈɛvɹiˌwʌn ɑn ðə tim tə ʃɛɹ ðə seɪm ˈvɪʒən"},
    "c4_inversion": {"texto":"The C4 model reduces learning costs for new team members.","fonetica":"ðə ˈsi ˈfɔɹ ˈmɑdəl ɹɪˈdusɪz ˈlɝnɪŋ kɔsts fɔɹ nu tim ˈmɛmbɚz"},
    "c4_representacion": {"texto":"C4 represents systems from general to specific.","fonetica":"ˈsi ˈfɔɹ ˌɹɛprɪˈzɛnts ˈsɪstəmz fɹəm ˈʤɛnɚəl tə spəˈsɪfɪk"},
    "c4_flexibilidad": {"texto":"C4 diagrams are flexible and adaptable.","fonetica":"ˈsi ˈfɔɹ ˈdaɪəˌɡɹæmz ɑɹ ˈflɛksəbəl ænd əˈdæptəbəl"},
    "c4_similitud_planos": {"texto":"C4 is inspired by building construction blueprints.","fonetica":"ˈsi ˈfɔɹ ɪz ɪnˈspaɪɚd baɪ ˈbɪldɪŋ kənˈstɹʌkʃən ˈbluˌpɹɪnts"},
    "c4_contexto_pregunta": {"texto":"The context diagram answers the question: what is this system?","fonetica":"ðə ˈkɑntɛkst ˈdaɪəˌɡɹæm ˈænsɚz ðə ˈkwɛsʧən wʌt ɪz ðɪs ˈsɪstəm"},
    "c4_contexto_externo": {"texto":"The context diagram shows external actors.","fonetica":"ðə ˈkɑntɛkst ˈdaɪəˌɡɹæm ʃoʊz ɪkˈstɝnəl ˈæktɚz"},
    "c4_contexto_alcance": {"texto":"The context diagram defines the system scope.","fonetica":"ðə ˈkɑntɛkst ˈdaɪəˌɡɹæm dɪˈfaɪnz ðə ˈsɪstəm skoʊp"},
    "c4_contenedor_def": {"texto":"The container diagram shows the main applications.","fonetica":"ðə kənˈteɪnɚ ˈdaɪəˌɡɹæm ʃoʊz ðə meɪn ˌæplɪˈkeɪʃənz"},
    "c4_contenedor_interaccion": {"texto":"Containers represent applications or databases.","fonetica":"kənˈteɪnɚz ˌɹɛprɪˈzɛnt ˌæplɪˈkeɪʃənz ɔɹ ˈdeɪtəˌbeɪsɪz"},
    "c4_componentes_def": {"texto":"The component diagram details the pieces of each application.","fonetica":"ðə kəmˈpoʊnənt ˈdaɪəˌɡɹæm ˈditeɪlz ðə ˈpisɪz əv iʧ ˌæplɪˈkeɪʃən"},
    "c4_componentes_uso": {"texto":"Each component typically corresponds to a class or module.","fonetica":"iʧ kəmˈpoʊnənt ˈtɪpɪkli ˌkɔɹəˈspɑndz tə ə klæs ɔɹ ˈmɑʤul"},
    "c4_codigo_def": {"texto":"The code diagram shows the design at the class and method level.","fonetica":"ðə koʊd ˈdaɪəˌɡɹæm ʃoʊz ðə dɪˈzaɪn æt ðə klæs ænd ˈmɛθəd ˈlɛvəl"},
    "c4_codigo_detalle": {"texto":"This level is optional and depends on the required detail.","fonetica":"ðɪs ˈlɛvəl ɪz ˈɑpʃənəl ænd dɪˈpɛndz ɑn ðə ɹɪˈkwaɪɚd ˈditeɪl"},
    "c4_codigo_documentacion": {"texto":"The code level is used to document specific decisions.","fonetica":"ðə koʊd ˈlɛvəl ɪz juzd tə ˈdɑkjəmɛnt spəˈsɪfɪk dɪˈsɪʒənz"},
    "c4_codigo_publico": {"texto":"It's not always necessary to show the code level to everyone.","fonetica":"ɪts nɑt ˈɔlweɪz ˈnɛsəˌsɛɹi tə ʃoʊ ðə koʊd ˈlɛvəl tə ˈɛvɹiˌwʌn"},
    "c4_ventaja_claridad": {"texto":"An advantage of C4 is clarity in communication.","fonetica":"ən ədˈvæntɪʤ əv ˈsi ˈfɔɹ ɪz ˈklɛɹɪti ɪn kəˌmjunɪˈkeɪʃən"},
    "c4_ventaja_consistencia": {"texto":"C4 provides consistency in system documentation.","fonetica":"ˈsi ˈfɔɹ pɹəˈvaɪdz kənˈsɪstənsi ɪn ˈsɪstəm ˌdɑkjəmɛnˈteɪʃən"},
    "c4_ventaja_aprendizaje": {"texto":"C4 diagrams accelerate learning for new developers.","fonetica":"ˈsi ˈfɔɹ ˈdaɪəˌɡɹæmz ækˈsɛləɹeɪt ˈlɝnɪŋ fɔɹ nu dɪˈvɛləpɚz"},
    "c4_ventaja_colaboracion": {"texto":"C4 fosters collaboration among multidisciplinary teams.","fonetica":"ˈsi ˈfɔɹ ˈfɑstɚz kəˌlæbəˈɹeɪʃən əˈmʌŋ ˌmʌltiˈdɪsəplɪˌnɛɹi timz"},
    "c4_ventaja_escalabilidad": {"texto":"The C4 model is useful for large and scalable systems.","fonetica":"ðə ˈsi ˈfɔɹ ˈmɑdəl ɪz ˈjusfəl fɔɹ lɑɹʤ ænd ˈskeɪləbəl ˈsɪstəmz"},
    "c4_ventaja_foco": {"texto":"Each C4 level allows focusing on different aspects.","fonetica":"iʧ ˈsi ˈfɔɹ ˈlɛvəl əˈlaʊz ˈfoʊkəsɪŋ ɑn ˈdɪfɚənt ˈæspɛkts"},
    "c4_limite_no_estandar": {"texto":"C4 is not an official standard, but it's widely used.","fonetica":"ˈsi ˈfɔɹ ɪz nɑt ən əˈfɪʃəl ˈstændɚd bʌt ɪts ˈwaɪdli juzd"},
    "c4_limite_detalle": {"texto":"A limitation of C4 is that it doesn't prescribe exact detail levels.","fonetica":"ə ˌlɪmɪˈteɪʃən əv ˈsi ˈfɔɹ ɪz ðæt ɪt ˈdʌzənt prɪˈskɹaɪb ɪɡˈzækt ˈditeɪl ˈlɛvəlz"},
    "c4_limite_practica": {"texto":"C4's effectiveness depends on the team's practice.","fonetica":"ˈsi ˈfɔɹz ɪˈfɛktɪvnəs dɪˈpɛndz ɑn ðə timz ˈpɹæktɪs"},
    "c4_limite_experiencia": {"texto":"Good use of C4 requires modeling experience.","fonetica":"ɡʊd juz əv ˈsi ˈfɔɹ ɹɪˈkwaɪɚz ˈmɑdəlɪŋ ɪkˈspɪɹiəns"},
    "c4_contexto_ejemplo": {"texto":"A context diagram example is an online banking system.","fonetica":"ə ˈkɑntɛkst ˈdaɪəˌɡɹæm ɪɡˈzæmpəl ɪz ən ˈɑnˌlaɪn ˈbæŋkɪŋ ˈsɪstəm"},
    "c4_contenedor_ejemplo": {"texto":"The container diagram shows the web app and database.","fonetica":"ðə kənˈteɪnɚ ˈdaɪəˌɡɹæm ʃoʊz ðə wɛb æp ænd ˈdeɪtəˌbeɪs"},
    "c4_componentes_ejemplo": {"texto":"A web app component could be the payment module.","fonetica":"ə wɛb æp kəmˈpoʊnənt kʊd bi ðə ˈpeɪmənt ˈmɑʤul"},
    "c4_codigo_ejemplo": {"texto":"The code level details classes like User or Transaction.","fonetica":"ðə koʊd ˈlɛvəl ˈditeɪlz ˈklæsɪz laɪk ˈjuzɚ ɔɹ tɹænˈzækʃən"},
    "c4_usabilidad_empresas": {"texto":"Many companies use C4 to document their internal systems.","fonetica":"ˈmɛni ˈkʌmpəniz juz ˈsi ˈfɔɹ tə ˈdɑkjəmɛnt ðɛɹ ɪnˈtɝnəl ˈsɪstəmz"},
    "c4_usabilidad_gobierno": {"texto":"Governments also adopt C4 in technology projects.","fonetica":"ˈɡʌvɚnmənts ˈɔlsoʊ əˈdɑpt ˈsi ˈfɔɹ ɪn tɛkˈnɑləʤi ˈpɹɑʤɛkts"},
    "c4_usabilidad_startups": {"texto":"Startups apply C4 to quickly communicate their designs.","fonetica":"ˈstɑɹtˌʌps əˈplaɪ ˈsi ˈfɔɹ tə ˈkwɪkli kəˈmjunəˌkeɪt ðɛɹ dɪˈzaɪnz"},
    "c4_usabilidad_educacion": {"texto":"In education, C4 helps teach software architecture.","fonetica":"ɪn ˌɛʤəˈkeɪʃən ˈsi ˈfɔɹ hɛlps tiʧ ˈsɔftwɛɹ ˈɑɹkɪtɛkʧɚ"},
    "c4_relacion_uml": {"texto":"C4 complements UML but doesn't replace it.","fonetica":"ˈsi ˈfɔɹ ˈkɑmplɪmɛnts ˈju ˈɛm ˈɛl bʌt ˈdʌzənt ɹiˈpleɪs ɪt"},
    "c4_relacion_arq": {"texto":"C4 doesn't replace other architectures, it makes them more understandable.","fonetica":"ˈsi ˈfɔɹ ˈdʌzənt ɹiˈpleɪs ˈʌðɚɹ ˈɑɹkɪtɛkʧɚz ɪt meɪks ðɛm mɔɹ ˌʌndɚˈstændəbəl"},
    "c4_relacion_documentacion": {"texto":"C4 forms part of architectural documentation.","fonetica":"ˈsi ˈfɔɹ fɔɹmz pɑɹt əv ˌɑɹkɪˈtɛkʧɚəl ˌdɑkjəmɛnˈteɪʃən"},
    "c4_relacion_bbdd": {"texto":"C4 diagrams don't show specific database tables.","fonetica":"ˈsi ˈfɔɹ ˈdaɪəˌɡɹæmz doʊnt ʃoʊ spəˈsɪfɪk ˈdeɪtəˌbeɪs ˈteɪbəlz"},
    "c4_relacion_microservicios": {"texto":"C4 is very useful for visualizing microservices.","fonetica":"ˈsi ˈfɔɹ ɪz ˈvɛɹi ˈjusfəl fɔɹ ˈvɪʒuəˌlaɪzɪŋ ˈmaɪkɹoʊˌsɝvɪsɪz"},
    "c4_relacion_monolito": {"texto":"C4 can also be used in monolithic systems.","fonetica":"ˈsi ˈfɔɹ kæn ˈɔlsoʊ bi juzd ɪn ˌmɑnəˈlɪθɪk ˈsɪstəmz"},
    "c4_relacion_eventos": {"texto":"C4 diagrams don't show queues or event buses in detail.","fonetica":"ˈsi ˈfɔɹ ˈdaɪəˌɡɹæmz doʊnt ʃoʊ kjuz ɔɹ ɪˈvɛnt ˈbʌsɪz ɪn ˈditeɪl"},
    "c4_practica_iterativa": {"texto":"Creating C4 diagrams is usually iterative.","fonetica":"kɹiˈeɪtɪŋ ˈsi ˈfɔɹ ˈdaɪəˌɡɹæmz ɪz ˈjuʒəwəli ˈɪtəɹətɪv"},
    "c4_practica_equipo": {"texto":"It's recommended to build C4 diagrams together with the team.","fonetica":"ɪts ˌɹɛkəˈmɛndɪd tə bɪld ˈsi ˈfɔɹ ˈdaɪəˌɡɹæmz təˈɡɛðɚ wɪð ðə tim"},
    "c4_practica_herramientas": {"texto":"There are online tools for creating C4 diagrams.","fonetica":"ðɛɹ ɑɹ ˈɑnˌlaɪn tulz fɔɹ kɹiˈeɪtɪŋ ˈsi ˈfɔɹ ˈdaɪəˌɡɹæmz"},
    "c4_practica_plantillas": {"texto":"Many C4 templates are available on the internet.","fonetica":"ˈmɛni ˈsi ˈfɔɹ ˈtɛmplɪts ɑɹ əˈveɪləbəl ɑn ði ˈɪntɚˌnɛt"},
    "c4_documentacion_necesidad": {"texto":"C4 documentation is necessary for long-lasting systems.","fonetica":"ˈsi ˈfɔɹ ˌdɑkjəmɛnˈteɪʃən ɪz ˈnɛsəˌsɛɹi fɔɹ ˈlɔŋ-ˈlæstɪŋ ˈsɪstəmz"},
    "c4_documentacion_actualizacion": {"texto":"C4 diagrams should be updated when the system changes.","fonetica":"ˈsi ˈfɔɹ ˈdaɪəˌɡɹæmz ʃʊd bi ˈʌpˌdeɪtɪd wɛn ðə ˈsɪstəm ˈʧeɪnʤɪz"},
    "c4_documentacion_equipo": {"texto":"It's useful for everyone on the team to participate in C4 documentation.","fonetica":"ɪts ˈjusfəl fɔɹ ˈɛvɹiˌwʌn ɑn ðə tim tə pɑɹˈtɪsəpeɪt ɪn ˈsi ˈfɔɹ ˌdɑkjəmɛnˈteɪʃən"},
    "c4_documentacion_mantenimiento": {"texto":"Maintaining C4 diagrams ensures design coherence.","fonetica":"meɪnˈteɪnɪŋ ˈsi ˈfɔɹ ˈdaɪəˌɡɹæmz ɪnˈʃʊɚz dɪˈzaɪn koʊˈhɪɹəns"},
    "c4_documentacion_versiones": {"texto":"It's recommended to maintain versions of C4 diagrams.","fonetica":"ɪts ˌɹɛkəˈmɛndɪd tə meɪnˈteɪn ˈvɝʒənz əv ˈsi ˈfɔɹ ˈdaɪəˌɡɹæmz"},
    "c4_uso_inicio": {"texto":"C4 is applied from the start of a software project.","fonetica":"ˈsi ˈfɔɹ ɪz əˈplaɪd fɹəm ðə stɑɹt əv ə ˈsɔftwɛɹ ˈpɹɑʤɛkt"},
    "c4_uso_refactor": {"texto":"C4 is also used during refactoring processes.","fonetica":"ˈsi ˈfɔɹ ɪz ˈɔlsoʊ juzd ˈdʊɹɪŋ ɹiˈfæktɚɪŋ ˈpɹɑsɛsɪz"},
    "c4_uso_onboarding": {"texto":"C4 is key in onboarding new developers.","fonetica":"ˈsi ˈfɔɹ ɪz ki ɪn ˈɑnˌbɔɹdɪŋ nu dɪˈvɛləpɚz"},
    "c4_uso_auditoria": {"texto":"C4 diagrams support software audits.","fonetica":"ˈsi ˈfɔɹ ˈdaɪəˌɡɹæmz səˈpɔɹt ˈsɔftwɛɹ ˈɔdɪts"},
    "c4_uso_seguridad": {"texto":"C4 helps map security flows within the system.","fonetica":"ˈsi ˈfɔɹ hɛlps mæp sɪˈkjʊɹɪti floʊz wɪˈðɪn ðə ˈsɪstəm"},
    "c4_diagrama_contexto_usuario": {"texto":"The context diagram identifies users and external systems.","fonetica":"ðə ˈkɑntɛkst ˈdaɪəˌɡɹæm aɪˈdɛntɪfaɪz ˈjuzɚz ænd ɪkˈstɝnəl ˈsɪstəmz"},
    "c4_diagrama_contexto_dominio": {"texto":"The context defines the system domain.","fonetica":"ðə ˈkɑntɛkst dɪˈfaɪnz ðə ˈsɪstəm doʊˈmeɪn"},
    "c4_diagrama_contenedor_app": {"texto":"A container is typically a deployable application.","fonetica":"ə kənˈteɪnɚ ɪz ˈtɪpɪkli ə dɪˈplɔɪəbəl ˌæplɪˈkeɪʃən"},
    "c4_diagrama_contenedor_db": {"texto":"Another typical container is a database.","fonetica":"əˈnʌðɚ ˈtɪpɪkəl kənˈteɪnɚ ɪz ə ˈdeɪtəˌbeɪs"},
    "c4_diagrama_componentes_api": {"texto":"A component can represent a business API.","fonetica":"ə kəmˈpoʊnənt kæn ˌɹɛprɪˈzɛnt ə ˈbɪznəs ˈeɪ ˈpi ˈaɪ"},
    "c4_diagrama_componentes_servicio": {"texto":"Another component could be an authentication service.","fonetica":"əˈnʌðɚ kəmˈpoʊnənt kʊd bi ən ɔˌθɛntɪˈkeɪʃən ˈsɝvɪs"},
    "c4_diagrama_codigo_clase": {"texto":"The code level details classes and their main methods.","fonetica":"ðə koʊd ˈlɛvəl ˈditeɪlz ˈklæsɪz ænd ðɛɹ meɪn ˈmɛθədz"},
    "c4_diagrama_codigo_test": {"texto":"Test classes can also be documented in C4.","fonetica":"tɛst ˈklæsɪz kæn ˈɔlsoʊ bi ˈdɑkjəmɛntɪd ɪn ˈsi ˈfɔɹ"},
    "c4_herramienta_drawio": {"texto":"Draw.io is a popular tool for C4 diagrams.","fonetica":"ˈdɹɔɪˌoʊ ɪz ə ˈpɑpjəlɚ tul fɔɹ ˈsi ˈfɔɹ ˈdaɪəˌɡɹæmz"},
    "c4_herramienta_structurizr": {"texto":"Structurizr was created by Simon Brown to support C4.","fonetica":"ˈstɹʌkʧəɹaɪzɚ wɑz kɹiˈeɪtɪd baɪ ˈsaɪmən bɹaʊn tə səˈpɔɹt ˈsi ˈfɔɹ"},
    "c4_herramienta_plantuml": {"texto":"PlantUML also supports C4 diagrams.","fonetica":"ˈplænt ˈju ˈɛm ˈɛl ˈɔlsoʊ səˈpɔɹts ˈsi ˈfɔɹ ˈdaɪəˌɡɹæmz"},
    "c4_herramienta_mermaid": {"texto":"Mermaid allows creating C4 diagrams in markdown.","fonetica":"ˈmɝmeɪd əˈlaʊz kɹiˈeɪtɪŋ ˈsi ˈfɔɹ ˈdaɪəˌɡɹæmz ɪn ˈmɑɹkdaʊn"},
    "c4_practica_simplificacion": {"texto":"The goal is to simplify, not add complexity.","fonetica":"ðə ɡoʊl ɪz tə ˈsɪmplɪfaɪ nɑt æd kəmˈplɛksɪti"},
    "c4_practica_abstraccion": {"texto":"Each level maintains the appropriate abstraction principle.","fonetica":"iʧ ˈlɛvəl meɪnˈteɪnz ði əˈpɹoʊpɹiɪt æbˈstɹækʃən ˈpɹɪnsəpəl"},
    "c4_practica_independencia": {"texto":"Diagrams should be technology-independent.","fonetica":"ˈdaɪəˌɡɹæmz ʃʊd bi ˌtɛknɑləʤi-ˌɪndɪˈpɛndənt"},
    "c4_practica_comprension": {"texto":"The reader should quickly understand the structure.","fonetica":"ðə ˈɹidɚ ʃʊd ˈkwɪkli ˌʌndɚˈstænd ðə ˈstɹʌkʧɚ"},
    "c4_practica_historia": {"texto":"C4 diagrams should tell the system's story.","fonetica":"ˈsi ˈfɔɹ ˈdaɪəˌɡɹæmz ʃʊd tɛl ðə ˈsɪstəmz ˈstɔɹi"},
    "c4_practica_restriccion": {"texto":"It's recommended not to overload diagrams with detail.","fonetica":"ɪts ˌɹɛkəˈmɛndɪd nɑt tə ˈoʊvɚˌloʊd ˈdaɪəˌɡɹæmz wɪð ˈditeɪl"},
    "codigo_no_es_diagrama": {"texto":"Source code is not a good architecture diagram.","fonetica":"sɔɹs koʊd ɪz nɑt ə ɡʊd ˈɑɹkɪtɛkʧɚ ˈdaɪəˌɡɹæm"},
    "necesidad_visualizacion": {"texto":"We need to visualize architecture for all stakeholders.","fonetica":"wi nid tə ˈvɪʒuəˌlaɪz ˈɑɹkɪtɛkʧɚ fɔɹ ɔl ˈsteɪkˌhoʊldɚz"},
    "mapa_comunicacion": {"texto":"Diagrams are communication maps.","fonetica":"ˈdaɪəˌɡɹæmz ɑɹ kəˌmjunɪˈkeɪʃən mæps"},
    "nivel_contexto": {"texto":"The context level shows how the system interacts with its environment.","fonetica":"ðə ˈkɑntɛkst ˈlɛvəl ʃoʊz haʊ ðə ˈsɪstəm ˌɪntɚˈækts wɪð ɪts ɪnˈvaɪɹənmənt"},
    "nivel_contenedor": {"texto":"The container level explains the main applications and services.","fonetica":"ðə kənˈteɪnɚ ˈlɛvəl ɪkˈspleɪnz ðə meɪn ˌæplɪˈkeɪʃənz ænd ˈsɝvɪsɪz"},
    "nivel_componente": {"texto":"The component level details the internal parts of each container.","fonetica":"ðə kəmˈpoʊnənt ˈlɛvəl ˈditeɪlz ði ɪnˈtɝnəl pɑɹts əv iʧ kənˈteɪnɚ"},
    "nivel_codigo": {"texto":"The code level illustrates how a component is implemented.","fonetica":"ðə koʊd ˈlɛvəl ˈɪləstɹeɪts haʊ ə kəmˈpoʊnənt ɪz ˈɪmpləmɛntɪd"},
    "ejemplo_contexto": {"texto":"The context shows the user, external systems, and the main system.","fonetica":"ðə ˈkɑntɛkst ʃoʊz ðə ˈjuzɚ ɪkˈstɝnəl ˈsɪstəmz ænd ðə meɪn ˈsɪstəm"},
    "ejemplo_contenedor": {"texto":"The container level shows a web app, database, and API.","fonetica":"ðə kənˈteɪnɚ ˈlɛvəl ʃoʊz ə wɛb æp ˈdeɪtəˌbeɪs ænd ˈeɪ ˈpi ˈaɪ"},
    "ejemplo_componente": {"texto":"The component level shows controllers, services, and repositories.","fonetica":"ðə kəmˈpoʊnənt ˈlɛvəl ʃoʊz kənˈtɹoʊlɚz ˈsɝvɪsɪz ænd ɹɪˈpɑzɪˌtɔɹiz"},
    "ejemplo_codigo": {"texto":"The code level shows classes, methods, and structures.","fonetica":"ðə koʊd ˈlɛvəl ʃoʊz ˈklæsɪz ˈmɛθədz ænd ˈstɹʌkʧɚz"},
    "audiencia_distinta": {"texto":"Each level is designed for a different audience.","fonetica":"iʧ ˈlɛvəl ɪz dɪˈzaɪnd fɔɹ ə ˈdɪfɚənt ˈɔdiəns"},
    "contexto_negocio": {"texto":"The context usually interests executives and clients.","fonetica":"ðə ˈkɑntɛkst ˈjuʒəwəli ˈɪntɹəsts ɪɡˈzɛkjətɪvz ænd ˈklaɪənts"},
    "contenedor_desarrollo": {"texto":"Containers interest architects and senior developers.","fonetica":"kənˈteɪnɚz ˈɪntɹəst ˈɑɹkɪtɛkts ænd ˈsinjɚ dɪˈvɛləpɚz"},
    "componente_equipo": {"texto":"Components are useful for development teams.","fonetica":"kəmˈpoʊnənts ɑɹ ˈjusfəl fɔɹ dɪˈvɛləpmənt timz"},
    "codigo_programadores": {"texto":"The code level is key for programmers.","fonetica":"ðə koʊd ˈlɛvəl ɪz ki fɔɹ ˈpɹoʊɡɹæmɚz"},
    "ejemplo_c4_real": {"texto":"A real C4 example is modeling an online banking system.","fonetica":"ə ˈɹiəl ˈsi ˈfɔɹ ɪɡˈzæmpəl ɪz ˈmɑdəlɪŋ ən ˈɑnˌlaɪn ˈbæŋkɪŋ ˈsɪstəm"},
    "contexto_banca": {"texto":"The context shows the customer, ATMs, and external systems.","fonetica":"ðə ˈkɑntɛkst ʃoʊz ðə ˈkʌstəmɚ ˈeɪ ˈti ˈɛmz ænd ɪkˈstɝnəl ˈsɪstəmz"},
    "contenedor_banca": {"texto":"Containers represent the mobile app, web, and banking core.","fonetica":"kənˈteɪnɚz ˌɹɛprɪˈzɛnt ðə ˈmoʊbəl æp ðə wɛb ænd ðə ˈbæŋkɪŋ kɔɹ"},
    "componente_banca": {"texto":"Components detail authentication, payments, and queries.","fonetica":"kəmˈpoʊnənts ˈditeɪl ɔˌθɛntɪˈkeɪʃən ˈpeɪmənts ænd ˈkwɪɹiz"},
    "codigo_banca": {"texto":"The code level shows classes for users and transactions.","fonetica":"ðə koʊd ˈlɛvəl ʃoʊz ˈklæsɪz fɔɹ ˈjuzɚz ænd tɹænˈzækʃənz"},
    "claridad_c4": {"texto":"C4 helps maintain clarity in large projects.","fonetica":"ˈsi ˈfɔɹ hɛlps meɪnˈteɪn ˈklɛɹɪti ɪn lɑɹʤ ˈpɹɑʤɛkts"},
    "base_documentacion": {"texto":"C4 diagrams are the foundation for technical documentation.","fonetica":"ˈsi ˈfɔɹ ˈdaɪəˌɡɹæmz ɑɹ ðə faʊnˈdeɪʃən fɔɹ ˈtɛknɪkəl ˌdɑkjəmɛnˈteɪʃən"},
    "alineacion_equipo": {"texto":"C4 aligns technical team communication.","fonetica":"ˈsi ˈfɔɹ əˈlaɪnz ˈtɛknɪkəl tim kəˌmjunɪˈkeɪʃən"},
    "sencillez_valor": {"texto":"C4's simplicity is part of its value.","fonetica":"ˈsi ˈfɔɹz sɪmˈplɪsɪti ɪz pɑɹt əv ɪts ˈvælju"},
    "limitacion_detalle": {"texto":"C4 doesn't replace detailed documentation.","fonetica":"ˈsi ˈfɔɹ ˈdʌzənt ɹiˈpleɪs ˈditeɪld ˌdɑkjəmɛnˈteɪʃən"},
    "flexibilidad_uso": {"texto":"C4 diagrams adapt to different contexts.","fonetica":"ˈsi ˈfɔɹ ˈdaɪəˌɡɹæmz əˈdæpt tə ˈdɪfɚənt ˈkɑntɛksts"},
    "aprendizaje_facil": {"texto":"Learning C4 is easier than other modeling approaches.","fonetica":"ˈlɝnɪŋ ˈsi ˈfɔɹ ɪz ˈiziɚ ðæn ˈʌðɚɹ ˈmɑdəlɪŋ əˈpɹoʊʧɪz"},
    "resumen_final": {"texto":"C4 allows viewing a system from general to technical detail.","fonetica":"ˈsi ˈfɔɹ əˈlaʊz ˈvjuɪŋ ə ˈsɪstəm fɹəm ˈʤɛnɚəl tə ˈtɛknɪkəl ˈditeɪl"}
  }