{
  "c4_definicion": {"texto":"La arquitectura C4 es un modelo para visualizar sistemas de software.","fonetica":"la aɾki.teɾukˈtuɾa se kwatɾo es un moˈdelo paɾa βisua.liˈsaɾ siste.mas de softˈweɾ"},
  "c4_origen": {"texto":"El modelo C4 fue creado por Simon Brown.","fonetica":"el moˈdelo se kwatɾo fwe kɾeˈaðo poɾ ˈsajmon bɾaʊn"},
  "c4_objetivo": {"texto":"El objetivo de C4 es simplificar la comunicación de arquitecturas.","fonetica":"el oxβeˈtiβo de se kwatɾo es simplifiˈkaɾ la komunikaˈsjon de aɾkitekˈtuɾas"},
  "c4_niveles": {"texto":"C4 utiliza cuatro niveles de diagramas.","fonetica":"se kwatɾo utiˈlisa ˈkwatɾo niˈβeles de djaˈɣɾamas"},
  "c4_contexto": {"texto":"El primer nivel es el diagrama de contexto.","fonetica":"el pɾiˈmeɾ niˈβel es el djaˈɣɾama de konˈtekst̪o"},
  "c4_contenedor": {"texto":"El segundo nivel es el diagrama de contenedores.","fonetica":"el seˈɣundo niˈβel es el djaˈɣɾama de konteˈneðoɾes"},
  "c4_componentes": {"texto":"El tercer nivel es el diagrama de componentes.","fonetica":"el teɾˈseɾ niˈβel es el djaˈɣɾama de kompoˈnentes"},
  "c4_codigo": {"texto":"El cuarto nivel es el diagrama de código.","fonetica":"el ˈkwaɾto niˈβel es el djaˈɣɾama de ˈkoðiɣo"},
  "c4_comunicacion": {"texto":"C4 mejora la comunicación entre equipos técnicos y no técnicos.","fonetica":"se kwatɾo meˈxoɾa la komunikaˈsjon ˈentɾe ekiˈpos ˈtek.nikos i no ˈtek.nikos"},
  "c4_abstraccion": {"texto":"Cada nivel de C4 aporta un nivel distinto de abstracción.","fonetica":"ˈkaða niˈβel de se kwatɾo aˈpoɾta un niˈβel disˈtinto de aβstɾakˈsjon"},
  "c4_universidad": {"texto":"C4 se utiliza en universidades y empresas para enseñar arquitectura.","fonetica":"se kwatɾo se utiˈlisa en unibeɾsiðaðes i emˈpɾesas paɾa enseˈɲaɾ aɾkitekˈtuɾa"},
  "c4_documentacion": {"texto":"El modelo C4 ayuda a documentar sistemas de forma clara.","fonetica":"el moˈdelo se kwatɾo ˈaʝuða a dokumenˈtaɾ siste.mas de ˈfoɾma ˈklaɾa"},
  "c4_comprension": {"texto":"Los diagramas C4 facilitan la comprensión de sistemas complejos.","fonetica":"los djaˈɣɾamas se kwatɾo fasiˈlitan la komprenˈsjon de siste.mas komˈple.xos"},
  "c4_equipo": {"texto":"C4 permite que todos en el equipo compartan la misma visión.","fonetica":"se kwatɾo peɾˈmite ke ˈtoðos en el ekiˈpo komˈpaɾtan la ˈmisma βiˈsjon"},
  "c4_inversion": {"texto":"El modelo C4 reduce costos de aprendizaje en nuevos miembros.","fonetica":"el moˈdelo se kwatɾo reˈðuθe ˈkostos de apɾendiˈsaxe en ˈnweβos ˈmjembɾos"},
  "c4_representacion": {"texto":"C4 representa sistemas desde lo general hasta lo específico.","fonetica":"se kwatɾo repɾesenta siste.mas ˈdesðe lo xeneˈɾal asta lo espeˈsifi.ko"},
  "c4_flexibilidad": {"texto":"Los diagramas C4 son flexibles y adaptables.","fonetica":"los djaˈɣɾamas se kwatɾo son fleksiˈβles i aðapˈtables"},
  "c4_similitud_planos": {"texto":"C4 se inspira en planos de construcción de edificios.","fonetica":"se kwatɾo se insˈpiɾa en ˈplanos de konstɾukˈsjon de eðiˈfiθjos"},
  "c4_contexto_pregunta": {"texto":"El diagrama de contexto responde a la pregunta: ¿qué es este sistema?","fonetica":"el djaˈɣɾama de konˈtekst̪o resˈponde a la pɾeˈɣunta ke es ˈeste siste.ma"},
  "c4_contexto_externo": {"texto":"El diagrama de contexto muestra los actores externos.","fonetica":"el djaˈɣɾama de konˈtekst̪o ˈmwestɾa los akˈtoɾes ekstɛɾnos"},
  "c4_contexto_alcance": {"texto":"El diagrama de contexto define el alcance del sistema.","fonetica":"el djaˈɣɾama de konˈtekst̪o deˈfine el alˈkanθe del siste.ma"},
  "c4_contenedor_def": {"texto":"El diagrama de contenedores muestra las aplicaciones principales.","fonetica":"el djaˈɣɾama de konteˈneðoɾes ˈmwestɾa las aplikat͡sjoˈnes pɾint͡siˈpales"},
  "c4_contenedor_interaccion": {"texto":"Los contenedores representan aplicaciones o bases de datos.","fonetica":"los konteˈneðoɾes repɾesentan aplikat͡sjoˈnes o ˈbases de ˈðatos"},
  "c4_componentes_def": {"texto":"El diagrama de componentes detalla las piezas de cada aplicación.","fonetica":"el djaˈɣɾama de kompoˈnentes deˈtaʝa las ˈpjesas de ˈkaða aplikat͡sjon"},
  "c4_componentes_uso": {"texto":"Cada componente suele corresponder a una clase o módulo.","fonetica":"ˈkaða kompoˈnente ˈswele koɾesponˈdeɾ a una ˈklase o ˈmoðulo"},
  "c4_codigo_def": {"texto":"El diagrama de código muestra el diseño a nivel de clases y métodos.","fonetica":"el djaˈɣɾama de ˈkoðiɣo ˈmwestɾa el diseˈɲo a niˈβel de ˈklases i ˈmetodos"},
  "c4_codigo_detalle": {"texto":"Este nivel es opcional y depende del detalle requerido.","fonetica":"ˈeste niˈβel es oβθjoˈnal i deˈpende del deˈtaʝe rekeˈɾiðo"},
  "c4_codigo_documentacion": {"texto":"El nivel de código se usa para documentar decisiones específicas.","fonetica":"el niˈβel de ˈkoðiɣo se ˈusa paɾa dokumenˈtaɾ ðesiˈsjones espeˈsifikas"},
  "c4_codigo_publico": {"texto":"No siempre es necesario mostrar el nivel de código a todos.","fonetica":"no ˈsjempɾe es neθesˈaɾjo mosˈtɾaɾ el niˈβel de ˈkoðiɣo a ˈtoðos"}
,
  "c4_ventaja_claridad": {"texto":"Una ventaja de C4 es la claridad en la comunicación.","fonetica":"ˈuna βenˈtaxa de se kwatɾo es la klaɾiˈðað en la komunikaˈsjon"},
  "c4_ventaja_consistencia": {"texto":"C4 ofrece consistencia en la documentación de sistemas.","fonetica":"se kwatɾo oˈfɾese konsisˈtensja en la dokumen̪taˈsjon de siste.mas"},
  "c4_ventaja_aprendizaje": {"texto":"Los diagramas C4 aceleran el aprendizaje de nuevos desarrolladores.","fonetica":"los djaˈɣɾamas se kwatɾo aθeleˈɾan el apɾendiˈsaxe de ˈnweβos desaˈʝo.laðoɾes"},
  "c4_ventaja_colaboracion": {"texto":"C4 fomenta la colaboración entre equipos multidisciplinarios.","fonetica":"se kwatɾo foˈmenta la kolaboɾaˈsjon ˈentɾe ekiˈpos mul.tiði.sipliˈnaɾjos"},
  "c4_ventaja_escalabilidad": {"texto":"El modelo C4 es útil para sistemas grandes y escalables.","fonetica":"el moˈdelo se kwatɾo es ˈutil paɾa siste.mas ˈɣrandes i eskalaˈβles"},
  "c4_ventaja_foco": {"texto":"Cada nivel de C4 permite enfocarse en un aspecto distinto.","fonetica":"ˈkaða niˈβel de se kwatɾo peɾˈmite enfokaɾse en un asˈpekto disˈtinto"},
  "c4_limite_no_estandar": {"texto":"C4 no es un estándar oficial, pero es ampliamente usado.","fonetica":"se kwatɾo no es un esˈtandaɾ ofiˈθjal peɾo es am.pljaˈmente uˈsaðo"},
  "c4_limite_detalle": {"texto":"Un límite de C4 es que no prescribe niveles exactos de detalle.","fonetica":"un ˈlimite de se kwatɾo es ke no pɾeskɾiˈβe niˈβeles ekˈsaktos de deˈtaʝe"},
  "c4_limite_practica": {"texto":"La efectividad de C4 depende de la práctica del equipo.","fonetica":"la efektiβiˈðað de se kwatɾo deˈpende de la ˈpɾaktika del ekiˈpo"},
  "c4_limite_experiencia": {"texto":"El buen uso de C4 requiere experiencia en modelado.","fonetica":"el bwen ˈuso de se kwatɾo reˈkjeɾe ekspeɾiˈenθja en moðeˈlaðo"},
  "c4_contexto_ejemplo": {"texto":"Un ejemplo de diagrama de contexto es un sistema de banca en línea.","fonetica":"un exˈemplo de djaˈɣɾama de konˈtekst̪o es un siste.ma de ˈbaŋka en ˈlinja"},
  "c4_contenedor_ejemplo": {"texto":"En el diagrama de contenedores se ven la app web y la base de datos.","fonetica":"en el djaˈɣɾama de konteˈneðoɾes se βen la ap weβ i la ˈbase de ˈðatos"},
  "c4_componentes_ejemplo": {"texto":"Un componente de la app web puede ser el módulo de pagos.","fonetica":"un kompoˈnente de la ap weβ ˈpweðe seɾ el ˈmoðulo de ˈpaɣos"},
  "c4_codigo_ejemplo": {"texto":"En el nivel de código se detallan clases como Usuario o Transacción.","fonetica":"en el niˈβel de ˈkoðiɣo se deˈtaʝan ˈklases komo usuˈaɾjo o tɾansakˈsjon"},
  "c4_usabilidad_empresas": {"texto":"Muchas empresas usan C4 para documentar sus sistemas internos.","fonetica":"ˈmut͡ʃas emˈpɾesas usan se kwatɾo paɾa dokumenˈtaɾ sus siste.mas inˈteɾnos"},
  "c4_usabilidad_gobierno": {"texto":"Gobiernos también adoptan C4 en proyectos de tecnología.","fonetica":"ɡoˈβjeɾnos tamˈbjen aðoptan se kwatɾo en pɾoˈʝektos de teχnoloˈxia"},
  "c4_usabilidad_startups": {"texto":"Startups aplican C4 para comunicar rápidamente sus diseños.","fonetica":"ˈestaɾtaps apliˈkan se kwatɾo paɾa komunikaɾ ˈrapiðamente sus diˈseɲos"},
  "c4_usabilidad_educacion": {"texto":"En educación, C4 ayuda a enseñar arquitectura de software.","fonetica":"en edukat͡sjon se kwatɾo ˈaʝuða a enseˈɲaɾ aɾkitekˈtuɾa de softˈweɾ"},
  "c4_relacion_uml": {"texto":"C4 se complementa con UML, pero no lo reemplaza.","fonetica":"se kwatɾo se komplementa kon u eme ˈele peɾo no lo reemˈplasa"},
  "c4_relacion_arq": {"texto":"C4 no reemplaza otras arquitecturas, las hace más entendibles.","fonetica":"se kwatɾo no reemˈplasa ˈotɾas aɾkitekˈtuɾas las aˈse mas entenˈdiβles"},
  "c4_relacion_documentacion": {"texto":"C4 forma parte de la documentación arquitectónica.","fonetica":"se kwatɾo ˈfoɾma ˈpaɾte de la dokumen̪taˈsjon aɾkitekˈtonika"},
  "c4_relacion_bbdd": {"texto":"Los diagramas C4 no muestran tablas específicas de bases de datos.","fonetica":"los djaˈɣɾamas se kwatɾo no ˈmwestɾan ˈtablas espeˈsifikas de ˈbases de ˈðatos"},
  "c4_relacion_microservicios": {"texto":"C4 es muy útil para visualizar microservicios.","fonetica":"se kwatɾo es muj ˈutil paɾa βisua.liˈsaɾ mikɾoseɾˈβiθjos"},
  "c4_relacion_monolito": {"texto":"También se puede usar C4 en sistemas monolíticos.","fonetica":"tamˈbjen se ˈpweðe uˈsaɾ se kwatɾo en siste.mas monoˈlitikos"},
  "c4_relacion_eventos": {"texto":"Los diagramas C4 no muestran colas ni buses de eventos en detalle.","fonetica":"los djaˈɣɾamas se kwatɾo no ˈmwestɾan ˈkolas ni ˈbuses de eˈβentos en deˈtaʝe"},
  "c4_practica_iterativa": {"texto":"La creación de diagramas C4 suele ser iterativa.","fonetica":"la kɾeaˈsjon de djaˈɣɾamas se kwatɾo ˈswele seɾ iteɾaˈtiba"},
  "c4_practica_equipo": {"texto":"Es recomendable construir diagramas C4 en conjunto con el equipo.","fonetica":"es rekomendaˈβle konstɾuiɾ djaˈɣɾamas se kwatɾo en konˈxunto kon el ekiˈpo"},
  "c4_practica_herramientas": {"texto":"Existen herramientas en línea para crear diagramas C4.","fonetica":"ekˈsisten eraˈmjentas en ˈlinja paɾa kɾeaɾ djaˈɣɾamas se kwatɾo"},
  "c4_practica_plantillas": {"texto":"Muchas plantillas de C4 están disponibles en internet.","fonetica":"ˈmut͡ʃas planˈtiʝas de se kwatɾo esˈtan ðisponiˈβles en inteɾˈnet"}
,
  "c4_documentacion_necesidad": {"texto":"La documentación en C4 es necesaria para sistemas de larga duración.","fonetica":"la dokumen̪taˈsjon en se kwatɾo es neθesˈaɾja paɾa siste.mas de ˈlaɾɣaðuɾaˈsjon"},
  "c4_documentacion_actualizacion": {"texto":"Los diagramas C4 deben actualizarse cuando el sistema cambia.","fonetica":"los djaˈɣɾamas se kwatɾo ˈdeβen aktualiˈθaɾse ˈkwando el siste.ma ˈkambja"},
  "c4_documentacion_equipo": {"texto":"Es útil que todos en el equipo participen en la documentación C4.","fonetica":"es ˈutil ke ˈtoðos en el ekiˈpo paɾtisiˈpen en la dokumen̪taˈsjon se kwatɾo"},
  "c4_documentacion_mantenimiento": {"texto":"El mantenimiento de diagramas C4 asegura la coherencia del diseño.","fonetica":"el mantenˈimiento de djaˈɣɾamas se kwatɾo aseˈɣuɾa la koeˈɾensja del diˈseɲo"},
  "c4_documentacion_versiones": {"texto":"Se recomienda mantener versiones de los diagramas C4.","fonetica":"se rekommenˈda mantenˈeɾ beɾˈsiones de los djaˈɣɾamas se kwatɾo"},
  "c4_uso_inicio": {"texto":"C4 se aplica desde el inicio de un proyecto de software.","fonetica":"se kwatɾo se aˈplika ˈdesðe el iˈnisjo de un pɾoˈʝekto de softˈweɾ"},
  "c4_uso_refactor": {"texto":"También se usa C4 durante procesos de refactorización.","fonetica":"tamˈbjen se ˈusa se kwatɾo duˈɾante pɾoˈθesos de refaktoɾiθaˈsjon"},
  "c4_uso_onboarding": {"texto":"C4 es clave en el onboarding de nuevos desarrolladores.","fonetica":"se kwatɾo es ˈklaβe en el onˈboɾðin de ˈnweβos desaʝoˈlaðoɾes"},
  "c4_uso_auditoria": {"texto":"Los diagramas C4 apoyan auditorías de software.","fonetica":"los djaˈɣɾamas se kwatɾo aˈpoʝan awðitoˈɾias de softˈweɾ"},
  "c4_uso_seguridad": {"texto":"C4 ayuda a mapear flujos de seguridad dentro del sistema.","fonetica":"se kwatɾo aˈʝuða a maˈpeaɾ ˈfluxos de seɣuɾiˈðað ˈdentɾo del siste.ma"},
  "c4_diagrama_contexto_usuario": {"texto":"El diagrama de contexto identifica usuarios y sistemas externos.","fonetica":"el djaˈɣɾama de konˈtekst̪o iðentifiˈka usuˈaɾjos i siste.mas ekstɛɾnos"},
  "c4_diagrama_contexto_dominio": {"texto":"En contexto se define el dominio del sistema.","fonetica":"en konˈtekst̪o se deˈfine el doˈminjo del siste.ma"},
  "c4_diagrama_contenedor_app": {"texto":"Un contenedor suele ser una aplicación desplegable.","fonetica":"un konteˈneðoɾ ˈswele seɾ una aplikat͡sjon despleˈɣaβle"},
  "c4_diagrama_contenedor_db": {"texto":"Otro contenedor típico es una base de datos.","fonetica":"ˈotɾo konteˈneðoɾ ˈtipiko es una ˈbase de ˈðatos"},
  "c4_diagrama_componentes_api": {"texto":"Un componente puede representar una API de negocio.","fonetica":"un kompoˈnente ˈpweðe repɾesentaɾ una a pe i de neˈɣoθjo"},
  "c4_diagrama_componentes_servicio": {"texto":"Otro componente puede ser un servicio de autenticación.","fonetica":"ˈotɾo kompoˈnente ˈpweðe seɾ un seɾˈβisjo de awtentikaˈsjon"},
  "c4_diagrama_codigo_clase": {"texto":"En código se detallan clases y sus métodos principales.","fonetica":"en ˈkoðiɣo se deˈtaʝan ˈklases i sus ˈmetodos pɾint͡siˈpales"},
  "c4_diagrama_codigo_test": {"texto":"También pueden documentarse clases de prueba en C4.","fonetica":"tamˈbjen ˈpweðen dokumenˈtaɾse ˈklases de ˈpɾweβa en se kwatɾo"},
  "c4_herramienta_drawio": {"texto":"Draw.io es una herramienta popular para diagramas C4.","fonetica":"ˈdɾaw.io es una eraˈmjenta popuˈlaɾ paɾa djaˈɣɾamas se kwatɾo"},
  "c4_herramienta_structurizr": {"texto":"Structurizr fue creada por Simon Brown para soportar C4.","fonetica":"stɾuktjuˈɾizɾ fwe kɾeˈaða poɾ ˈsajmon bɾaʊn paɾa sopoɾˈtaɾ se kwatɾo"},
  "c4_herramienta_plantuml": {"texto":"PlantUML también soporta diagramas C4.","fonetica":"ˈplant u eme ˈele tamˈbjen sopoɾta djaˈɣɾamas se kwatɾo"},
  "c4_herramienta_mermaid": {"texto":"Mermaid permite crear diagramas C4 en markdown.","fonetica":"ˈmeɾmejd peɾˈmite kɾeaɾ djaˈɣɾamas se kwatɾo en ˈmaɾkdaun"},
  "c4_practica_simplificacion": {"texto":"El objetivo es simplificar, no añadir complejidad.","fonetica":"el oxβeˈtiβo es simplifikaɾ no aˈnaðir kompleχiˈðað"},
  "c4_practica_abstraccion": {"texto":"Cada nivel mantiene el principio de abstracción apropiado.","fonetica":"ˈkaða niˈβel mantenˈe el pɾinˈθipjo de aβstɾakˈsjon apɾoˈpjado"},
  "c4_practica_independencia": {"texto":"Los diagramas deben ser independientes de la tecnología.","fonetica":"los djaˈɣɾamas ˈdeβen seɾ indepenˈðjentes de la teχnoloˈxia"},
  "c4_practica_comprension": {"texto":"El lector debe comprender rápidamente la estructura.","fonetica":"el lekˈtoɾ ˈdeβe komprenˈdeɾ ˈrapiðamente la estɾukˈtuɾa"},
  "c4_practica_historia": {"texto":"Los diagramas C4 deben contar la historia del sistema.","fonetica":"los djaˈɣɾamas se kwatɾo ˈdeβen kontaɾ la isˈtoɾja del siste.ma"},
  "c4_practica_restriccion": {"texto":"Es recomendable no sobrecargar los diagramas con detalle.","fonetica":"es rekomendaˈβle no soβɾekaɾˈɣaɾ los djaˈɣɾamas kon deˈtaʝe"}
,
  "codigo_no_es_diagrama": {"texto":"El código fuente no es un buen diagrama de arquitectura.","fonetica":"el ˈkoðiɣo ˈfwente no es un βwen djaˈɣɾama ðe aɾkiteɾukˈtuɾa"},
  "necesidad_visualizacion": {"texto":"Necesitamos visualizar la arquitectura para todos los interesados.","fonetica":"neθesitaˈmos βiswaliθaɾ la aɾkiteɾukˈtuɾa paɾa toðos los inteɾeˈsaðos"},
  "mapa_comunicacion": {"texto":"Los diagramas son mapas de comunicación.","fonetica":"los djaˈɣɾamas son ˈmapas ðe komunikaˈθjon"},
  "nivel_contexto": {"texto":"El nivel de contexto muestra cómo el sistema interactúa con su entorno.","fonetica":"el niˈβel ðe konˈtekst̪o ˈmwes.tɾa ˈkomo el sisˈtema inteɾakˈtwa kon su enˈtoɾno"},
  "nivel_contenedor": {"texto":"El nivel de contenedor explica las aplicaciones y servicios principales.","fonetica":"el niˈβel ðe konteneˈðor eksˈplika las apliˈkaθjones i seɾˈβiθjos pɾinθipaˈles"},
  "nivel_componente": {"texto":"El nivel de componente detalla las partes internas de cada contenedor.","fonetica":"el niˈβel ðe komponˈente deˈtaʝa las ˈpaɾtes inteɾnas ðe ˈkaða konteneˈðor"},
  "nivel_codigo": {"texto":"El nivel de código ilustra cómo se implementa un componente.","fonetica":"el niˈβel ðe ˈkoðiɣo ilusˈtɾa ˈkomo se implemenˈta un komponˈente"},
  "ejemplo_contexto": {"texto":"En el contexto se muestra al usuario, sistemas externos y el sistema principal.","fonetica":"en el konˈtekst̪o se ˈmwes.tɾa al usuˈaɾjo, sisteˈmas eksˈteɾnos i el sisˈtema pɾinθipal"},
  "ejemplo_contenedor": {"texto":"En el nivel de contenedor podemos ver una web app, base de datos y API.","fonetica":"en el niˈβel ðe konteneˈðor poˈðemos βeɾ una weβ ap, ˈβase ðe ˈðatos i ˈa.pi"},
  "ejemplo_componente": {"texto":"En el nivel de componente vemos controladores, servicios y repositorios.","fonetica":"en el niˈβel ðe komponˈente ˈβemos kontrolaˈðoɾes, seɾˈβiθjos i repozitoˈɾjos"},
  "ejemplo_codigo": {"texto":"En el nivel de código vemos clases, métodos y estructuras.","fonetica":"en el niˈβel ðe ˈkoðiɣo ˈβemos ˈklases, ˈmetodos i estɾuktuˈɾas"},
  "audiencia_distinta": {"texto":"Cada nivel está diseñado para una audiencia distinta.","fonetica":"ˈkaða niˈβel esˈta ði.seˈɲaðo paɾa una auˈðjenθja ðisˈtinta"},
  "contexto_negocio": {"texto":"El contexto suele interesar a directivos y clientes.","fonetica":"el konˈtekst̪o ˈswe.le inteɾeˈsaɾ a diɾekˈtiβos i ˈkljentes"},
  "contenedor_desarrollo": {"texto":"Los contenedores interesan a arquitectos y desarrolladores senior.","fonetica":"los konteneˈðoɾes inteˈɾesan a aɾkitektos i desaʝaˈðoɾes ˈsenjoɾ"},
  "componente_equipo": {"texto":"Los componentes son útiles para equipos de desarrollo.","fonetica":"los komponˈentes son ˈutiles paɾa eˈkipos ðe desaʝoˈʝo"},
  "codigo_programadores": {"texto":"El nivel de código es clave para los programadores.","fonetica":"el niˈβel ðe ˈkoðiɣo es ˈklaβe paɾa los pɾoɣɾamaˈðoɾes"},
  "ejemplo_c4_real": {"texto":"Un ejemplo real de C4 es modelar un sistema de banca en línea.","fonetica":"un eˈxemplo reˈal ðe seˈkwatɾo es moðeˈlaɾ un sisˈtema ðe ˈbaŋka en ˈlinja"},
  "contexto_banca": {"texto":"En contexto se muestra al cliente, cajeros y sistemas externos.","fonetica":"en konˈtekst̪o se ˈmwes.tɾa al kljenˈte, kaˈxeɾos i sisteˈmas eksˈteɾnos"},
  "contenedor_banca": {"texto":"En contenedores se representan la app móvil, la web y el core bancario.","fonetica":"en konteneˈðoɾes se repɾesenta la ap ˈmoβil, la weβ i el koɾe βanˈkaɾjo"},
  "componente_banca": {"texto":"En componentes se detallan autenticación, pagos y consultas.","fonetica":"en komponˈentes se deˈtaʝan awtentiθaˈθjon, ˈpaɣos i konsulˈtas"},
  "codigo_banca": {"texto":"En código se muestran clases para usuarios y transacciones.","fonetica":"en ˈkoðiɣo se ˈmwes.tɾan ˈklases paɾa usuˈaɾjos i tɾansakθjoˈnes"},
  "claridad_c4": {"texto":"C4 ayuda a mantener la claridad en proyectos grandes.","fonetica":"seˈkwatɾo aˈʝuða a mantenˈeɾ la klaɾiˈðað en pɾoˈxektos ˈɣrandes"},
  "base_documentacion": {"texto":"Los diagramas C4 son base para la documentación técnica.","fonetica":"los djaˈɣɾamas seˈkwatɾo son ˈβase paɾa la ðokumen.taˈθjon ˈtekni.ka"},
  "alineacion_equipo": {"texto":"C4 alinea la comunicación del equipo técnico.","fonetica":"seˈkwatɾo aliˈnea la komunikaˈθjon ðel ekiˈpo ˈtekni.ko"},
  "sencillez_valor": {"texto":"La sencillez de C4 es parte de su valor.","fonetica":"la senθiˈʝeθ ðe seˈkwatɾo es ˈpaɾte ðe su βaˈloɾ"},
  "limitacion_detalle": {"texto":"C4 no reemplaza la documentación detallada.","fonetica":"seˈkwatɾo no reemˈplasa la ðokumen.taˈθjon detaˈʝaða"},
  "flexibilidad_uso": {"texto":"Los diagramas C4 se adaptan a distintos contextos.","fonetica":"los djaˈɣɾamas seˈkwatɾo se aðapˈtan a ðisˈtintos konˈtekstos"},
  "aprendizaje_facil": {"texto":"Aprender C4 es más fácil que otros enfoques de modelado.","fonetica":"apɾenˈdeɾ seˈkwatɾo es mas ˈfasil ke ˈotɾos enfo.kes ðe moðeˈlaðo"},
  "resumen_final": {"texto":"C4 permite ver un sistema desde lo general hasta el detalle técnico.","fonetica":"seˈkwatɾo peɾˈmite βeɾ un sisˈtema ˈðesðe lo xeneˈɾal ˈasta el detaˈʝe ˈtekni.ko"}
}
