{
  "hexagonal_intro_1": {"texto":"La arquitectura hexagonal se centra en la independencia de las capas.","fonetica":"la aɾki.teɾˈtuɾa exaɣoˈnal se ˈsentɾa en la indepenˈdensja de las ˈkapas"},
  "hexagonal_intro_2": {"texto":"También se conoce como arquitectura de puertos y adaptadores.","fonetica":"tamˈbjen se koˈno.se ko.mo aɾki.teɾˈtuɾa de ˈpweɾtos i aðaptaˈðoɾes"},
  "hexagonal_intro_3": {"texto":"Su objetivo es aislar el dominio central de los detalles externos.","fonetica":"su oβxeˈtiβo es aiˈslar el doˈminjo senˈtɾal de los deˈtaʝes eksˈteɾnos"},
  "hexagonal_intro_4": {"texto":"El dominio representa las reglas de negocio puras.","fonetica":"el doˈminjo repɾeˈsenta las ˈreɣlas de neˈɣoθjo ˈpuɾas"},
  "hexagonal_intro_5": {"texto":"Los adaptadores conectan el dominio con el mundo exterior.","fonetica":"los aðaptaˈðoɾes koˈnektan el doˈminjo kon el ˈmundo ekstɛˈɾjoɾ"},
  "hexagonal_intro_6": {"texto":"Un puerto define una interfaz para la comunicación.","fonetica":"un ˈpweɾto deˈfine una inteɾˈfas paɾa la komunikaˈθjon"},
  "hexagonal_intro_7": {"texto":"Los puertos abstraen las interacciones externas.","fonetica":"los ˈpweɾtos aβstɾaˈen las inteɾakˈθjones ekstɛɾˈnas"},
  "hexagonal_intro_8": {"texto":"Los adaptadores implementan la comunicación real.","fonetica":"los aðaptaˈðoɾes impleˈmentan la komunikaˈθjon reˈal"},
  "hexagonal_intro_9": {"texto":"Se busca que el dominio no dependa de la infraestructura.","fonetica":"se ˈbuska ke el doˈminjo no deˈpenda de la infɾastɾukˈtuɾa"},
  "hexagonal_intro_10": {"texto":"El dominio se mantiene estable aunque cambie la tecnología.","fonetica":"el doˈminjo se manˈtjene esˈtaβle ˈaunke ˈkambje la teχnoˈloxia"},
  "hexagonal_intro_11": {"texto":"El núcleo de negocio es el corazón del sistema.","fonetica":"el ˈnukleo de neˈɣoθjo es el koɾaˈθon del sisˈtema"},
  "hexagonal_intro_12": {"texto":"La arquitectura hexagonal mejora la mantenibilidad.","fonetica":"la aɾki.teɾˈtuɾa exaɣoˈnal meˈxoɾa la mantenibiˈlidad"},
  "hexagonal_intro_13": {"texto":"Favorece las pruebas unitarias del dominio.","fonetica":"faβoˈɾeθe las ˈpɾweβas unitaˈɾjas del doˈminjo"},
  "hexagonal_intro_14": {"texto":"Reduce el acoplamiento con frameworks y librerías.","fonetica":"reˈðuθe el akoˈplamjento kon ˈfɾeimwoɾks i liβɾeˈɾias"},
  "hexagonal_intro_15": {"texto":"Permite reemplazar bases de datos sin afectar el dominio.","fonetica":"peɾˈmite reemplaˈθaɾ ˈbases de ˈdatos sin afekˈtaɾ el doˈminjo"},
  "hexagonal_intro_16": {"texto":"Los detalles de infraestructura son secundarios.","fonetica":"los deˈtaʝes de infɾastɾukˈtuɾa son sekundaˈɾjos"},
  "hexagonal_intro_17": {"texto":"El modelo hexagonal impulsa la modularidad.","fonetica":"el moˈðelo exaɣoˈnal imˈpulsa la moðulaɾiˈðað"},
  "hexagonal_intro_18": {"texto":"Separa claramente las responsabilidades.","fonetica":"seˈpaɾa klaɾaˈmente las respo̝nsabiliðaðes"},
  "hexagonal_intro_19": {"texto":"El núcleo no conoce detalles de entrada o salida.","fonetica":"el ˈnukleo no koˈnoθe deˈtaʝes de enˈtɾaða o saˈliða"},
  "hexagonal_intro_20": {"texto":"Los puertos definen cómo se comunica el dominio.","fonetica":"los ˈpweɾtos deˈfinen ˈkomo se komunika el doˈminjo"},
  "hexagonal_intro_21": {"texto":"Los adaptadores implementan la infraestructura.","fonetica":"los aðaptaˈðoɾes impleˈmentan la infɾastɾukˈtuɾa"},
  "hexagonal_intro_22": {"texto":"La independencia tecnológica es un beneficio clave.","fonetica":"la indepenˈðenθja teχnoˈloxika es un βenefiθjo ˈklaβe"},
  "hexagonal_intro_23": {"texto":"El dominio puede evolucionar sin restricciones externas.","fonetica":"el doˈminjo ˈpweðe eβoluthjoˈnaɾ sin restɾikθjones ekstɛɾˈnas"},
  "hexagonal_intro_24": {"texto":"Se favorece la reutilización de componentes.","fonetica":"se faβoˈɾeθe la reu.tiliθaˈθjon de komponˈentes"},
  "hexagonal_intro_25": {"texto":"La arquitectura hexagonal facilita el testing.","fonetica":"la aɾki.teɾˈtuɾa exaɣoˈnal fasilita el ˈtestin"},
  "hexagonal_intro_26": {"texto":"Los casos de uso se prueban sin infraestructura externa.","fonetica":"los ˈkasos de ˈuso se ˈpɾweβan sin infɾastɾukˈtuɾa ekstɛɾˈna"},
  "hexagonal_intro_27": {"texto":"Es un estilo centrado en el dominio.","fonetica":"es un esˈtilo senˈtɾaðo en el doˈminjo"},
  "hexagonal_intro_28": {"texto":"El núcleo debe ser puro y sin dependencias externas.","fonetica":"el ˈnukleo ˈdeβe seɾ ˈpuɾo i sin dependenθjas ekstɛɾˈnas"},
  "hexagonal_intro_29": {"texto":"Los adaptadores se pueden reemplazar fácilmente.","fonetica":"los aðaptaˈðoɾes se ˈpweðen reemplaˈθaɾ fasilˈmente"},
  "hexagonal_intro_30": {"texto":"La arquitectura hexagonal promueve la flexibilidad.","fonetica":"la aɾki.teɾˈtuɾa exaɣoˈnal pɾoˈmweβe la fleksiβiliˈðað"}
,
  "hexagonal_puertos_31": {"texto":"Un puerto de entrada define cómo se reciben solicitudes.","fonetica":"un ˈpweɾto de enˈtɾaða deˈfine ˈkomo se reθiˈβen solisiˈtudes"},
  "hexagonal_puertos_32": {"texto":"Un puerto de salida define cómo se envían respuestas.","fonetica":"un ˈpweɾto de saˈliða deˈfine ˈkomo se emˈβian resˈpwestas"},
  "hexagonal_puertos_33": {"texto":"Los puertos permiten independencia de las interfaces externas.","fonetica":"los ˈpweɾtos peɾˈmiten indepenˈdensja de las inteɾˈfases ekstɛɾˈnas"},
  "hexagonal_puertos_34": {"texto":"Cada puerto representa un contrato de comunicación.","fonetica":"ˈkaða ˈpweɾto repɾeˈsenta un konˈtɾakto de komunikaˈθjon"},
  "hexagonal_puertos_35": {"texto":"Los adaptadores implementan esos contratos.","fonetica":"los aðaptaˈðoɾes impleˈmentan ˈesos konˈtɾaktos"},
  "hexagonal_puertos_36": {"texto":"Un adaptador de entrada traduce solicitudes externas.","fonetica":"un aðaptaˈðoɾ de enˈtɾaða tɾaˈðuθe solisiˈtudes ekstɛɾˈnas"},
  "hexagonal_puertos_37": {"texto":"Un adaptador de salida traduce respuestas del dominio.","fonetica":"un aðaptaˈðoɾ de saˈliða tɾaˈðuθe resˈpwestas del doˈminjo"},
  "hexagonal_puertos_38": {"texto":"Los adaptadores son reemplazables sin tocar el núcleo.","fonetica":"los aðaptaˈðoɾes son reemplaˈθaβles sin toˈkaɾ el ˈnukleo"},
  "hexagonal_puertos_39": {"texto":"Los puertos evitan dependencias rígidas.","fonetica":"los ˈpweɾtos eˈβitan dependenθjas ˈrixiðas"},
  "hexagonal_puertos_40": {"texto":"El núcleo no conoce la implementación concreta.","fonetica":"el ˈnukleo no koˈnoθe la implemenˈtaθjon konˈkɾeta"},
  "hexagonal_puertos_41": {"texto":"Los adaptadores conectan bases de datos, APIs o interfaces.","fonetica":"los aðaptaˈðoɾes koˈnektan ˈbases de ˈðatos ˈapis o inteɾˈfases"},
  "hexagonal_puertos_42": {"texto":"El puerto define qué se necesita, no cómo se hace.","fonetica":"el ˈpweɾto deˈfine ke se nesiˈsita, no ˈkomo se ˈase"},
  "hexagonal_puertos_43": {"texto":"El adaptador define cómo lograr la comunicación.","fonetica":"el aðaptaˈðoɾ deˈfine ˈkomo loˈɣɾaɾ la komunikaˈθjon"},
  "hexagonal_puertos_44": {"texto":"Los puertos actúan como puntos de conexión.","fonetica":"los ˈpweɾtos akˈtwan ˈkomo ˈpuntos de konekˈθjon"},
  "hexagonal_puertos_45": {"texto":"Los adaptadores son específicos de la tecnología usada.","fonetica":"los aðaptaˈðoɾes son espeθiˈfikos de la teχnoˈloxia uˈsaða"},
  "hexagonal_puertos_46": {"texto":"Un puerto puede tener múltiples adaptadores.","fonetica":"un ˈpweɾto ˈpweðe teˈneɾ ˈmultiplɛs aðaptaˈðoɾes"},
  "hexagonal_puertos_47": {"texto":"Esto permite soportar distintas tecnologías al mismo tiempo.","fonetica":"ˈesto peɾˈmite soˈpoɾtaɾ ðisˈtintas teχnoˈloxias al ˈmizmo ˈtjempo"},
  "hexagonal_puertos_48": {"texto":"El dominio no se entera de qué adaptador se usa.","fonetica":"el doˈminjo no se enˈteɾa de ke aðaptaˈðoɾ se ˈusa"},
  "hexagonal_puertos_49": {"texto":"Los puertos definen la frontera del dominio.","fonetica":"los ˈpweɾtos deˈfinen la fɾonˈteɾa del doˈminjo"},
  "hexagonal_puertos_50": {"texto":"Los adaptadores son reemplazables para evolucionar el sistema.","fonetica":"los aðaptaˈðoɾes son reemplaˈθaβles paɾa eβoluthjoˈnaɾ el sisˈtema"},
  "hexagonal_puertos_51": {"texto":"Los puertos facilitan pruebas sin infraestructura real.","fonetica":"los ˈpweɾtos fasiˈlitan ˈpɾweβas sin infɾastɾukˈtuɾa reˈal"},
  "hexagonal_puertos_52": {"texto":"Los adaptadores simulan la infraestructura en pruebas.","fonetica":"los aðaptaˈðoɾes simuˈlan la infɾastɾukˈtuɾa en ˈpɾweβas"},
  "hexagonal_puertos_53": {"texto":"Un puerto de entrada puede ser una API REST.","fonetica":"un ˈpweɾto de enˈtɾaða ˈpweðe seɾ una aˈpi rest"},
  "hexagonal_puertos_54": {"texto":"Un adaptador de salida puede ser un repositorio de datos.","fonetica":"un aðaptaˈðoɾ de saˈliða ˈpweðe seɾ un repostiˈtoɾjo de ˈðatos"},
  "hexagonal_puertos_55": {"texto":"Los puertos mantienen el dominio desacoplado.","fonetica":"los ˈpweɾtos manˈtjenen el doˈminjo ðesakoˈplaðo"},
  "hexagonal_puertos_56": {"texto":"Los adaptadores permiten conectar con usuarios o sistemas externos.","fonetica":"los aðaptaˈðoɾes peɾˈmiten konekˈtaɾ kon usuˈaɾjos o sisˈtemas ekstɛɾˈnos"},
  "hexagonal_puertos_57": {"texto":"Un puerto expone casos de uso a clientes externos.","fonetica":"un ˈpweɾto eksˈpone ˈkasos de ˈuso a kljenˈtes ekstɛɾˈnos"},
  "hexagonal_puertos_58": {"texto":"Un adaptador implementa la lógica para un cliente específico.","fonetica":"un aðaptaˈðoɾ impleˈmenta la ˈloxika paɾa un kljenˈte espeθiˈfiko"},
  "hexagonal_puertos_59": {"texto":"Los puertos delimitan responsabilidades claras.","fonetica":"los ˈpweɾtos delimiˈtan respo̝nsabiliðaðes ˈklaɾas"},
  "hexagonal_puertos_60": {"texto":"Los adaptadores simplifican el reemplazo tecnológico.","fonetica":"los aðaptaˈðoɾes simpliˈfikan el reemplaˈθo teχnoˈloxiko"}
,
  "hexagonal_casos_61": {"texto":"Los casos de uso representan acciones del dominio.","fonetica":"los ˈkasos de ˈuso repɾezenˈtan akˈθjones del doˈminjo"},
  "hexagonal_casos_62": {"texto":"Cada caso de uso es independiente de la infraestructura.","fonetica":"ˈkaða ˈkaso de ˈuso es indepenˈðjente de la infɾastɾukˈtuɾa"},
  "hexagonal_casos_63": {"texto":"Un caso de uso define un flujo de negocio.","fonetica":"un ˈkaso de ˈuso deˈfine un ˈflu.xo de neˈɣoθjo"},
  "hexagonal_casos_64": {"texto":"Los casos de uso son orquestados por el núcleo.","fonetica":"los ˈkasos de ˈuso son oɾkesˈtaðos poɾ el ˈnukleo"},
  "hexagonal_casos_65": {"texto":"El dominio ejecuta reglas sin importar el entorno.","fonetica":"el doˈminjo exeˈkuta ˈreɣlas sin impoɾˈtaɾ el enˈtoɾno"},
  "hexagonal_casos_66": {"texto":"Los adaptadores llaman a los casos de uso.","fonetica":"los aðaptaˈðoɾes ˈʝaman a los ˈkasos de ˈuso"},
  "hexagonal_casos_67": {"texto":"Un puerto expone casos de uso a la aplicación.","fonetica":"un ˈpweɾto eksˈpone ˈkasos de ˈuso a la apliˈkaθjon"},
  "hexagonal_casos_68": {"texto":"Los casos de uso no deben conocer los detalles externos.","fonetica":"los ˈkasos de ˈuso no ˈdeβen ko.noˈθeɾ los deˈtaʝes ekstɛɾˈnos"},
  "hexagonal_casos_69": {"texto":"Los casos de uso coordinan entidades y servicios.","fonetica":"los ˈkasos de ˈuso koorðiˈnan entiˈðaðes i seɾˈβisjos"},
  "hexagonal_casos_70": {"texto":"El diseño se enfoca en la lógica de negocio.","fonetica":"el diˈseɲo se enˈfoka en la ˈloxika de neˈɣoθjo"},
  "hexagonal_casos_71": {"texto":"Los casos de uso se prueban fácilmente sin dependencias.","fonetica":"los ˈkasos de ˈuso se ˈpɾweβan ˈfasilmjente sin dependenθjas"},
  "hexagonal_casos_72": {"texto":"Un caso de uso describe cómo interactúan los actores.","fonetica":"un ˈkaso de ˈuso desˈkɾiβe ˈkomo inteɾakˈtwan los akˈtoɾes"},
  "hexagonal_casos_73": {"texto":"Los actores externos solo conocen puertos, no el núcleo.","fonetica":"los akˈtoɾes ekstɛɾˈnos ˈsolo koˈnoθen ˈpweɾtos, no el ˈnukleo"},
  "hexagonal_casos_74": {"texto":"Los casos de uso coordinan la lógica sin dependencias directas.","fonetica":"los ˈkasos de ˈuso kooɾðiˈnan la ˈloxika sin dependenθjas diˈɾektas"},
  "hexagonal_casos_75": {"texto":"El núcleo gestiona las reglas de negocio puras.","fonetica":"el ˈnukleo xesˈtjona las ˈreɣlas de neˈɣoθjo ˈpuɾas"},
  "hexagonal_casos_76": {"texto":"Los casos de uso son reutilizables en distintos entornos.","fonetica":"los ˈkasos de ˈuso son reu.tiliˈθaβles en ðisˈtintos enˈtoɾnos"},
  "hexagonal_casos_77": {"texto":"Un adaptador activa un caso de uso específico.","fonetica":"un aðaptaˈðoɾ akˈtiβa un ˈkaso de ˈuso espeθiˈfiko"},
  "hexagonal_casos_78": {"texto":"Los casos de uso garantizan separación de responsabilidades.","fonetica":"los ˈkasos de ˈuso ɣaɾanˈtizan sepaɾaθjon de respo̝nsabiliðaðes"},
  "hexagonal_casos_79": {"texto":"El núcleo no debe depender de librerías externas.","fonetica":"el ˈnukleo no ˈdeβe deˈpendeɾ de liβɾeˈɾias ekstɛɾˈnas"},
  "hexagonal_casos_80": {"texto":"Los casos de uso son estables aunque cambie la tecnología.","fonetica":"los ˈkasos de ˈuso son esˈtaβles ˈaunke ˈkambje la teχnoˈloxia"},
  "hexagonal_casos_81": {"texto":"Los casos de uso expresan la intención del negocio.","fonetica":"los ˈkasos de ˈuso eksˈpɾesan la intenˈθjon del neˈɣoθjo"},
  "hexagonal_casos_82": {"texto":"El dominio se mantiene protegido de cambios externos.","fonetica":"el doˈminjo se manˈtjɛne pɾoteˈxido de ˈkambjos ekstɛɾˈnos"},
  "hexagonal_casos_83": {"texto":"Los casos de uso pueden llamarse desde diferentes interfaces.","fonetica":"los ˈkasos de ˈuso ˈpweðen ʝaˈmaɾse desde ði.feˈɾentes inteɾˈfases"},
  "hexagonal_casos_84": {"texto":"Los casos de uso son independientes del almacenamiento.","fonetica":"los ˈkasos de ˈuso son indepenˈðjentes del al.maseˈnamiento"},
  "hexagonal_casos_85": {"texto":"Un caso de uso resuelve un problema concreto del negocio.","fonetica":"un ˈkaso de ˈuso reˈswelβe un pɾoˈβlema konˈkɾeto del neˈɣoθjo"},
  "hexagonal_casos_86": {"texto":"El núcleo es estable aunque se reemplace la base de datos.","fonetica":"el ˈnukleo es esˈtaβle ˈaunke se reemˈplaθe la ˈβase de ˈðatos"},
  "hexagonal_casos_87": {"texto":"Los casos de uso se prueban con facilidad mediante mocks.","fonetica":"los ˈkasos de ˈuso se ˈpɾweβan kon fasiˈliðað meˈðjante ˈmoks"},
  "hexagonal_casos_88": {"texto":"Cada caso de uso debe tener una intención clara.","fonetica":"ˈkaða ˈkaso de ˈuso ˈdeβe teˈneɾ una intenˈθjon ˈklaɾa"},
  "hexagonal_casos_89": {"texto":"Los casos de uso protegen la lógica central.","fonetica":"los ˈkasos de ˈuso pɾoteˈxen la ˈloxika senˈtɾal"},
  "hexagonal_casos_90": {"texto":"El núcleo orquesta los casos de uso de manera coherente.","fonetica":"el ˈnukleo oɾˈkesta los ˈkasos de ˈuso de maˈneɾa koeˈɾente"}
,
  "hexagonal_avanzado_91": {"texto":"La arquitectura hexagonal facilita el cambio de frameworks.","fonetica":"la aɾki.teɾˈtuɾa exaɣoˈnal fasilita el ˈtʃanxo de ˈfɾeimwoɾks"},
  "hexagonal_avanzado_92": {"texto":"Los casos de uso pueden adaptarse a distintos entornos.","fonetica":"los ˈkasos de ˈuso ˈpweðen aðapˈtaɾse a ðisˈtintos enˈtoɾnos"},
  "hexagonal_avanzado_93": {"texto":"La separación de capas reduce la complejidad.","fonetica":"la sepaɾaˈθjon de ˈkapas reˈðuθe la kompleχiˈðað"},
  "hexagonal_avanzado_94": {"texto":"El núcleo no depende de frameworks de terceros.","fonetica":"el ˈnukleo no deˈpende de ˈfɾeimwoɾks de teɾˈθeɾos"},
  "hexagonal_avanzado_95": {"texto":"Los adaptadores manejan la persistencia de datos.","fonetica":"los aðaptaˈðoɾes maˈnexan la peɾsisˈtensja de ˈðatos"},
  "hexagonal_avanzado_96": {"texto":"El dominio desconoce la base de datos utilizada.","fonetica":"el doˈminjo ðeskoˈnoθe la ˈβase de ˈðatos utiliˈθaða"},
  "hexagonal_avanzado_97": {"texto":"Se pueden probar reglas de negocio sin servicios externos.","fonetica":"se ˈpweðen pɾoˈβaɾ ˈreɣlas de neˈɣoθjo sin seɾˈβisjos ekstɛɾˈnos"},
  "hexagonal_avanzado_98": {"texto":"Los puertos definen contratos claros para el dominio.","fonetica":"los ˈpweɾtos deˈfinen konˈtɾaktos ˈklaɾos paɾa el doˈminjo"},
  "hexagonal_avanzado_99": {"texto":"Los adaptadores implementan la comunicación real con sistemas.","fonetica":"los aðaptaˈðoɾes impleˈmentan la komunikaˈθjon reˈal kon sisˈtemas"},
  "hexagonal_avanzado_100": {"texto":"La arquitectura hexagonal mejora la escalabilidad.","fonetica":"la aɾki.teɾˈtuɾa exaɣoˈnal meˈxoɾa la eskalaβiliˈðað"},
  "hexagonal_avanzado_101": {"texto":"El núcleo se centra en reglas de negocio puras.","fonetica":"el ˈnukleo se ˈsentɾa en ˈreɣlas de neˈɣoθjo ˈpuɾas"},
  "hexagonal_avanzado_102": {"texto":"Los detalles externos son fácilmente reemplazables.","fonetica":"los deˈtaʝes ekstɛɾˈnos son ˈfasilmjente reemplaˈθaβles"},
  "hexagonal_avanzado_103": {"texto":"El dominio no se ve afectado por cambios tecnológicos.","fonetica":"el doˈminjo no se βe afekˈtaðo poɾ ˈkambjos teχnoˈloxikos"},
  "hexagonal_avanzado_104": {"texto":"Los puertos permiten integrar nuevas interfaces.","fonetica":"los ˈpweɾtos peɾˈmiten inteˈɣɾaɾ ˈnweβas inteɾˈfases"},
  "hexagonal_avanzado_105": {"texto":"Un adaptador puede conectarse a diferentes APIs.","fonetica":"un aðaptaˈðoɾ ˈpweðe konekˈtaɾse a ði.feˈɾentes ˈapis"},
  "hexagonal_avanzado_106": {"texto":"El núcleo se mantiene estable aunque cambie la infraestructura.","fonetica":"el ˈnukleo se manˈtjene esˈtaβle ˈaunke ˈkambje la infɾastɾukˈtuɾa"},
  "hexagonal_avanzado_107": {"texto":"Los adaptadores traducen datos del mundo exterior.","fonetica":"los aðaptaˈðoɾes tɾaˈðuθen ˈðatos del ˈmundo ekstɛɾˈjoɾ"},
  "hexagonal_avanzado_108": {"texto":"La arquitectura hexagonal fomenta el diseño limpio.","fonetica":"la aɾki.teɾˈtuɾa exaɣoˈnal foˈmenta el diˈseɲo ˈlimpio"},
  "hexagonal_avanzado_109": {"texto":"Se facilita la migración de sistemas con hexagonal.","fonetica":"se fasilita la miɣɾaˈθjon de sisˈtemas kon exaɣoˈnal"},
  "hexagonal_avanzado_110": {"texto":"El núcleo no se contamina con detalles técnicos.","fonetica":"el ˈnukleo no se kontamiˈna kon deˈtaʝes ˈtek.nikos"},
  "hexagonal_avanzado_111": {"texto":"Los puertos son interfaces estables a largo plazo.","fonetica":"los ˈpweɾtos son inteɾˈfases esˈtaβles a ˈlaɾɣo ˈplaso"},
  "hexagonal_avanzado_112": {"texto":"Los adaptadores se pueden actualizar sin riesgo.","fonetica":"los aðaptaˈðoɾes se ˈpweðen aktwaliˈθaɾ sin ˈrjesɣo"},
  "hexagonal_avanzado_113": {"texto":"La arquitectura hexagonal mejora la trazabilidad.","fonetica":"la aɾki.teɾˈtuɾa exaɣoˈnal meˈxoɾa la tɾaθaβiliˈðað"},
  "hexagonal_avanzado_114": {"texto":"Los casos de uso reflejan procesos reales del negocio.","fonetica":"los ˈkasos de ˈuso refˈlexan pɾoˈθesos reˈales del neˈɣoθjo"},
  "hexagonal_avanzado_115": {"texto":"El núcleo permanece inmutable ante cambios externos.","fonetica":"el ˈnukleo peɾmaˈnese inmuˈtaβle ˈante ˈkambjos ekstɛɾˈnos"},
  "hexagonal_avanzado_116": {"texto":"Los adaptadores permiten diferentes medios de entrada.","fonetica":"los aðaptaˈðoɾes peɾˈmiten ði.feˈɾentes ˈmeðjos de enˈtɾaða"},
  "hexagonal_avanzado_117": {"texto":"Los puertos aíslan al dominio de cambios rápidos.","fonetica":"los ˈpweɾtos aiˈslan al doˈminjo de ˈkambjos ˈrapidos"},
  "hexagonal_avanzado_118": {"texto":"El enfoque hexagonal promueve la longevidad del software.","fonetica":"el enˈfo.ke exaɣoˈnal pɾoˈmweβe la lonxeβiˈðað del ˈsof.tweɾ"},
  "hexagonal_avanzado_119": {"texto":"Se mejora la capacidad de mantenimiento del sistema.","fonetica":"se meˈxoɾa la kapaθiˈðað de mantenimiˈento del sisˈtema"},
  "hexagonal_avanzado_120": {"texto":"La arquitectura hexagonal asegura independencia del núcleo.","fonetica":"la aɾki.teɾˈtuɾa exaɣoˈnal aseˈɣuɾa indepenˈdensja del ˈnukleo"}
}
