{
  "ortogonal_intro_1": {"texto":"La arquitectura ortogonal busca reducir dependencias innecesarias.","fonetica":"la aɾki.teɾˈtuɾa oɾtoɣoˈnal ˈbuska reðuˈsiɾ de.pẽdenˈθjas inene.seˈsaɾjas"},
  "ortogonal_intro_2": {"texto":"El objetivo principal es aumentar la cohesión entre componentes.","fonetica":"el oβxeˈtiβo pɾinθiˈpal es awmenˈtaɾ la ko.eˈsjon ˈentɾe kompoˈnentes"},
  "ortogonal_intro_3": {"texto":"La ortogonalidad permite que un cambio en un módulo no afecte a otros.","fonetica":"la oɾtoɣonaliˈðað peɾˈmite ke un ˈkambjo en un ˈmoðulo no aˈfekte a ˈotɾos"},
  "ortogonal_intro_4": {"texto":"Cada componente debe tener una única responsabilidad clara.","fonetica":"ˈkaða kompoˈnente ˈdeβe teˈneɾ una ˈunika respõnsabi.liˈðað ˈklaɾa"},
  "ortogonal_intro_5": {"texto":"La separación de responsabilidades mejora el mantenimiento.","fonetica":"la sepaɾaˈθjon de respõnsabi.liˈðaðes meˈxoɾa el mantenimiˈento"},
  "ortogonal_intro_6": {"texto":"Un sistema ortogonal es más fácil de probar.","fonetica":"un sisˈtema oɾtoɣoˈnal es mas ˈfasjl de pɾoˈβaɾ"},
  "ortogonal_intro_7": {"texto":"La independencia de módulos facilita la escalabilidad.","fonetica":"la indepenˈðenθja de ˈmoðulos fasiˈlita la eskalaβiliˈðað"},
  "ortogonal_intro_8": {"texto":"La ortogonalidad evita el acoplamiento excesivo.","fonetica":"la oɾtoɣonaliˈðað eˈβita el akoˈplamjento ekseˈsiβo"},
  "ortogonal_intro_9": {"texto":"El bajo acoplamiento mejora la evolución del software.","fonetica":"el ˈbaxo akoˈplamjento meˈxoɾa la eβoluˈθjon del ˈsoftweɾ"},
  "ortogonal_intro_10": {"texto":"La cohesión alta asegura claridad en las responsabilidades.","fonetica":"la ko.eˈsjon ˈalta aseˈɣuɾa klaɾiˈðað en las respõnsabi.liˈðaðes"},
  "ortogonal_intro_11": {"texto":"Los cambios locales no deben afectar globalmente.","fonetica":"los ˈkambjos loˈkales no ˈdeβen aˈfektar ɣloˈβalmente"},
  "ortogonal_intro_12": {"texto":"La modularidad es clave para lograr ortogonalidad.","fonetica":"la moðulaɾiˈðað es ˈklaβe paɾa loˈɣɾaɾ oɾtoɣonaliˈðað"},
  "ortogonal_intro_13": {"texto":"La ortogonalidad se logra con interfaces bien definidas.","fonetica":"la oɾtoɣonaliˈðað se ˈloɣɾa kon inteɾˈfases ˈbjen defiˈniðas"},
  "ortogonal_intro_14": {"texto":"Los contratos claros entre módulos son esenciales.","fonetica":"los kontɾaˈtos ˈklaɾos ˈentɾe ˈmoðulos son esenˈθjales"},
  "ortogonal_intro_15": {"texto":"Un sistema ortogonal minimiza el riesgo de errores.","fonetica":"un sisˈtema oɾtoɣoˈnal miniˈmisa el ˈrjesɣo de eˈrores"},
  "ortogonal_intro_16": {"texto":"La ortogonalidad favorece la reutilización de código.","fonetica":"la oɾtoɣonaliˈðað faβoˈɾeθe la reuti.liθaˈθjon de ˈkoðiɣo"},
  "ortogonal_intro_17": {"texto":"La simplicidad es consecuencia de un diseño ortogonal.","fonetica":"la simpliθiˈðað es konseˈkwenθja de un diˈseɲo oɾtoɣoˈnal"},
  "ortogonal_intro_18": {"texto":"Cada módulo ortogonal debe ser entendible por sí mismo.","fonetica":"ˈkaða ˈmoðulo oɾtoɣoˈnal ˈdeβe seɾ entenˈdiðle poɾ si ˈmismo"},
  "ortogonal_intro_19": {"texto":"Un cambio en la base de datos no debe afectar la lógica de negocio.","fonetica":"un ˈkambjo en la ˈβase de ˈðatos no ˈdeβe aˈfektar la ˈloxika de neˈɣoθjo"},
  "ortogonal_intro_20": {"texto":"La ortogonalidad mejora la capacidad de mantenimiento.","fonetica":"la oɾtoɣonaliˈðað meˈxoɾa la kapaθiˈðað de mantenimiˈento"},
  "ortogonal_intro_21": {"texto":"El diseño ortogonal promueve la calidad del software.","fonetica":"el diˈseɲo oɾtoɣoˈnal pɾoˈmweβe la kaliˈðað del ˈsoftweɾ"},
  "ortogonal_intro_22": {"texto":"Los sistemas ortogonales son más fáciles de escalar.","fonetica":"los sisˈtemas oɾtoɣoˈnales son mas ˈfasjles de eskaˈlaɾ"},
  "ortogonal_intro_23": {"texto":"La ortogonalidad implica responsabilidad única y clara.","fonetica":"la oɾtoɣonaliˈðað imˈplika respõnsabi.liˈðað ˈunika i ˈklaɾa"},
  "ortogonal_intro_24": {"texto":"El acoplamiento débil mejora la flexibilidad del sistema.","fonetica":"el akoˈplamjento ˈðeβil meˈxoɾa la fleksibi.liˈðað del sisˈtema"},
  "ortogonal_intro_25": {"texto":"Los cambios en la interfaz no deben propagarse a todo el sistema.","fonetica":"los ˈkambjos en la inteɾˈfase no ˈdeβen pɾopaˈɣaɾse a ˈtoðo el sisˈtema"},
  "ortogonal_intro_26": {"texto":"La ortogonalidad asegura independencia de frameworks.","fonetica":"la oɾtoɣonaliˈðað aseˈɣuɾa indepenˈðenθja de ˈfɾeimwoɾks"},
  "ortogonal_intro_27": {"texto":"Un diseño ortogonal es más resistente a cambios tecnológicos.","fonetica":"un diˈseɲo oɾtoɣoˈnal es mas resisˈtjente a ˈkambjos teknoˈloxikos"},
  "ortogonal_intro_28": {"texto":"La ortogonalidad simplifica la integración de nuevos módulos.","fonetica":"la oɾtoɣonaliˈðað simpliˈfika la inteɣɾaˈθjon de ˈnweβos ˈmoðulos"},
  "ortogonal_intro_29": {"texto":"Los sistemas ortogonales reducen el costo de mantenimiento.","fonetica":"los sisˈtemas oɾtoɣoˈnales reˈðuθen el ˈkosto de mantenimiˈento"},
  "ortogonal_intro_30": {"texto":"La ortogonalidad es un principio clave de buena arquitectura.","fonetica":"la oɾtoɣonaliˈðað es un pɾinˈθipjo ˈklaβe de ˈbwena aɾki.teɾˈtuɾa"}
,
  "ortogonal_mid_31": {"texto":"La ortogonalidad ayuda a reducir la complejidad accidental.","fonetica":"la oɾtoɣonaliˈðað aˈʝuða a reðuˈsiɾ la kom.pleksiˈðað akθidenˈtal"},
  "ortogonal_mid_32": {"texto":"Los componentes ortogonales son fáciles de reemplazar.","fonetica":"los kompoˈnentes oɾtoɣoˈnales son ˈfasjles de reemplaˈsaɾ"},
  "ortogonal_mid_33": {"texto":"La independencia de capas asegura claridad arquitectónica.","fonetica":"la indepenˈðenθja de ˈkapas aseˈɣuɾa klaɾiˈðað aɾkitektóniˈka"},
  "ortogonal_mid_34": {"texto":"Cada capa debe conocer solo lo necesario.","fonetica":"ˈkaða ˈkapa ˈdeβe ko.noˈθeɾ ˈsolo lo neθesaˈɾjo"},
  "ortogonal_mid_35": {"texto":"La ortogonalidad favorece pruebas unitarias efectivas.","fonetica":"la oɾtoɣonaliˈðað faβoˈɾeθe ˈpɾweβas unitaˈɾjas efekˈtiβas"},
  "ortogonal_mid_36": {"texto":"Un diseño ortogonal facilita la automatización de pruebas.","fonetica":"un diˈseɲo oɾtoɣoˈnal fasiˈlita la awtomatiθaˈθjon de ˈpɾweβas"},
  "ortogonal_mid_37": {"texto":"Los errores se aíslan mejor en sistemas ortogonales.","fonetica":"los eˈrores se aiˈslan meˈxoɾ en sisˈtemas oɾtoɣoˈnales"},
  "ortogonal_mid_38": {"texto":"La ortogonalidad facilita el trabajo en equipos grandes.","fonetica":"la oɾtoɣonaliˈðað fasiˈlita el tɾaˈβaxo en ekiˈpos ˈɣrandes"},
  "ortogonal_mid_39": {"texto":"Cada equipo puede trabajar en un módulo sin interferir.","fonetica":"ˈkaða ekiˈpo ˈpweðe tɾabaˈxaɾ en un ˈmoðulo sin inteɾfeˈɾiɾ"},
  "ortogonal_mid_40": {"texto":"La ortogonalidad aumenta la mantenibilidad del software.","fonetica":"la oɾtoɣonaliˈðað awˈmenta la mantenibiliˈðað del ˈsoftweɾ"},
  "ortogonal_mid_41": {"texto":"El bajo acoplamiento simplifica la depuración.","fonetica":"el ˈbaxo akoˈplamjento simpliˈfika la depuɾaˈθjon"},
  "ortogonal_mid_42": {"texto":"Los módulos ortogonales pueden evolucionar de forma independiente.","fonetica":"los ˈmoðulos oɾtoɣoˈnales ˈpweðen eβoluˈθjoɾ de ˈfoɾma indepenˈðjente"},
  "ortogonal_mid_43": {"texto":"La ortogonalidad promueve el diseño limpio.","fonetica":"la oɾtoɣonaliˈðað pɾoˈmweβe el diˈseɲo ˈlimpio"},
  "ortogonal_mid_44": {"texto":"El diseño limpio se apoya en principios ortogonales.","fonetica":"el diˈseɲo ˈlimpio se aˈpoʝa en pɾinˈθipjos oɾtoɣoˈnales"},
  "ortogonal_mid_45": {"texto":"La ortogonalidad es base para arquitecturas escalables.","fonetica":"la oɾtoɣonaliˈðað es ˈβase ˈpaɾa aɾkitektuɾas eskaˈlaβles"},
  "ortogonal_mid_46": {"texto":"Las interfaces claras fortalecen la ortogonalidad.","fonetica":"las inteɾˈfases ˈklaɾas foɾtaˈleθen la oɾtoɣonaliˈðað"},
  "ortogonal_mid_47": {"texto":"Los sistemas ortogonales tienen menos efectos colaterales.","fonetica":"los sisˈtemas oɾtoɣoˈnales ˈtjenen ˈmenos eˈfektos kolateˈɾales"},
  "ortogonal_mid_48": {"texto":"La ortogonalidad ayuda a gestionar la complejidad.","fonetica":"la oɾtoɣonaliˈðað aˈʝuða a xestionaɾ la kompleksiˈðað"},
  "ortogonal_mid_49": {"texto":"La modularidad y ortogonalidad se complementan.","fonetica":"la moðulaɾiˈðað i oɾtoɣonaliˈðað se kompleˈmentan"},
  "ortogonal_mid_50": {"texto":"Un módulo ortogonal es independiente de los demás.","fonetica":"un ˈmoðulo oɾtoɣoˈnal es indepenˈðjente de los deˈmas"},
  "ortogonal_mid_51": {"texto":"Los cambios se limitan al área afectada.","fonetica":"los ˈkambjos se liˈmitan al ˈaɾea afekˈtaða"},
  "ortogonal_mid_52": {"texto":"La ortogonalidad facilita la documentación del sistema.","fonetica":"la oɾtoɣonaliˈðað fasiˈlita la dokumen̪taˈθjon del sisˈtema"},
  "ortogonal_mid_53": {"texto":"Los diagramas se entienden mejor en sistemas ortogonales.","fonetica":"los djaˈɣɾamas se enˈtjenden meˈxoɾ en sisˈtemas oɾtoɣoˈnales"},
  "ortogonal_mid_54": {"texto":"La ortogonalidad apoya la arquitectura orientada a servicios.","fonetica":"la oɾtoɣonaliˈðað aˈpoʝa la aɾkitektuˈɾa oɾjenˈtada a seɾˈβiθjos"},
  "ortogonal_mid_55": {"texto":"Los microservicios deben mantener ortogonalidad entre sí.","fonetica":"los mikroseɾˈβisjos ˈdeβen mantenˈeɾ oɾtoɣonaliˈðað ˈentɾe si"},
  "ortogonal_mid_56": {"texto":"La ortogonalidad es esencial en arquitecturas distribuidas.","fonetica":"la oɾtoɣonaliˈðað es esenˈθjal en aɾkitektuɾas distɾiˈβwiðas"},
  "ortogonal_mid_57": {"texto":"Los sistemas distribuidos necesitan bajo acoplamiento.","fonetica":"los sisˈtemas distɾiˈβwiðos neθesiˈtan ˈbaxo akoˈplamjento"},
  "ortogonal_mid_58": {"texto":"La ortogonalidad asegura autonomía de los servicios.","fonetica":"la oɾtoɣonaliˈðað aseˈɣuɾa awtonoˈmi.a de los seɾˈβiθjos"},
  "ortogonal_mid_59": {"texto":"Un servicio ortogonal puede evolucionar sin afectar al resto.","fonetica":"un seɾˈβiθjo oɾtoɣoˈnal ˈpweðe eβoluˈθjoɾ sin afekˈtaɾ al ˈresto"},
  "ortogonal_mid_60": {"texto":"La ortogonalidad contribuye a la resiliencia del sistema.","fonetica":"la oɾtoɣonaliˈðað kontɾiˈβwe a la resiliˈenθja del sisˈtema"}
,
  "ortogonal_adv_61": {"texto":"La ortogonalidad mejora la trazabilidad del software.","fonetica":"la oɾtoɣonaliˈðað meˈxoɾa la tɾaθaβiliˈðað del ˈsoftweɾ"},
  "ortogonal_adv_62": {"texto":"Cada cambio tiene un impacto predecible en un sistema ortogonal.","fonetica":"ˈkaða ˈkambjo ˈtjene un imˈpakto pɾeðeˈθiβle en un sisˈtema oɾtoɣoˈnal"},
  "ortogonal_adv_63": {"texto":"La ortogonalidad ayuda a reducir la deuda técnica.","fonetica":"la oɾtoɣonaliˈðað aˈʝuða a reðuˈsiɾ la ˈðewða ˈtekniˌka"},
  "ortogonal_adv_64": {"texto":"Los sistemas ortogonales permiten ciclos de entrega más cortos.","fonetica":"los sisˈtemas oɾtoɣoˈnales peɾˈmiten ˈθiklos de enˈtɾeɣa mas ˈkoɾtos"},
  "ortogonal_adv_65": {"texto":"La ortogonalidad incrementa la velocidad de desarrollo.","fonetica":"la oɾtoɣonaliˈðað inkɾeˈmenta la βelosiˈðað de deβeloˈpo"},
  "ortogonal_adv_66": {"texto":"Los módulos ortogonales son más fáciles de reemplazar por nuevas versiones.","fonetica":"los ˈmoðulos oɾtoɣoˈnales son mas ˈfasjles de reemplaˈθaɾ poɾ ˈnweβas βeɾˈθjones"},
  "ortogonal_adv_67": {"texto":"La ortogonalidad facilita la adopción de nuevas tecnologías.","fonetica":"la oɾtoɣonaliˈðað fasiˈlita la aðopˈθjon de ˈnweβas teknoˈloxias"},
  "ortogonal_adv_68": {"texto":"Un diseño ortogonal se adapta mejor al cambio.","fonetica":"un diˈseɲo oɾtoɣoˈnal se aˈðapta meˈxoɾ al ˈkambjo"},
  "ortogonal_adv_69": {"texto":"La ortogonalidad refuerza la arquitectura hexagonal.","fonetica":"la oɾtoɣonaliˈðað reˈfweɾθa la aɾkitektuˈɾa exaɣoˈnal"},
  "ortogonal_adv_70": {"texto":"La arquitectura hexagonal se beneficia de la ortogonalidad de puertos y adaptadores.","fonetica":"la aɾkitektuˈɾa exaɣoˈnal se βenefiˈθja de la oɾtoɣonaliˈðað de ˈpweɾtos i aˌðaptadoɾes"},
  "ortogonal_adv_71": {"texto":"Los patrones ortogonales ayudan a mantener consistencia en el sistema.","fonetica":"los paˈtoɾnes oɾtoɣoˈnales aˈʝuðan a mantenˈeɾ konsisˈtensja en el sisˈtema"},
  "ortogonal_adv_72": {"texto":"La ortogonalidad mejora la calidad interna del software.","fonetica":"la oɾtoɣonaliˈðað meˈxoɾa la kaliˈðað inˈteɾna del ˈsoftweɾ"},
  "ortogonal_adv_73": {"texto":"La calidad externa también se beneficia de la ortogonalidad.","fonetica":"la kaliˈðað eksˈteɾna tamˈbjen se βenefiˈθja de la oɾtoɣonaliˈðað"},
  "ortogonal_adv_74": {"texto":"Los clientes reciben software más estable gracias a la ortogonalidad.","fonetica":"los kljenˈtes reˈθiben ˈsoftweɾ mas esˈtaβle ˈɣɾasjas a la oɾtoɣonaliˈðað"},
  "ortogonal_adv_75": {"texto":"La ortogonalidad apoya el principio de inversión de dependencias.","fonetica":"la oɾtoɣonaliˈðað aˈpoʝa el pɾinˈθipjo de inβeɾˈsjon de depenˈðensjas"},
  "ortogonal_adv_76": {"texto":"El principio de inversión de dependencias favorece la ortogonalidad.","fonetica":"el pɾinˈθipjo de inβeɾˈsjon de depenˈðensjas faβoˈɾeθe la oɾtoɣonaliˈðað"},
  "ortogonal_adv_77": {"texto":"La ortogonalidad se alinea con la filosofía de Clean Architecture.","fonetica":"la oɾtoɣonaliˈðað se aliˈnea kon la filoˈsofja de ˈklin aɾkitektuɾa"},
  "ortogonal_adv_78": {"texto":"Clean Architecture busca independencia y ortogonalidad entre capas.","fonetica":"ˈklin aɾkitektuɾa ˈbuska indepenˈðenθja i oɾtoɣonaliˈðað ˈentɾe ˈkapas"},
  "ortogonal_adv_79": {"texto":"La ortogonalidad reduce el impacto de fallos locales.","fonetica":"la oɾtoɣonaliˈðað reˈðuθe el imˈpakto de ˈfaʝos loˈkales"},
  "ortogonal_adv_80": {"texto":"Los fallos se aíslan mejor en sistemas ortogonales.","fonetica":"los ˈfaʝos se aiˈslan meˈxoɾ en sisˈtemas oɾtoɣoˈnales"},
  "ortogonal_adv_81": {"texto":"La ortogonalidad incrementa la seguridad del software.","fonetica":"la oɾtoɣonaliˈðað inkɾeˈmenta la seɣuɾiˈðað del ˈsoftweɾ"},
  "ortogonal_adv_82": {"texto":"La seguridad mejora porque se reducen efectos colaterales.","fonetica":"la seɣuɾiˈðað meˈxoɾa poɾˈke se reˈðuθen eˈfektos kolateˈɾales"},
  "ortogonal_adv_83": {"texto":"Los sistemas ortogonales son más robustos frente a cambios.","fonetica":"los sisˈtemas oɾtoɣoˈnales son mas roˈβustos ˈfɾente a ˈkambjos"},
  "ortogonal_adv_84": {"texto":"La ortogonalidad facilita la migración entre plataformas.","fonetica":"la oɾtoɣonaliˈðað fasiˈlita la miɣɾaˈθjon ˈentɾe plataˈfoɾmas"},
  "ortogonal_adv_85": {"texto":"Los proyectos ortogonales tienen menor costo a largo plazo.","fonetica":"los pɾoˈʝektos oɾtoɣoˈnales ˈtjenen meˈnoɾ ˈkosto a ˈlaɾɣo ˈplaso"},
  "ortogonal_adv_86": {"texto":"La ortogonalidad disminuye la complejidad cognitiva.","fonetica":"la oɾtoɣonaliˈðað ðisˈminuje la kompleksiˈðað koɣniˈtiβa"},
  "ortogonal_adv_87": {"texto":"Los desarrolladores entienden mejor sistemas ortogonales.","fonetica":"los desaˈroʝadoɾes enˈtjenden meˈxoɾ sisˈtemas oɾtoɣoˈnales"},
  "ortogonal_adv_88": {"texto":"La ortogonalidad permite la evolución continua del software.","fonetica":"la oɾtoɣonaliˈðað peɾˈmite la eβoluˈθjon konˈtinwa del ˈsoftweɾ"},
  "ortogonal_adv_89": {"texto":"Un sistema ortogonal es más resiliente a cambios de negocio.","fonetica":"un sisˈtema oɾtoɣoˈnal es mas resiliˈente a ˈkambjos de neˈɣoθjo"},
  "ortogonal_adv_90": {"texto":"La ortogonalidad asegura compatibilidad hacia el futuro.","fonetica":"la oɾtoɣonaliˈðað aseˈɣuɾa kompa.tiβiliˈðað ˈasja el fuˈtuɾo"}
,
"independencia_tecnologica_91": {"texto":"La arquitectura ortogonal fomenta la independencia tecnológica.","fonetica":"la aɾki.teɾˈtuɾa oɾtoˈɣonal foˈmenta la indepenˈdenθja teknoˈloxika"},
"dominio_datos_92": {"texto":"Los modelos de dominio y datos se mantienen separados.","fonetica":"los moˈðelos de doˈminjo i ˈðatos se manˈtjenen sepaˈɾaðos"},
"infraestructura_flexible_93": {"texto":"Una infraestructura flexible apoya la ortogonalidad.","fonetica":"ˈuna infɾaestɾukˈtuɾa fleksiˈβle aˈpoʝa la oɾtoɣonaliˈðað"},
"claridad_responsabilidad_94": {"texto":"Cada módulo tiene claridad en su responsabilidad.","fonetica":"ˈkaða ˈmoðulo ˈtjene klaɾiˈðað en su respõnsabiliˈðað"},
"puntos_extension_95": {"texto":"La ortogonalidad define puntos de extensión claros.","fonetica":"la oɾtoɣonaliˈðað deˈfine ˈpuntos de ekstenˈsjon ˈklaɾos"},
"capacidad_pruebas_96": {"texto":"Los sistemas ortogonales facilitan la capacidad de pruebas.","fonetica":"los sisˈtemas oɾtoɣoˈnales fasilitan la kapaθiˈðað de ˈpɾweβas"},
"adaptabilidad_negocio_97": {"texto":"La adaptabilidad al negocio es mayor con ortogonalidad.","fonetica":"la aðaptaβiliˈðað al neˈɣoθjo es maˈʝoɾ kon oɾtoɣonaliˈðað"},
"estructura_simple_98": {"texto":"Los diseños ortogonales se basan en estructuras simples.","fonetica":"los diˈseɲos oɾtoɣoˈnales se ˈβasan en estɾuktuˈɾas ˈsimples"},
"desacople_servicios_99": {"texto":"El desacople entre servicios impulsa la escalabilidad.","fonetica":"el desaˈkople ˈentɾe seɾˈβisjos imˈpulsa la eskalaβiliˈðað"},
"principio_evolucion_100": {"texto":"La ortogonalidad es un principio clave para la evolución.","fonetica":"la oɾtoɣonaliˈðað es um pɾinˈθipjo ˈklaβe paɾa la eβoluˈθjon"},
"division_clara_101": {"texto":"La división clara de capas asegura modularidad.","fonetica":"la diβiˈsjon ˈklaɾa de ˈkapas aseˈɣuɾa moðulaɾiˈðað"},
"interfaces_firmes_102": {"texto":"Las interfaces firmes garantizan compatibilidad.","fonetica":"las inteɾˈfases ˈfiɾmes gaɾanˈtisan kompatibiliˈðað"},
"colaboracion_mantenibilidad_103": {"texto":"Ortogonalidad mejora la colaboración y mantenibilidad.","fonetica":"oɾtoɣonaliˈðað meˈxoɾa la kolaβoɾaˈθjon i mantenibiliˈðað"},
"resiliencia_errores_104": {"texto":"Los sistemas ortogonales son más resilientes a errores.","fonetica":"los sisˈtemas oɾtoɣoˈnales son mas resiljenˈtes a eˈrores"},
"flexibilidad_componentes_105": {"texto":"Los componentes ortogonales son más flexibles.","fonetica":"los kompoˈnentes oɾtoɣoˈnales son mas fleksiˈβles"},
"alineacion_estrategia_106": {"texto":"La ortogonalidad permite alinear arquitectura con estrategia.","fonetica":"la oɾtoɣonaliˈðað peɾˈmite alinjeˈɾ aɾkiteɾˈtuɾa kon estɾaˈtexja"},
"transparencia_arquitectura_107": {"texto":"La transparencia arquitectónica es un beneficio de la ortogonalidad.","fonetica":"la tɾanspaˈɾenθja aɾkitektóniˈka es um βenefiˈθjo de la oɾtoɣonaliˈðað"},
"independencia_plataformas_108": {"texto":"Los sistemas ortogonales permiten independencia de plataformas.","fonetica":"los sisˈtemas oɾtoɣoˈnales peɾˈmiten indepenˈdenθja de plataˈfoɾmas"},
"coherencia_diseno_109": {"texto":"La coherencia de diseño se fortalece con ortogonalidad.","fonetica":"la koeˈɾenθja de diˈseɲo se foɾtaleˈse kon oɾtoɣonaliˈðað"},
"prevencion_dependencias_110": {"texto":"La ortogonalidad previene dependencias innecesarias.","fonetica":"la oɾtoɣonaliˈðað pɾeˈβjene depenˈðensjas ineneˈθesaɾjas"},
"claridad_mensajes_111": {"texto":"Los mensajes entre módulos deben ser claros y ortogonales.","fonetica":"los menˈsaxes ˈentɾe ˈmoðulos ˈdeβen seɾ ˈklaɾos i oɾtoɣoˈnales"},
"autonomia_equipos_112": {"texto":"La ortogonalidad fomenta la autonomía de los equipos.","fonetica":"la oɾtoɣonaliˈðað foˈmenta la autoˈnomja de los ekiˈpos"},
"gobernanza_arquitectura_113": {"texto":"Una buena gobernanza arquitectónica se basa en ortogonalidad.","fonetica":"ˈuna ˈbwena goβeɾˈnanθa aɾkitektóniˈka se ˈβasa en oɾtoɣonaliˈðað"},
"desarrollo_iterativo_114": {"texto":"La ortogonalidad facilita el desarrollo iterativo.","fonetica":"la oɾtoɣonaliˈðað fasilita el desaˈroʝo iteɾaˈtiβo"},
"separacion_intereses_115": {"texto":"La separación de intereses es clave en sistemas ortogonales.","fonetica":"la sepaɾaˈθjon de inteˈɾeses es ˈklaβe en sisˈtemas oɾtoɣoˈnales"},
"vision_largo_plazo_116": {"texto":"Los diseños ortogonales favorecen la visión a largo plazo.","fonetica":"los diˈseɲos oɾtoɣoˈnales faβoˈɾeθen la βiˈsjon a ˈlaɾɣo ˈplaθo"},
"infraestructura_reutilizable_117": {"texto":"La ortogonalidad permite infraestructura reutilizable.","fonetica":"la oɾtoɣonaliˈðað peɾˈmite infɾaestɾuktuˈɾa reutiˈliðaβle"},
"disciplina_disenadores_118": {"texto":"Los diseñadores deben aplicar disciplina ortogonal.","fonetica":"los diˈseɲadoɾes ˈdeβen apliˈkaɾ disiˈplina oɾtoɣoˈnal"}
}