{
    "inicio_1": {"texto":"Es war einmal ein kleines Mädchen, das hieß Rotkäppchen.","fonetica":"ɛs vaːɐ̯ ʔaɪ̯nmaːl ʔaɪ̯n ˈklaɪ̯nəs ˈmɛːtçən das hiːs ˈʁoːtkɛpçən"},
    "inicio_2": {"texto":"Es lebte in einem kleinen Dorf, das von Wald umgeben war.","fonetica":"ɛs ˈleːptə ʔɪn ˈʔaɪ̯nəm ˈklaɪ̯nən dɔʁf das fɔn valt ʔʊmɡəˈɡeːbn̩ vaːɐ̯"},
    "inicio_3": {"texto":"Alle mochten es wegen seiner Güte und Fröhlichkeit.","fonetica":"ˈalə ˈmɔxtn̩ ɛs ˈveːɡn̩ ˈzaɪ̯nɐ ˈɡyːtə ʔʊnt ˈfʁøːlɪçkaɪ̯t"},
    "inicio_4": {"texto":"Eines Tages bat ihre Mutter es um einen wichtigen Gefallen.","fonetica":"ˈaɪ̯nəs ˈtaːɡəs baːt ˈʔiːʁə ˈmʊtɐ ɛs ʔʊm ˈʔaɪ̯nən ˈvɪçtɪɡən ɡəˈfalən"},
    "inicio_5": {"texto":"Es sollte einen Korb mit Essen zu seiner Großmutter bringen.","fonetica":"ɛs ˈzɔltə ˈʔaɪ̯nən kɔʁp mɪt ˈʔɛsn̩ tsuː ˈzaɪ̯nɐ ˈɡʁoːsmʊtɐ ˈbʁɪŋən"},
    "inicio_6": {"texto":"Die Großmutter war krank und benötigte Pflege.","fonetica":"diː ˈɡʁoːsmʊtɐ vaːɐ̯ kʁaŋk ʔʊnt bəˈnøːtɪçtə ˈp͡fleːɡə"},
    "inicio_7": {"texto":"Die Mutter warnte das Mädchen, nicht vom Weg abzuweichen.","fonetica":"diː ˈmʊtɐ ˈvaʁntə das ˈmɛːtçən nɪçt fɔm veːk ˈʔaptsuˌvaɪ̯çn̩"},
    "inicio_8": {"texto":"Sie sagte ihr auch, mit keinem Fremden zu sprechen.","fonetica":"ziː ˈzaːɡə ʔiːɐ̯ ʔaʊx mɪt ˈkaɪ̯nəm ˈfʁɛmdn̩ tsuː ˈʃpʁɛçn̩"},
    "inicio_9": {"texto":"Rotkäppchen versprach, den Anweisungen der Mutter zu folgen.","fonetica":"ˈʁoːtkɛpçən fɛɐ̯ˈʃpʁaːx deːn ˈʔanvaɪ̯zʊŋən deːɐ̯ ˈmʊtɐ tsuː ˈfɔlɡn̩"},
    "inicio_10": {"texto":"Es nahm den Korb und begann seinen Weg durch den Wald.","fonetica":"ɛs naːm deːn kɔʁp ʔʊnt bəˈɡan ˈzaɪ̯nən veːk dʊʁç deːn valt"},
    "camino_11": {"texto":"Die Sonne schien und die Vögel sangen zwischen den Bäumen.","fonetica":"diː ˈzɔnə ʃiːn ʔʊnt diː ˈføːɡl̩ ˈzaŋən ˈtsvɪʃn̩ deːn ˈbɔɪ̯mən"},
    "camino_12": {"texto":"Das Mädchen blieb stehen, um einige rote Blumen zu bewundern.","fonetica":"das ˈmɛːtçən bliːp ˈʃteːən ʔʊm ˈʔaɪ̯nɪɡə ˈʁoːtə ˈbluːmən tsuː bəˈvʊndɐn"},
    "camino_13": {"texto":"Es erinnerte sich an die Worte der Mutter und ging weiter.","fonetica":"ɛs ʔɛɐ̯ˈʔɪnɐtə zɪç ʔan diː ˈvɔʁtə deːɐ̯ ˈmʊtɐ ʔʊnt ɡɪŋ ˈvaɪ̯tɐ"},
    "camino_14": {"texto":"Plötzlich hörte es ein Rascheln hinter den Büschen.","fonetica":"ˈplœtslɪç ˈhøːɐ̯tə ɛs ʔaɪ̯n ˈʁaʃl̩n ˈhɪntɐ deːn ˈbʏʃn̩"},
    "camino_15": {"texto":"Ein riesiger Wolf erschien mitten auf dem Pfad.","fonetica":"ʔaɪ̯n ˈʁiːzɪɡɐ vɔlf ʔɛɐ̯ˈʃiːn ˈmɪtn̩ ʔaʊf deːm p͡faːt"},
    "dialogo_16": {"texto":"Der Wolf begrüßte sie mit einem listigen Lächeln.","fonetica":"deːɐ̯ vɔlf bəˈɡʁyːstə ziː mɪt ˈʔaɪ̯nəm ˈlɪstɪɡən ˈlɛçl̩n"},
    "dialogo_17": {"texto":"Guten Tag, Kleine, wohin gehst du? fragte er.","fonetica":"ˈɡuːtn̩ taːk ˈklaɪ̯nə voˈhɪn ɡeːst duː ˈfʁaːktə ʔeːɐ̯"},
    "dialogo_18": {"texto":"Ich gehe zu meiner Großmutter, die jenseits des Waldes wohnt, antwortete sie.","fonetica":"ʔɪç ˈɡeːə tsuː ˈmaɪ̯nɐ ˈɡʁoːsmʊtɐ diː ˈjɛnzaɪ̯ts dɛs ˈvaldəs voːnt ʔantˈvɔʁtətə ziː"},
    "dialogo_19": {"texto":"Der Wolf heuchelte Interesse und lächelte noch breiter.","fonetica":"deːɐ̯ vɔlf ˈhɔɪ̯çəltə ʔɪntəˈʁɛsə ʔʊnt ˈlɛçəltə nɔx ˈbʁaɪ̯tɐ"},
    "dialogo_20": {"texto":"Er schlug vor, ein paar Blumen für die Großmutter zu pflücken.","fonetica":"ʔeːɐ̯ ʃluːk foːɐ̯ ʔaɪ̯n paːɐ̯ ˈbluːmən fyːɐ̯ diː ˈɡʁoːsmʊtɐ tsuː ˈp͡flʏkŋ̩"},
    "dialogo_21": {"texto":"Rotkäppchen nahm die Idee an, ohne etwas zu ahnen.","fonetica":"ˈʁoːtkɛpçən naːm diː ʔiˈdeː ʔan ˈoːnə ˈʔɛtvas tsuː ˈʔaːnən"},
    "dialogo_22": {"texto":"Es bückte sich, um die schönsten Blumen zu pflücken.","fonetica":"ɛs ˈbʏktə zɪç ʔʊm diː ˈʃøːnstən ˈbluːmən tsuː ˈp͡flʏkŋ̩"},
    "dialogo_23": {"texto":"Währenddessen schmiedete der Wolf einen schnellen Plan.","fonetica":"ˈvɛːʁəntdɛsən ˈʃmiːdətə deːɐ̯ vɔlf ˈʔaɪ̯nən ˈʃnɛlən plaːn"},
    "dialogo_24": {"texto":"Er lief einen Abkürzung, um eher am Haus der Großmutter anzukommen.","fonetica":"ʔeːɐ̯ liːf ˈʔaɪ̯nən ˈʔapkʏʁtsʊŋ ʔʊm ˈʔeːɐ̯ ʔam haʊs deːɐ̯ ˈɡʁoːsmʊtɐ ˈʔankɔmən"},
    "dialogo_25": {"texto":"Er klopfte leise an die Tür.","fonetica":"ʔeːɐ̯ ˈklɔp͡ftə ˈlaɪ̯zə ʔan diː tyːɐ̯"},
    "dialogo_26": {"texto":"Die Großmutter fragte, wer da sei.","fonetica":"diː ˈɡʁoːsmʊtɐ ˈfʁaːktə veːɐ̯ daː zaɪ̯"},
    "dialogo_27": {"texto":"Der Wolf ahmte die Stimme von Rotkäppchen nach.","fonetica":"deːɐ̯ vɔlf ˈʔaːmtə diː ˈʃtɪmə fɔn ˈʁoːtkɛpçən naːx"},
    "dialogo_28": {"texto":"Ich bin's, Großmütterchen, sagte er mit sanfter Stimme.","fonetica":"ʔɪç bɪns ˈɡʁoːsmʏtɐçən ˈzaːɡtə ʔeːɐ̯ mɪt ˈzanftɐ ˈʃtɪmə"},
    "dialogo_29": {"texto":"Die Großmutter bat ihn hereinzukommen.","fonetica":"diː ˈɡʁoːsmʊtɐ baːt ʔiːn hɛˈʁaɪ̯ntsuˌkɔmən"},
    "dialogo_30": {"texto":"Der Wolf trat ein und schloss die Tür mit einem Satz.","fonetica":"deːɐ̯ vɔlf tʁaːt ʔaɪ̯n ʔʊnt ʃloːs diː tyːɐ̯ mɪt ˈʔaɪ̯nəm zat͡s"},
    "engaño_31": {"texto":"Er stürzte sich auf die Großmutter und sperrte sie in den Schrank.","fonetica":"ʔeːɐ̯ ˈʃtʏʁt͡stə zɪç ʔaʊf diː ˈɡʁoːsmʊtɐ ʔʊnt ˈʃpɛʁtə ziː ʔɪn deːn ʃʁaŋk"},
    "engaño_32": {"texto":"Dann setzte er ihre Haube und ihre Brille auf.","fonetica":"dan ˈzɛt͡stə ʔeːɐ̯ ˈʔiːʁə ˈhaʊbə ʔʊnt ˈʔiːʁə ˈbʁɪlə ʔaʊf"},
    "engaño_33": {"texto":"Er legte sich ins Bett, um auf Rotkäppchen zu warten.","fonetica":"ʔeːɐ̯ ˈleːktə zɪç ʔɪns bɛt ʔʊm ʔaʊf ˈʁoːtkɛpçən tsuː ˈvaʁtn̩"},
    "camino_34": {"texto":"Inzwischen pflückte Rotkäppchen weiter Blumen.","fonetica":"ˈʔɪntsvɪʃən ˈp͡flʏktə ˈʁoːtkɛpçən ˈvaɪ̯tɐ ˈbluːmən"},
    "camino_35": {"texto":"Es erinnerte sich wieder an die Warnung der Mutter.","fonetica":"ɛs ʔɛɐ̯ˈʔɪnɐtə zɪç ˈviːdɐ ʔan diː ˈvaʁnʊŋ deːɐ̯ ˈmʊtɐ"},
    "camino_36": {"texto":"Es bemerkte, dass es schon spät war.","fonetica":"ɛs bəˈmɛʁktə das ɛs ʃoːn ʃpɛːt vaːɐ̯"},
    "camino_37": {"texto":"Es beschleunigte seine Schritte zum Haus der Großmutter.","fonetica":"ɛs bəˈʃlɔɪ̯nɪçtə ˈzaɪ̯nə ˈʃpʁɪtə tsuːm haʊs deːɐ̯ ˈɡʁoːsmʊtɐ"},
    "encuentro_38": {"texto":"Beim Ankommen bemerkte es die angelehnte Tür.","fonetica":"baɪ̯m ˈʔankɔmən bəˈmɛʁktə ɛs diː ˈʔanɡəleːntə tyːɐ̯"},
    "encuentro_39": {"texto":"Das Haus war still und ein wenig dunkel.","fonetica":"das haʊs vaːɐ̯ ʃtɪl ʔʊnt ʔaɪ̯n ˈlaɪ̯nɪç ˈdʊŋkl̩"},
    "encuentro_40": {"texto":"Rotkäppchen trat vorsichtig ein.","fonetica":"ˈʁoːtkɛpçən tʁaːt ˈfoːɐ̯zɪçtɪç ʔaɪ̯n"},
    "dialogo_41": {"texto":"Es näherte sich neugierig dem Bett der Großmutter.","fonetica":"ɛs ˈnɛːɐ̯tə zɪç ˈnɔɪ̯ɡiːʁɪç deːm bɛt deːɐ̯ ˈɡʁoːsmʊtɐ"},
    "dialogo_42": {"texto":"Es sah die Großmutter bis zum Kopf zugedeckt.","fonetica":"ɛs zaː diː ˈɡʁoːsmʊtɐ bɪs tsuːm kɔp͡f ˈtsuːɡədɛkt"},
    "dialogo_43": {"texto":"Großmütterchen, was hast du für große Augen, sagte Rotkäppchen.","fonetica":"ˈɡʁoːsmʏtɐçən vas hast duː fyːɐ̯ ˈɡʁoːsə ˈʔaʊɡən ˈzaːɡtə ˈʁoːtkɛpçən"},
    "dialogo_44": {"texto":"Damit ich dich besser sehen kann, antwortete der verkleidete Wolf.","fonetica":"daˈmɪt ʔɪç dɪç ˈbɛsɐ ˈzeːən kan ˈʔantvɔʁtətə deːɐ̯ fɛɐ̯ˈklaɪ̯dətə vɔlf"},
    "dialogo_45": {"texto":"Großmütterchen, was hast du für große Ohren.","fonetica":"ˈɡʁoːsmʏtɐçən vas hast duː fyːɐ̯ ˈɡʁoːsə ˈʔoːʁən"},
    "dialogo_46": {"texto":"Damit ich dich besser hören kann, antwortete der Wolf.","fonetica":"daˈmɪt ʔɪç dɪç ˈbɛsɐ ˈhøːʁən kan ˈʔantvɔʁtətə deːɐ̯ vɔlf"},
    "dialogo_47": {"texto":"Großmütterchen, was hast du für große Zähne.","fonetica":"ˈɡʁoːsmʏtɐçən vas hast duː fyːɐ̯ ˈɡʁoːsə ˈt͡sɛːnə"},
    "dialogo_48": {"texto":"Damit ich dich besser fressen kann, brüllte der Wolf und sprang aus dem Bett.","fonetica":"daˈmɪt ʔɪç dɪç ˈbɛsɐ ˈfʁɛsən kan ˈbʁʏltə deːɐ̯ vɔlf ʔʊnt ʃpʁaŋ ʔaʊs deːm bɛt"},
    "dialogo_49": {"texto":"Rotkäppchen schrie aus vollem Halse.","fonetica":"ˈʁoːtkɛpçən ʃʁiː ʔaʊs ˈfɔləm ˈhalzə"},
    "dialogo_50": {"texto":"Ein Jäger, der vorbeikam, hörte den Schrei.","fonetica":"ʔaɪ̯n ˈjɛːɡɐ deːɐ̯ foːɐ̯ˈbaɪ̯kaːm ˈhøːɐ̯tə deːn ʃʁaɪ̯"},
    "dialogo_51": {"texto":"Er rannte schnell zum Haus.","fonetica":"ʔeːɐ̯ ˈʁantə ʃnɛl tsuːm haʊs"},
    "dialogo_52": {"texto":"Er trat ein und sah den Wolf, wie er versuchte, das Mädchen zu packen.","fonetica":"ʔeːɐ̯ tʁaːt ʔaɪ̯n ʔʊnt zaː deːn vɔlf viː ʔeːɐ̯ fɛɐ̯ˈzuːxtə das ˈmɛːtçən tsuː ˈpakŋ̩"},
    "dialogo_53": {"texto":"Der Jäger zielte mit seiner Flinte und rief laut.","fonetica":"deːɐ̯ ˈjɛːɡɐ ˈt͡siːltə mɪt ˈzaɪ̯nɐ ˈflɪntə ʔʊnt ʁiːf laʊt"},
    "dialogo_54": {"texto":"Halt, du böser Wolf!","fonetica":"halt duː ˈbøːzɐ vɔlf"},
    "dialogo_55": {"texto":"Der Wolf erschrak und ließ Rotkäppchen los.","fonetica":"deːɐ̯ vɔlf ʔɛɐ̯ˈʃʁaːk ʔʊnt liːs ˈʁoːtkɛpçən loːs"},
    "dialogo_56": {"texto":"Der Jäger schaffte es, ihn mit einem Netz zu fangen.","fonetica":"deːɐ̯ ˈjɛːɡɐ ˈʃaftə ɛs ʔiːn mɪt ˈʔaɪ̯nəm nɛt͡s tsuː ˈfaŋən"},
    "dialogo_57": {"texto":"Rotkäppchen umarmte den Jäger dankbar.","fonetica":"ˈʁoːtkɛpçən ˈʔʊmʔaʁmtə deːn ˈjɛːɡɐ ˈdaŋkbaːɐ̯"},
    "dialogo_58": {"texto":"Sie suchten die Großmutter und fanden sie wohlbehalten im Schrank.","fonetica":"ziː ˈzuːxtn̩ diː ˈɡʁoːsmʊtɐ ʔʊnt ˈfandn̩ ziː ˈvoːlbəˌhaltn̩ ʔɪm ʃʁaŋk"},
    "dialogo_59": {"texto":"Die Großmutter kam erleichtert und glücklich heraus.","fonetica":"diː ˈɡʁoːsmʊtɐ kaːm ʔɛɐ̯ˈlaɪ̯çtɐt ʔʊnt ˈɡlʏklɪç hɛˈʁaʊs"},
    "dialogo_60": {"texto":"Alle freuten sich, dass die Gefahr vorüber war.","fonetica":"ˈalə ˈfʁɔɪ̯tn̩ zɪç das diː ɡəˈfaːɐ̯ foˈʁyːbɐ vaːɐ̯"},
    "final_61": {"texto":"Die Großmutter dankte dem Jäger für seine Tapferkeit.","fonetica":"diː ˈɡʁoːsmʊtɐ ˈdaŋktə deːm ˈjɛːɡɐ fyːɐ̯ ˈzaɪ̯nə ˈtap͡fɐkaɪ̯t"},
    "final_62": {"texto":"Rotkäppchen versprach, nie wieder vom Weg abzuweichen.","fonetica":"ˈʁoːtkɛpçən fɛɐ̯ˈʃpʁaːx niː ˈviːdɐ fɔm veːk ˈʔaptsuˌvaɪ̯çn̩"},
    "final_63": {"texto":"Der Jäger riet beiden, vorsichtiger zu sein.","fonetica":"deːɐ̯ ˈjɛːɡɐ ʁiːt ˈbaɪ̯dn̩ ˈfoːɐ̯zɪçtɪɡɐ tsuː zaɪ̯n"},
    "final_64": {"texto":"Der Wolf wurde weit weg vom Wald gebracht, um nicht zurückzukehren.","fonetica":"deːɐ̯ vɔlf ˈvʏʁdə vaɪ̯t vɛk fɔm valt ɡəˈbʁaxt ʔʊm nɪçt tsuˈʁʏktsuˌkeːʁən"},
    "final_65": {"texto":"Die Großmutter servierte warmen Tee für alle.","fonetica":"diː ˈɡʁoːsmʊtɐ zɛʁˈviːʁtə ˈvaʁmən teː fyːɐ̯ ˈalə"},
    "final_66": {"texto":"Rotkäppchen erzählte das Abenteuer voller Emotion.","fonetica":"ˈʁoːtkɛpçən ʔɛɐ̯ˈt͡sɛːltə das ˈʔabn̩tɔɪ̯ɐ ˈfɔlɐ ʔemoˈt͡si̯oːn"},
    "final_67": {"texto":"Der Jäger hörte lächelnd und zustimmend zu.","fonetica":"deːɐ̯ ˈjɛːɡɐ ˈhøːɐ̯tə ˈlɛçl̩nt ʔʊnt ˈt͡suːʃtɪmənt tsuː"},
    "final_68": {"texto":"Die Großmutter streichelte den Kopf ihrer Enkelin.","fonetica":"diː ˈɡʁoːsmʊtɐ ˈʃtʁaɪ̯çɐltə deːn kɔp͡f ˈʔiːʁɐ ˈʔɛŋkəlɪn"},
    "final_69": {"texto":"Sie versprachen, sich öfter zu besuchen.","fonetica":"ziː fɛɐ̯ˈʃpʁaːxən zɪç ˈʔœftɐ tsuː bəˈzuːxən"},
    "final_70": {"texto":"Die Sonne begann über dem Wald unterzugehen.","fonetica":"diː ˈzɔnə bəˈɡan ˈyːbɐ deːm valt ˈʔʊntɐtsuˌɡeːən"},
    "final_71": {"texto":"Rotkäppchen und der Jäger traten den Rückweg an.","fonetica":"ˈʁoːtkɛpçən ʔʊnt deːɐ̯ ˈjɛːɡɐ ˈtʁaːtn̩ deːn ˈʁʏkveːk ʔan"},
    "final_72": {"texto":"Das Mädchen betrachtete die Farben des Sonnenuntergangs.","fonetica":"das ˈmɛːtçən bəˈtʁaxtətə diː ˈfaʁbn̩ dɛs ˈzɔnənʔʊntɐɡaŋs"},
    "final_73": {"texto":"Es dachte an die Lehren, die es an diesem Tag gelernt hatte.","fonetica":"ɛs ˈdaxtə ʔan diː ˈleːʁən diː ɛs ʔan ˈdiːsəm taːk ɡəˈlɛʁnt ˈhatə"},
    "final_74": {"texto":"Es würde niemals mehr Fremden im Wald vertrauen.","fonetica":"ɛs ˈvʏʁdə ˈniːmals meːɐ̯ ˈfʁɛmdn̩ ʔɪm valt fɛɐ̯ˈtʁaʊ̯ən"},
    "final_75": {"texto":"Ihre Mutter erwartete sie ungeduldig an der Haustür.","fonetica":"ˈʔiːʁə ˈmʊtɐ ʔɛɐ̯ˈvaʁtətə ziː ˈʔʊnɡədʊlfdɪç ʔan deːɐ̯ ˈhaʊ̯styːɐ̯"},
    "final_76": {"texto":"Als sie sie sah, lief sie, um sie fest zu umarmen.","fonetica":"als ziː ziː zaː liːf ziː ʔʊm ziː fɛst tsuː ˈʔʊmʔaʁmən"},
    "final_77": {"texto":"Rotkäppchen erzählte alles, was passiert war, ganz genau.","fonetica":"ˈʁoːtkɛpçən ʔɛɐ̯ˈt͡sɛːltə ˈals vas paˈsiːɐ̯t vaːɐ̯ ɡant͡s ɡəˈnaʊ̯"},
    "final_78": {"texto":"Die Mutter lobte sie für ihre Tapferkeit.","fonetica":"diː ˈmʊtɐ ˈloːptə ziː fyːɐ̯ ˈʔiːʁə ˈtap͡fɐkaɪ̯t"},
    "final_79": {"texto":"Beide dankten dem Jäger von ganzem Herzen.","fonetica":"ˈbaɪ̯də ˈdaŋktn̩ deːm ˈjɛːɡɐ fɔn ˈɡant͡səm ˈhɛʁt͡sn̩"},
    "final_80": {"texto":"Seit diesem Tag dachte Rotkäppchen immer daran, seiner Mutter zu gehorchen.","fonetica":"zaɪ̯t ˈdiːsəm taːk ˈdaxtə ˈʁoːtkɛpçən ˈʔɪmɐ daˈʁan ˈzaɪ̯nɐ ˈmʊtɐ tsuː ɡəˈhɔʁçn̩"},
    "epilogo_81": {"texto":"Der Jäger kehrte nach dem Begleiten des Mädchens zu seiner Hütte zurück.","fonetica":"deːɐ̯ ˈjɛːɡɐ ˈkeːɐ̯tə naːx deːm bəˈɡlaɪ̯tn̩ dɛs ˈmɛːtçəns tsuː ˈzaɪ̯nɐ ˈhʏtə tsuˈʁʏk"},
    "epilogo_82": {"texto":"Er dachte über die Bedeutung des Waldschutzes nach.","fonetica":"ʔeːɐ̯ ˈdaxtə ˈyːbɐ diː bəˈdɔɪ̯tʊŋ dɛs ˈvaltʃʊt͡səs naːx"},
    "epilogo_83": {"texto":"Die Großmutter ruhte sich friedlich in ihrem Bett aus.","fonetica":"diː ˈɡʁoːsmʊtɐ ˈʁuːtə zɪç ˈfʁiːtlɪç ʔɪn ˈʔiːʁəm bɛt ʔaʊs"},
    "epilogo_84": {"texto":"Sie erinnerte sich an den Schrecken, den sie erlebt hatte.","fonetica":"ziː ʔɛɐ̯ˈʔɪnɐtə zɪç ʔan deːn ˈʃʁɛkŋ̩ deːn ziː ʔɛɐ̯ˈleːpt ˈhatə"},
    "epilogo_85": {"texto":"Rotkäppchen half seiner Mutter beim Abendessen.","fonetica":"ˈʁoːtkɛpçən half ˈzaɪ̯nɐ ˈmʊtɐ baɪ̯m ˈʔaːbn̩tʔɛsən"},
    "epilogo_86": {"texto":"Während sie kochten, sprachen sie über das Geschehene.","fonetica":"ˈvɛːʁənt ziː ˈkɔxtn̩ ˈʃpʁaːxən ziː ˈyːbɐ das ɡəˈʃeːənə"},
    "epilogo_87": {"texto":"Die Mutter erinnerte an die Wichtigkeit des Gehorsams.","fonetica":"diː ˈmʊtɐ ʔɛɐ̯ˈʔɪnɐtə ʔan diː ˈvɪçtɪçkaɪ̯t dɛs ɡəˈhoːɐ̯zaːms"},
    "epilogo_88": {"texto":"Rotkäppchen versprach, immer vorsichtig zu sein.","fonetica":"ˈʁoːtkɛpçən fɛɐ̯ˈʃpʁaːx ˈʔɪmɐ ˈfoːɐ̯zɪçtɪç tsuː zaɪ̯n"},
    "epilogo_89": {"texto":"Die Nacht brach mit einem sternenklaren Himmel herein.","fonetica":"diː naxt bʁaːx mɪt ˈʔaɪ̯nəm ˈʃtɛʁnənklaːʁən ˈhɪml̩ hɛˈʁaɪ̯n"},
    "epilogo_90": {"texto":"Die Familie aß gemeinsam und glücklich zu Abend.","fonetica":"diː faˈmiːli̯ə ʔaːs ɡəˈmaɪ̯nzam ʔʊnt ˈɡlʏklɪç tsuː ˈʔaːbn̩t"},
    "epilogo_91": {"texto":"Der Wald wurde still unter dem Mond.","fonetica":"deːɐ̯ valt ˈvʏʁdə ʃtɪl ˈʔʊntɐ deːm moːnt"},
    "epilogo_92": {"texto":"Die Tiere ruhten sich friedlich aus.","fonetica":"diː ˈtiːʁə ˈʁuːtn̩ zɪç ˈfʁiːtlɪç ʔaʊs"},
    "epilogo_93": {"texto":"Der Wolf dachte in der Ferne über seine Niederlage nach.","fonetica":"deːɐ̯ vɔlf ˈdaxtə ʔɪn deːɐ̯ ˈfɛʁnə ˈyːbɐ ˈzaɪ̯nə ˈniːdɐlaːɡə naːx"},
    "epilogo_94": {"texto":"Er begriff, dass Bosheit immer Konsequenzen hat.","fonetica":"ʔeːɐ̯ bəˈɡʁɪf das ˈboːshaɪ̯t ˈʔɪmɐ kɔnzeˈkvɛnt͡sən hat"},
    "epilogo_95": {"texto":"Rotkäppchen schlief mit einem erleichterten Lächeln ein.","fonetica":"ˈʁoːtkɛpçən ʃliːf mɪt ˈʔaɪ̯nəm ʔɛɐ̯ˈlaɪ̯çtɐtən ˈlɛçl̩n ʔaɪ̯n"},
    "epilogo_96": {"texto":"Es träumte von friedlichen Tagen im Wald.","fonetica":"ɛs ˈtʁɔɪ̯mtə fɔn ˈfʁiːtlɪçən ˈtaːɡən ʔɪm valt"},
    "epilogo_97": {"texto":"Seine Mutter deckte es liebevoll zu.","fonetica":"ˈzaɪ̯nə ˈmʊtɐ ˈdɛktə ɛs ˈliːbəfɔl tsuː"},
    "epilogo_98": {"texto":"Die Großmutter dachte von ihrem Haus aus auch an sie.","fonetica":"diː ˈɡʁoːsmʊtɐ ˈdaxtə fɔn ˈʔiːʁəm haʊs ʔaʊs ʔaʊx ʔan ziː"},
    "epilogo_99": {"texto":"Der Jäger betrachtete die Sterne, bevor er schlief.","fonetica":"deːɐ̯ ˈjɛːɡɐ bəˈtʁaxtətə diː ˈʃtɛʁnə bəˈfoːɐ̯ ʔeːɐ̯ ʃliːf"},
    "epilogo_100": {"texto":"So endete der Tag, voller Lehren für alle.","fonetica":"zoː ˈʔɛndətə deːɐ̯ taːk ˈfɔlɐ ˈleːʁən fyːɐ̯ ˈalə"},
    "epilogo_101": {"texto":"Die Morgendämmerung tauchte die Bäume des Waldes in Gold.","fonetica":"diː ˈmɔʁɡn̩dɛmɐʁʊŋ ˈtaʊ̯xtə diː ˈbɔɪ̯mə dɛs ˈvaldəs ʔɪn ɡɔlt"},
    "epilogo_102": {"texto":"Die Vögel begannen ihr Morgenlied.","fonetica":"diː ˈføːɡl̩ bəˈɡannən ʔiːɐ̯ ˈmɔʁɡn̩liːt"},
    "epilogo_103": {"texto":"Rotkäppchen wachte voller Energie auf.","fonetica":"ˈʁoːtkɛpçən ˈvaxtə ˈfɔlɐ ʔenɛʁˈɡiː ʔaʊf"},
    "epilogo_104": {"texto":"Es dachte dankbar an seinen tapferen Freund, den Jäger.","fonetica":"ɛs ˈdaxtə ˈdaŋkbaːɐ̯ ʔan ˈzaɪ̯nən ˈtap͡fəʁən fʁɔɪ̯nt deːn ˈjɛːɡɐ"},
    "epilogo_105": {"texto":"Seine Mutter bereitete ein besonderes Frühstück zu.","fonetica":"ˈzaɪ̯nə ˈmʊtɐ bəˈʁaɪ̯tətə ʔaɪ̯n bəˈzɔndəʁəs ˈfʁyːʃtʏk tsuː"},
    "epilogo_106": {"texto":"Während sie aßen, sprachen sie über die Pläne für den Tag.","fonetica":"ˈvɛːʁənt ziː ˈʔaːsən ˈʃpʁaːxən ziː ˈyːbɐ diː ˈplɛːnə fyːɐ̯ deːn taːk"},
    "epilogo_107": {"texto":"Sie beschlossen, die Großmutter in ein paar Tagen wieder zu besuchen.","fonetica":"ziː bəˈʃlɔsən diː ˈɡʁoːsmʊtɐ ʔɪn ʔaɪ̯n paːɐ̯ ˈtaːɡən ˈviːdɐ tsuː bəˈzuːxən"},
    "epilogo_108": {"texto":"Sie wollten sichergehen, dass alles in Ordnung war.","fonetica":"ziː ˈvɔltn̩ ˈzɪçɐɡeːən das ˈʔaləs ʔɪn ˈʔɔʁdnʊŋ vaːɐ̯"},
    "epilogo_109": {"texto":"Die Großmutter genoss ihrerseits die Ruhe.","fonetica":"diː ˈɡʁoːsmʊtɐ ɡəˈnɔs ˈʔiːɐ̯ɐzaɪ̯ts diː ˈʁuːə"},
    "epilogo_110": {"texto":"Sie strickte einen Schal und dachte an ihre Enkelin.","fonetica":"ziː ˈʃtʁɪktə ˈʔaɪ̯nən ʃaːl ʔʊnt ˈdaxtə ʔan ˈʔiːʁə ˈʔɛŋkəlɪn"},
    "epilogo_111": {"texto":"Die Sonne erleuchtete die Hütte mit warmem Licht.","fonetica":"diː ˈzɔnə ʔɛɐ̯ˈlɔɪ̯çtətə diː ˈhʏtə mɪt ˈvaʁməm lɪçt"},
    "epilogo_112": {"texto":"Der Wald atmete Frieden nach dem Abenteuer.","fonetica":"deːɐ̯ valt ˈʔaːtmətə ˈfʁiːdn̩ naːx deːm ˈʔabn̩tɔɪ̯ɐ"},
    "epilogo_113": {"texto":"Die Tiere spielten glücklich zwischen den Bäumen.","fonetica":"diː ˈtiːʁə ˈʃpiːltn̩ ˈɡlʏklɪç ˈtsvɪʃn̩ deːn ˈbɔɪ̯mən"},
    "epilogo_114": {"texto":"Rotkäppchen ging in den Garten, um Blumen zu pflücken.","fonetica":"ˈʁoːtkɛpçən ɡɪŋ ʔɪn deːn ˈɡaʁtn̩ ʔʊm ˈbluːmən tsuː ˈp͡flʏkŋ̩"},
    "epilogo_115": {"texto":"Es dachte darüber nach, wie die Natur immer Schönheit schenkt.","fonetica":"ɛs ˈdaxtə daˈʁyːbɐ naːx viː diː naˈtuːɐ̯ ˈʔɪmɐ ˈʃøːnhaɪ̯t ʃɛŋkt"},
    "epilogo_116": {"texto":"Es beschloss, jeden Spaziergang mit Sorgfalt und Respekt zu machen.","fonetica":"ɛs bəˈʃlɔs ˈjeːdən ʃpaˈt͡siːɐ̯ɡaŋ mɪt ˈzɔʁkfalt ʔʊnt ʁɛsˈpɛkt tsuː ˈmaxn̩"},
    "epilogo_117": {"texto":"Seine Mutter lächelte, als es so nachdenklich sah.","fonetica":"ˈzaɪ̯nə ˈmʊtɐ ˈlɛçəltə als ɛs zoː ˈnaːtdɛŋklɪç zaː"},
    "epilogo_118": {"texto":"Beide wussten, dass dieser Tag ihr Leben verändert hatte.","fonetica":"ˈbaɪ̯də ˈvʊstn̩ das ˈdiːzɐ taːk ʔiːɐ̯ ˈleːbn̩ fɛɐ̯ˈʔɛndɐt ˈhatə"},
    "epilogo_119": {"texto":"Die Erinnerung an das Abenteuer blieb als ewige Lehre.","fonetica":"diː ʔɛɐ̯ˈʔɪnɐʁʊŋ ʔan das ˈʔabn̩tɔɪ̯ɐ bliːp als ˈʔeːvɪɡə ˈleːʁə"},
    "epilogo_120": {"texto":"Und so endet die Geschichte vom tapferen Rotkäppchen.","fonetica":"ʔʊnt zoː ˈʔɛndət diː ɡəˈʃɪçtə fɔm ˈtap͡fəʁən ˈʁoːtkɛpçən"}
  }