{
    "inicio_1": {"texto":"Il était une fois une petite fille appelée le Petit Chaperon Rouge.","fonetica":"il etɛt yn fwa yn pətit fij apele lə pəti ʃapʁɔ̃ ʁuʒ"},
    "inicio_2": {"texto":"Elle vivait dans un petit village entouré de forêt.","fonetica":"ɛl vivɛ dɑ̃z œ̃ pəti vilaʒ ɑ̃tuʁe də fɔʁɛ"},
    "inicio_3": {"texto":"Tout le monde l'aimait pour sa bonté et sa joie de vivre.","fonetica":"tu lə mɔ̃d lɛmɛ puʁ sa bɔ̃te e sa ʒwa də vivʁ"},
    "inicio_4": {"texto":"Un jour, sa mère lui demanda une importante faveur.","fonetica":"œ̃ ʒuʁ sa mɛʁ lɥi dəmɑ̃da yn ɛ̃pɔʁtɑ̃t favœʁ"},
    "inicio_5": {"texto":"Elle devait apporter un panier de nourriture à sa grand-mère.","fonetica":"ɛl dəvɛ apɔʁte œ̃ panje də nuʁityʁ a sa ɡʁɑ̃ mɛʁ"},
    "inicio_6": {"texto":"La grand-mère était malade et avait besoin de soins.","fonetica":"la ɡʁɑ̃ mɛʁ etɛ malad e avɛ bəzwɛ̃ də swɛ̃"},
    "inicio_7": {"texto":"La mère avertit la petite de ne pas quitter le chemin.","fonetica":"la mɛʁ avɛʁti la pətit də nə pa kite lə ʃəmɛ̃"},
    "inicio_8": {"texto":"Elle lui dit aussi de ne parler à aucun inconnu.","fonetica":"ɛl lɥi di osi də nə paʁle a okœ̃ ɛ̃kɔny"},
    "inicio_9": {"texto":"Le Petit Chaperon Rouge promit d'obéir aux conseils de sa mère.","fonetica":"lə pəti ʃapʁɔ̃ ʁuʒ pʁɔmi dɔbeiʁ o kɔ̃sɛj də sa mɛʁ"},
    "inicio_10": {"texto":"Elle prit le panier et commença son chemin dans la forêt.","fonetica":"ɛl pʁi lə panje e kɔmɑ̃sa sɔ̃ ʃəmɛ̃ dɑ̃ la fɔʁɛ"},
    "camino_11": {"texto":"Le soleil brillait et les oiseaux chantaient entre les arbres.","fonetica":"lə sɔlɛj bʁijɛ e le zwazo ʃɑ̃tɛ ɑ̃tʁ le zaʁbʁ"},
    "camino_12": {"texto":"La petite fille s'arrêta pour admirer quelques fleurs rouges.","fonetica":"la pətit fij saʁɛta puʁ admiʁe kɛlkə flœʁ ʁuʒ"},
    "camino_13": {"texto":"Elle se souvint des paroles de sa mère et continua son chemin.","fonetica":"ɛl sə suvɛ̃ de paʁɔl də sa mɛʁ e kɔ̃tinɥa sɔ̃ ʃəmɛ̃"},
    "camino_14": {"texto":"Soudain, elle entendit un craquement derrière les buissons.","fonetica":"sudɛ̃ ɛl ɑ̃tɑ̃di œ̃ kʁakmɑ̃ dɛʁjɛʁ le bɥisɔ̃"},
    "camino_15": {"texto":"Un loup énorme apparut au milieu du sentier.","fonetica":"œ̃ lu enɔʁm apɑʁy o miljø dy sɑ̃tje"},
    "dialogo_16": {"texto":"Le loup la salua avec un sourire rusé.","fonetica":"lə lu la salɥa avɛk œ̃ suʁiʁ ʁyze"},
    "dialogo_17": {"texto":"Bonjour, ma petite, où vas-tu donc ? demanda-t-il.","fonetica":"bɔ̃ʒuʁ ma pətit u va ty dɔ̃k dəmɑ̃da til"},
    "dialogo_18": {"texto":"Je vais chez ma grand-mère qui habite de l'autre côté de la forêt, répondit-elle.","fonetica":"ʒə vɛ ʃe ma ɡʁɑ̃ mɛʁ ki abit də lotʁ kote də la fɔʁɛ ʁepɔndi tɛl"},
    "dialogo_19": {"texto":"Le loup feignit l'intérêt et sourit encore plus.","fonetica":"lə lu fɛɲi lɛ̃teʁɛ e suʁi ɑ̃kɔʁ ply"},
    "dialogo_20": {"texto":"Il lui suggéra de cueillir quelques fleurs pour égayer sa grand-mère.","fonetica":"il lɥi syɡʒeʁa də kœjiʁ kɛlkə flœʁ puʁ eɡeje sa ɡʁɑ̃ mɛʁ"},
    "dialogo_21": {"texto":"Le Petit Chaperon Rouge accepta l'idée sans se douter de rien.","fonetica":"lə pəti ʃapʁɔ̃ ʁuʒ aksepta lide sɑ̃ sə dutɛ də ʁjɛ̃"},
    "dialogo_22": {"texto":"Elle se pencha pour couper les plus belles fleurs.","fonetica":"ɛl sə pɑ̃ʃa puʁ kupe le ply bɛl flœʁ"},
    "dialogo_23": {"texto":"Pendant ce temps, le loup échafauda un plan rapide.","fonetica":"pɑ̃dɑ̃ sə tɑ̃ lə lu eʃafoda œ̃ plɑ̃ ʁapid"},
    "dialogo_24": {"texto":"Il courut par un raccourci pour arriver avant elle chez la grand-mère.","fonetica":"il kuʁy paʁ œ̃ ʁakuʁsi puʁ aʁive avɑ̃ ɛl ʃe la ɡʁɑ̃ mɛʁ"},
    "dialogo_25": {"texto":"Il frappa doucement à la porte.","fonetica":"il fʁapa dusmɑ̃ a la pɔʁt"},
    "dialogo_26": {"texto":"La grand-mère demanda qui c'était.","fonetica":"la ɡʁɑ̃ mɛʁ dəmɑ̃da ki setɛ"},
    "dialogo_27": {"texto":"Le loup imita la voix du Petit Chaperon Rouge.","fonetica":"lə lu imita la vwa dy pəti ʃapʁɔ̃ ʁuʒ"},
    "dialogo_28": {"texto":"C'est moi, grand-maman, dit-il avec douceur.","fonetica":"sɛ mwa ɡʁɑ̃ mamɑ̃ dit il avɛk dusœʁ"},
    "dialogo_29": {"texto":"La grand-mère lui dit d'entrer.","fonetica":"la ɡʁɑ̃ mɛʁ lɥi di dɑ̃tʁe"},
    "dialogo_30": {"texto":"Le loup entra et ferma la porte d'un bond.","fonetica":"lə lu ɑ̃tʁa e fɛʁma la pɔʁt dœ̃ bɔ̃"},
    "engaño_31": {"texto":"Il se jeta sur la grand-mère et l'enferma dans l'armoire.","fonetica":"il sə ʒeta syʁ la ɡʁɑ̃ mɛʁ e lɑ̃fɛʁma dɑ̃ l aʁmwaʁ"},
    "engaño_32": {"texto":"Puis il mit son bonnet et ses lunettes.","fonetica":"pɥi il mi sɔ̃ bɔnɛ e se lynɛt"},
    "engaño_33": {"texto":"Il se coucha dans le lit pour attendre le Petit Chaperon Rouge.","fonetica":"il sə kuʃa dɑ̃ lə li puʁ atɑ̃dʁ lə pəti ʃapʁɔ̃ ʁuʒ"},
    "camino_34": {"texto":"Pendant ce temps, le Petit Chaperon Rouge continuait à cueillir des fleurs.","fonetica":"pɑ̃dɑ̃ sə tɑ̃ lə pəti ʃapʁɔ̃ ʁuʒ kɔ̃tinɥɛ a kœjiʁ de flœʁ"},
    "camino_35": {"texto":"Elle se rappela à nouveau l'avertissement de sa mère.","fonetica":"ɛl sə ʁapɛla a nuvo l avɛʁtismɑ̃ də sa mɛʁ"},
    "camino_36": {"texto":"Elle se rendit compte qu'il se faisait tard.","fonetica":"ɛl sə ʁɑ̃di kɔ̃t k il sə fɛzɛ taʁ"},
    "camino_37": {"texto":"Elle pressa le pas vers la maison de sa grand-mère.","fonetica":"ɛl pʁɛsa lə pa vɛʁ la mɛzɔ̃ də sa ɡʁɑ̃ mɛʁ"},
    "encuentro_38": {"texto":"En arrivant, elle remarqua la porte entrouverte.","fonetica":"ɑ̃ naʁivɑ̃ ɛl ʁəmaʁka la pɔʁt ɑ̃tʁuvɛʁt"},
    "encuentro_39": {"texto":"La maison était silencieuse et un peu sombre.","fonetica":"la mɛzɔ̃ etɛ silɑ̃sjøz e œ̃ pø sɔ̃bʁ"},
    "encuentro_40": {"texto":"Le Petit Chaperon Rouge entra avec prudence.","fonetica":"lə pəti ʃapʁɔ̃ ʁuʒ ɑ̃tʁa avɛk pʁydɑ̃s"},
    "dialogo_41": {"texto":"Elle s'approcha du lit de sa grand-mère avec curiosité.","fonetica":"ɛl sapʁɔʃa dy li də sa ɡʁɑ̃ mɛʁ avɛk kyʁjɔzite"},
    "dialogo_42": {"texto":"Elle vit la grand-mère recouverte jusqu'à la tête.","fonetica":"ɛl vi la ɡʁɑ̃ mɛʁ ʁəkuvɛʁt ʒyska la tɛt"},
    "dialogo_43": {"texto":"Grand-maman, que vous avez de grands yeux, dit le Petit Chaperon Rouge.","fonetica":"ɡʁɑ̃ mamɑ̃ kə vuz ave də ɡʁɑ̃z jø di lə pəti ʃapʁɔ̃ ʁuʒ"},
    "dialogo_44": {"texto":"C'est pour mieux te voir, répondit le loup déguisé.","fonetica":"sɛ puʁ mjø tə vwaʁ ʁepɔndi lə lu deɡize"},
    "dialogo_45": {"texto":"Grand-maman, que vous avez de grandes oreilles.","fonetica":"ɡʁɑ̃ mamɑ̃ kə vuz ave də ɡʁɑ̃d zɔʁɛj"},
    "dialogo_46": {"texto":"C'est pour mieux t'entendre, répondit le loup.","fonetica":"sɛ puʁ mjø tɑ̃tɑ̃dʁ ʁepɔndi lə lu"},
    "dialogo_47": {"texto":"Grand-maman, que vous avez de grandes dents.","fonetica":"ɡʁɑ̃ mamɑ̃ kə vuz ave də ɡʁɑ̃d dɑ̃"},
    "dialogo_48": {"texto":"C'est pour mieux te manger, rugit le loup en sautant du lit.","fonetica":"sɛ puʁ mjø tə mɑ̃ʒe ʁyʒi lə lu ɑ̃ sotɑ̃ dy li"},
    "dialogo_49": {"texto":"Le Petit Chaperon Rouge cria de toutes ses forces.","fonetica":"lə pəti ʃapʁɔ̃ ʁuʒ kʁia də tut se fɔʁs"},
    "dialogo_50": {"texto":"Un chasseur qui passait par là entendit le cri.","fonetica":"œ̃ ʃasœʁ ki pasɛ paʁ la ɑ̃tɑ̃di lə kʁi"},
    "dialogo_51": {"texto":"Il courut rapidement vers la maison.","fonetica":"il kuʁy ʁapidmɑ̃ vɛʁ la mɛzɔ̃"},
    "dialogo_52": {"texto":"Il entra et vit le loup essayant d'attraper la petite fille.","fonetica":"il ɑ̃tʁa e vi lə lu ɛsɛjɑ̃ datʁape la pətit fij"},
    "dialogo_53": {"texto":"Le chasseur pointa son fusil et cria fort.","fonetica":"lə ʃasœʁ pwɛ̃ta sɔ̃ fyzil e kʁia fɔʁ"},
    "dialogo_54": {"texto":"Arrête, méchant loup !","fonetica":"aʁɛt meʃɑ̃ lu"},
    "dialogo_55": {"texto":"Le loup eut peur et lâcha le Petit Chaperon Rouge.","fonetica":"lə lu y pœʁ e laʃa lə pəti ʃapʁɔ̃ ʁuʒ"},
    "dialogo_56": {"texto":"Le chasseur réussit à le capturer avec un filet.","fonetica":"lə ʃasœʁ ʁeysi a lə kaptyʁe avɛk œ̃ filɛ"},
    "dialogo_57": {"texto":"Le Petit Chaperon Rouge embrassa le chasseur, reconnaissante.","fonetica":"lə pəti ʃapʁɔ̃ ʁuʒ ɑ̃bʁasa lə ʃasœʁ ʁəkɔnɛsɑ̃t"},
    "dialogo_58": {"texto":"Ils cherchèrent la grand-mère et la trouvèrent saine et sauve dans l'armoire.","fonetica":"il ʃɛʁʃɛʁ la ɡʁɑ̃ mɛʁ e la tʁuvɛʁ sɛn e sov dɑ̃ l aʁmwaʁ"},
    "dialogo_59": {"texto":"La grand-mère sortit, soulagée et heureuse.","fonetica":"la ɡʁɑ̃ mɛʁ sɔʁti sulɑʒe e øʁøz"},
    "dialogo_60": {"texto":"Tout le monde se réjouit que le danger soit passé.","fonetica":"tu lə mɔ̃d sə ʁeʒwi kə lə dɑ̃ʒe swa pase"},
    "final_61": {"texto":"La grand-mère remercia le chasseur pour son courage.","fonetica":"la ɡʁɑ̃ mɛʁ ʁəmɛʁsja lə ʃasœʁ puʁ sɔ̃ kuʁaʒ"},
    "final_62": {"texto":"Le Petit Chaperon Rouge promit de ne plus jamais quitter le chemin.","fonetica":"lə pəti ʃapʁɔ̃ ʁuʒ pʁɔmi də nə ply ʒamɛ kite lə ʃəmɛ̃"},
    "final_63": {"texto":"Le chasseur conseilla à toutes deux d'être plus prudentes.","fonetica":"lə ʃasœʁ kɔ̃sɛja a tut dø dɛtʁə ply pʁydɑ̃t"},
    "final_64": {"texto":"Le loup fut emmené loin de la forêt pour ne plus revenir.","fonetica":"lə lu fy ɑ̃mne lwɛ̃ də la fɔʁɛ puʁ nə ply ʁəvəniʁ"},
    "final_65": {"texto":"La grand-mère servit du thé chaud pour tout le monde.","fonetica":"la ɡʁɑ̃ mɛʁ sɛʁvi dy te ʃo puʁ tu lə mɔ̃d"},
    "final_66": {"texto":"Le Petit Chaperon Rouge raconta l'aventure avec émotion.","fonetica":"lə pəti ʃapʁɔ̃ ʁuʒ ʁakɔ̃ta l avɑ̃tyʁ avɛk emɔsjɔ̃"},
    "final_67": {"texto":"Le chasseur écouta en souriant et en approuvant.","fonetica":"lə ʃasœʁ ekuta ɑ̃ suʁjɑ̃ e ɑ̃napʁuvɑ̃"},
    "final_68": {"texto":"La grand-mère caressa la tête de sa petite-fille.","fonetica":"la ɡʁɑ̃ mɛʁ kaʁɛsa la tɛt də sa pətit fij"},
    "final_69": {"texto":"Elles promirent de se voir plus souvent.","fonetica":"ɛl pʁɔmiʁ də sə vwaʁ ply suvɑ̃"},
    "final_70": {"texto":"Le soleil commença à se coucher sur la forêt.","fonetica":"lə sɔlɛj kɔmɑ̃sa a sə kuʃe syʁ la fɔʁɛ"},
    "final_71": {"texto":"Le Petit Chaperon Rouge et le chasseur reprirent le chemin du retour.","fonetica":"lə pəti ʃapʁɔ̃ ʁuʒ e lə ʃasœʁ ʁəpʁiʁ lə ʃəmɛ̃ dy ʁətuʁ"},
    "final_72": {"texto":"La petite fille regardait les couleurs du coucher de soleil.","fonetica":"la pətit fij ʁəɡaʁdɛ le kulœʁ dy kuʃe də sɔlɛj"},
    "final_73": {"texto":"Elle se rappelait les leçons apprises ce jour-là.","fonetica":"ɛl sə ʁapəlɛ le ləsɔ̃ apʁiz sə ʒuʁ la"},
    "final_74": {"texto":"Elle ne ferait plus jamais confiance aux inconnus de la forêt.","fonetica":"ɛl nə fəʁɛ ply ʒamɛ kɔ̃fjɑ̃s o zɛ̃kɔny də la fɔʁɛ"},
    "final_75": {"texto":"Sa mère l'attendait avec impatience à la porte de la maison.","fonetica":"sa mɛʁ latɑ̃dɛ avɛk ɛ̃pasjɑ̃s a la pɔʁt də la mɛzɔ̃"},
    "final_76": {"texto":"En la voyant, elle courut l'embrasser fort.","fonetica":"ɑ̃ la vwɛjɑ̃ ɛl kuʁy lɑ̃bʁase fɔʁ"},
    "final_77": {"texto":"Le Petit Chaperon Rouge raconta tout ce qui s'était passé en détail.","fonetica":"lə pəti ʃapʁɔ̃ ʁuʒ ʁakɔ̃ta tu sə ki setɛ pase ɑ̃ detaj"},
    "final_78": {"texto":"Sa mère la félicita pour son courage.","fonetica":"sa mɛʁ la felisita puʁ sɔ̃ kuʁaʒ"},
    "final_79": {"texto":"Toutes deux remercièrent le chasseur du fond du cœur.","fonetica":"tut dø ʁəmɛʁsjɛʁ lə ʃasœʁ dy fɔ̃ dy kœʁ"},
    "final_80": {"texto":"Depuis ce jour, le Petit Chaperon Rouge n'oublia jamais d'obéir à sa mère.","fonetica":"dəpɥi sə ʒuʁ lə pəti ʃapʁɔ̃ ʁuʒ nubli ja ʒamɛ dɔbeiʁ a sa mɛʁ"},
    "epilogo_81": {"texto":"Le chasseur retourna à sa cabane après avoir raccompagné la petite fille.","fonetica":"lə ʃasœʁ ʁətuʁna a sa kaban apʁɛz avwaʁ ʁakɔ̃paɲe la pətit fij"},
    "epilogo_82": {"texto":"Il pensait à l'importance de protéger la forêt.","fonetica":"il pɑ̃sɛ a lɛ̃pɔʁtɑ̃s də pʁɔteʒe la fɔʁɛ"},
    "epilogo_83": {"texto":"La grand-mère se reposait tranquillement dans son lit.","fonetica":"la ɡʁɑ̃ mɛʁ sə ʁəpɔzɛ tʁɑ̃kilmɑ̃ dɑ̃ sɔ̃ li"},
    "epilogo_84": {"texto":"Elle se souvenait de la peur qu'elle avait eue.","fonetica":"ɛl sə suvənɛ də la pœʁ kɛl avɛt y"},
    "epilogo_85": {"texto":"Le Petit Chaperon Rouge aida sa mère à préparer le dîner.","fonetica":"lə pəti ʃapʁɔ̃ ʁuʒ ɛda sa mɛʁ a pʁepaʁe lə dine"},
    "epilogo_86": {"texto":"Pendant qu'elles cuisinaient, elles parlaient de ce qui s'était passé.","fonetica":"pɑ̃dɑ̃ kɛl kɥizinɛ ɛl paʁlɛ də sə ki setɛ pase"},
    "epilogo_87": {"texto":"La mère rappela l'importance de l'obéissance.","fonetica":"la mɛʁ ʁapɛla lɛ̃pɔʁtɑ̃s də lɔbeisɑ̃s"},
    "epilogo_88": {"texto":"Le Petit Chaperon Rouge promit d'être toujours prudente.","fonetica":"lə pəti ʃapʁɔ̃ ʁuʒ pʁɔmi dɛtʁə tuʒuʁ pʁydɑ̃t"},
    "epilogo_89": {"texto":"La nuit tomba avec un ciel étoilé.","fonetica":"la nɥi tɔ̃ba avɛk œ̃ sjɛl etwale"},
    "epilogo_90": {"texto":"La famille dîna ensemble et heureuse.","fonetica":"la famij dina ɑ̃sɑ̃bl e øʁøz"},
    "epilogo_91": {"texto":"La forêt devint silencieuse sous la lune.","fonetica":"la fɔʁɛ dəvɛ̃ silɑ̃sjøz su la lyn"},
    "epilogo_92": {"texto":"Les animaux se reposaient tranquillement.","fonetica":"le zanimo sə ʁəpɔzɛ tʁɑ̃kilmɑ̃"},
    "epilogo_93": {"texto":"Le loup, au loin, méditait sur sa défaite.","fonetica":"lə lu o lwɛ̃ meditɛ syʁ sa defɛt"},
    "epilogo_94": {"texto":"Il comprit que la méchanceté apporte toujours des conséquences.","fonetica":"il kɔ̃pʁi kə la meʃɑ̃ste apɔʁt tuʒuʁ de kɔ̃sekɑ̃s"},
    "epilogo_95": {"texto":"Le Petit Chaperon Rouge s'endormit avec un sourire de soulagement.","fonetica":"lə pəti ʃapʁɔ̃ ʁuʒ sɑ̃dɔʁmi avɛk œ̃ suʁiʁ də sulɑʒmɑ̃"},
    "epilogo_96": {"texto":"Elle rêva de jours paisibles dans la forêt.","fonetica":"ɛl ʁɛva də ʒuʁ pɛzibl dɑ̃ la fɔʁɛ"},
    "epilogo_97": {"texto":"Sa mère la borda avec tendresse.","fonetica":"sa mɛʁ la bɔʁda avɛk tɑ̃dʁɛs"},
    "epilogo_98": {"texto":"La grand-mère, depuis chez elle, pensait aussi à elles.","fonetica":"la ɡʁɑ̃ mɛʁ dəpɥi ʃɛz ɛl pɑ̃sɛ osi a ɛl"},
    "epilogo_99": {"texto":"Le chasseur regarda les étoiles avant de s'endormir.","fonetica":"lə ʃasœʁ ʁəɡaʁda le zetwal avɑ̃ də sɑ̃dɔʁmiʁ"},
    "epilogo_100": {"texto":"Ainsi se termina cette journée riche en enseignements pour tous.","fonetica":"ɛ̃si sə tɛʁmina sɛt ʒuʁne ʁiʃ ɑ̃ nɛ̃sɛɲmɑ̃ puʁ tu"},
    "epilogo_101": {"texto":"L'aurore dora les arbres de la forêt.","fonetica":"loʁɔʁ dɔʁa le zaʁbʁ də la fɔʁɛ"},
    "epilogo_102": {"texto":"Les oiseaux commencèrent leur chant matinal.","fonetica":"le zwazo kɔmɑ̃sɛʁ lœʁ ʃɑ̃ matinal"},
    "epilogo_103": {"texto":"Le Petit Chaperon Rouge se réveilla pleine d'énergie.","fonetica":"lə pəti ʃapʁɔ̃ ʁuʒ sə ʁevɛja plɛn denɛʁʒi"},
    "epilogo_104": {"texto":"Elle se souvint avec gratitude de son courageux ami le chasseur.","fonetica":"ɛl sə suvɛ̃ avɛk ɡʁatityd də sɔ̃ kuʁaʒø zami lə ʃasœʁ"},
    "epilogo_105": {"texto":"Sa mère lui prépara un petit-déjeuner spécial.","fonetica":"sa mɛʁ lɥi pʁepaʁa œ̃ pətideʒœne spesjal"},
    "epilogo_106": {"texto":"Pendant qu'elles mangeaient, elles parlèrent des projets de la journée.","fonetica":"pɑ̃dɑ̃ kɛl mɑ̃ʒɛ ɛl paʁlɛʁ de pʁɔʒɛ də la ʒuʁne"},
    "epilogo_107": {"texto":"Elles décidèrent de rendre à nouveau visite à la grand-mère dans quelques jours.","fonetica":"ɛl desidɛʁ də ʁɑ̃dʁ a nuvo vizit a la ɡʁɑ̃ mɛʁ dɑ̃ kɛlkə ʒuʁ"},
    "epilogo_108": {"texto":"Elles voulaient s'assurer que tout allait bien.","fonetica":"ɛl vulɛ sasyʁ kə tut alɛ bjɛ̃"},
    "epilogo_109": {"texto":"La grand-mère, quant à elle, profitait du calme.","fonetica":"la ɡʁɑ̃ mɛʁ kɑ̃t a ɛl pʁɔfitɛ dy kalm"},
    "epilogo_110": {"texto":"Elle tricotait une écharpe en pensant à sa petite-fille.","fonetica":"ɛl tʁikɔtɛ yn eʃaʁp ɑ̃ pɑ̃sɑ̃ a sa pətit fij"},
    "epilogo_111": {"texto":"Le soleil illuminait la cabane d'une lumière chaude.","fonetica":"lə sɔlɛj ilyminɛ la kaban dyn lɥmjɛʁ ʃod"},
    "epilogo_112": {"texto":"La forêt respirait la paix après l'aventure.","fonetica":"la fɔʁɛ ʁɛspiʁɛ la pɛ apʁɛ l avɑ̃tyʁ"},
    "epilogo_113": {"texto":"Les animaux jouaient joyeusement entre les arbres.","fonetica":"le zanimo ʒuɛ ʒwajøzmɑ̃ ɑ̃tʁ le zaʁbʁ"},
    "epilogo_114": {"texto":"Le Petit Chaperon Rouge sortit au jardin pour cueillir des fleurs.","fonetica":"lə pəti ʃapʁɔ̃ ʁuʒ sɔʁti o ʒaʁdɛ̃ puʁ kœjiʁ de flœʁ"},
    "epilogo_115": {"texto":"Elle pensait à la façon dont la nature offre toujours de la beauté.","fonetica":"ɛl pɑ̃sɛ a la fasɔ̃ dɔ̃ la natyʁ ɔfʁ tuʒuʁ də la bote"},
    "epilogo_116": {"texto":"Elle décida que chaque promenade se ferait avec soin et respect.","fonetica":"ɛl desida kə ʃak pʁɔmnad sə fəʁɛ avɛk swɛ̃ e ʁɛspɛ"},
    "epilogo_117": {"texto":"Sa mère sourit en la voyant si réfléchie.","fonetica":"sa mɛʁ suʁi ɑ̃ la vwɛjɑ̃ si ʁefleʃi"},
    "epilogo_118": {"texto":"Toutes deux savaient que ce jour avait changé leur vie.","fonetica":"tut dø savɛ kə sə ʒuʁ avɛ ʃɑ̃ʒe lœʁ vi"},
    "epilogo_119": {"texto":"Le souvenir de l'aventure resta comme une leçon éternelle.","fonetica":"lə suvniʁ də l avɑ̃tyʁ ʁɛsta kɔm yn ləsɔ̃ etɛʁnɛl"},
    "epilogo_120": {"texto":"Ainsi se termine l'histoire du courageux Petit Chaperon Rouge.","fonetica":"ɛ̃si sə tɛʁmin listwaʁ dy kuʁaʒø pəti ʃapʁɔ̃ ʁuʒ"}
  }