{
    "inicio_1": {"texto":"C'era una volta una bambina di nome Cappuccetto Rosso.","fonetica":"t͡ʃɛra ˈuːna ˈvɔlta ˈuːna bamˈbiːna di ˈnoːme kapputˈt͡ʃɛtto ˈrosso"},
    "inicio_2": {"texto":"Viveva in un piccolo villaggio circondato dal bosco.","fonetica":"viˈveːva in un ˈpikkolo vilˈladːd͡ʒo t͡ʃirkonˈdaːto dal ˈbosko"},
    "inicio_3": {"texto":"Tutti le volevano bene per la sua bontà e allegria.","fonetica":"ˈtutti le voˈlevano ˈbɛːne per la ˈsuːa bonˈta e alleˈɡriːa"},
    "inicio_4": {"texto":"Un giorno sua madre le chiese un importante favore.","fonetica":"un ˈd͡ʒorno ˈsuːa ˈmaːdre le ˈkjeːze un imporˈtante faˈvoːre"},
    "inicio_5": {"texto":"Doveva portare un cesto di cibo a sua nonna.","fonetica":"doˈveːva porˈtaːre un ˈt͡ʃɛsto di ˈt͡ʃiːbo a ˈsuːa ˈnonna"},
    "inicio_6": {"texto":"La nonna era malata e aveva bisogno di cure.","fonetica":"la ˈnonna ˈɛːra maˈlaːta e aˈveːva biˈzoɲɲo di ˈkuːre"},
    "inicio_7": {"texto":"La madre avvertì la bambina di non allontanarsi dal sentiero.","fonetica":"la ˈmaːdre averˈtiː la bamˈbiːna di ˈnon allontaˈnarsi dal senˈtjɛːro"},
    "inicio_8": {"texto":"Le disse anche di non parlare con gli sconosciuti.","fonetica":"le ˈdisse ˈaːnke di ˈnon parˈlaːre kon ʎi skonoʃˈʃuːti"},
    "inicio_9": {"texto":"Cappuccetto Rosso promise di obbedire alle indicazioni della madre.","fonetica":"kapputˈt͡ʃɛtto ˈrosso proˈmiːze di obbeˈdiːre ˈalle indikaˈt͡sjoːni ˈdella ˈmaːdre"},
    "inicio_10": {"texto":"Prese il cesto e iniziò il suo cammino nel bosco.","fonetica":"ˈpreːze il ˈt͡ʃɛsto e iniˈt͡sjo il ˈsuːo kamˈmiːno nel ˈbosko"},
    "camino_11": {"texto":"Il sole splendeva e gli uccelli cantavano tra gli alberi.","fonetica":"il ˈsoːle splenˈdeːva e ʎ utˈt͡ʃɛlli kanˈtaːvano tra ʎ ˈalberi"},
    "camino_12": {"texto":"La bambina si fermò ad ammirare alcuni fiori rossi.","fonetica":"la bamˈbiːna si ferˈmo ad ammiˈraːre alˈkuːni ˈfjoːri ˈrossi"},
    "camino_13": {"texto":"Ricordò le parole della madre e proseguì avanti.","fonetica":"rikorˈdo le paˈroːle ˈdella ˈmaːdre e proseˈɡwi aˈvanti"},
    "camino_14": {"texto":"All'improvviso sentì uno scricchiolio dietro i cespugli.","fonetica":"allimprovˈvisːo senˈti ˈuːno skrikˈkjoːljo ˈdjetro i ʃeˈspuʎʎi"},
    "camino_15": {"texto":"Un lupo enorme apparve in mezzo al sentiero.","fonetica":"un ˈluːpo eˈnorme apˈparve in ˈmɛdd͡zo al senˈtjɛːro"},
    "dialogo_16": {"texto":"Il lupo la salutò con un sorriso astuto.","fonetica":"il ˈluːpo la saluˈto kon un sorˈriːzo aˈstuːto"},
    "dialogo_17": {"texto":"Buongiorno, piccolina, dove stai andando? chiese.","fonetica":"bwonˈd͡ʒorno pikkoˈliːna ˈdoːve ˈstai anˈdando ˈkjeːze"},
    "dialogo_18": {"texto":"Vado dalla nonna che vive dall'altra parte del bosco, rispose.","fonetica":"ˈvaːdo ˈdalla ˈnonna ke ˈviːve dalˈlaltra ˈparte del ˈbosko risˈpoːze"},
    "dialogo_19": {"texto":"Il lupo finse interesse e sorrise ancora di più.","fonetica":"il ˈluːpo ˈfinʃe inteˈresse e sorˈriːze aŋˈkoːra di ˈpju"},
    "dialogo_20": {"texto":"Le suggerì di cogliere alcuni fiori per rallegrare la nonna.","fonetica":"le sudːd͡ʒeˈri di ˈkoʎʎere alˈkuːni ˈfjoːri per ralleˈɡraːre la ˈnonna"},
    "dialogo_21": {"texto":"Cappuccetto Rosso accettò l'idea senza sospettare nulla.","fonetica":"kapputˈt͡ʃɛtto ˈrosso atːt͡ʃetˈto liˈdɛːa ˈsent͡sa sospetˈtaːre ˈnulla"},
    "dialogo_22": {"texto":"Si chinò per cogliere i fiori più belli.","fonetica":"si kiˈno per ˈkoʎʎere i ˈfjoːri ˈpju ˈbɛlli"},
    "dialogo_23": {"texto":"Nel frattempo, il lupo escogitò un piano rapido.","fonetica":"nel fratˈtɛmpo il ˈluːpo eskoˈd͡ʒiːto un ˈpjaːno ˈraːpido"},
    "dialogo_24": {"texto":"Corse per una scorciatoia per arrivare prima a casa della nonna.","fonetica":"ˈkorse per ˈuːna skort͡ʃaˈtoːja per arriˈvaːre ˈpriːma a ˈkaːsa ˈdella ˈnonna"},
    "dialogo_25": {"texto":"Bussò alla porta delicatamente.","fonetica":"busˈso ˈalla ˈporta delikaˈtamente"},
    "dialogo_26": {"texto":"La nonna chiese chi era.","fonetica":"la ˈnonna ˈkjeːze ˈki ˈɛːra"},
    "dialogo_27": {"texto":"Il lupo imitò la voce di Cappuccetto Rosso.","fonetica":"il ˈluːpo iˈmiːto la ˈvoːt͡ʃe di kapputˈt͡ʃɛtto ˈrosso"},
    "dialogo_28": {"texto":"Sono io, nonnina, disse con dolcezza.","fonetica":"ˈsoːno ˈiːo nonˈniːna ˈdisse kon dolˈt͡ʃetːsa"},
    "dialogo_29": {"texto":"La nonna gli disse di entrare.","fonetica":"la ˈnonna ʎi ˈdisse di enˈtraːre"},
    "dialogo_30": {"texto":"Il lupo entrò e chiuse la porta di colpo.","fonetica":"il ˈluːpo enˈtro e ˈkjuːze la ˈporta di ˈkolpo"},
    "engaño_31": {"texto":"Si avventò sulla nonna e la rinchiuse nell'armadio.","fonetica":"si avvenˈto ˈsulla ˈnonna e la riŋˈkjuːze nellarˈmaːdjo"},
    "engaño_32": {"texto":"Poi indossò la sua cuffia e i suoi occhiali.","fonetica":"ˈpoi inˈdosso la ˈsuːa ˈkuffja e i ˈsuːi okˈkjaːli"},
    "engaño_33": {"texto":"Si mise a letto per aspettare Cappuccetto Rosso.","fonetica":"si ˈmiːze a ˈletto per aspetˈtaːre kapputˈt͡ʃɛtto ˈrosso"},
    "camino_34": {"texto":"Nel frattempo, Cappuccetto Rosso continuava a cogliere fiori.","fonetica":"nel fratˈtɛmpo kapputˈt͡ʃɛtto ˈrosso kontiˈnuːava a ˈkoʎʎere ˈfjoːri"},
    "camino_35": {"texto":"Si ricordò nuovamente dell'avvertimento della madre.","fonetica":"si riˈkordo nuovaˈmente dellavverˈtimento ˈdella ˈmaːdre"},
    "camino_36": {"texto":"Si rese conto che era già tardi.","fonetica":"si ˈreːze ˈkonto ke ˈɛːra ˈd͡ʒa ˈtardi"},
    "camino_37": {"texto":"Affrettò il passo verso la casa della nonna.","fonetica":"affretˈto il ˈpasso ˈversɔ la ˈkaːsa ˈdella ˈnonna"},
    "encuentro_38": {"texto":"Arrivando, notò la porta socchiusa.","fonetica":"arriˈvando noˈto la ˈporta sokˈkjuːza"},
    "encuentro_39": {"texto":"La casa era in silenzio e un po' buia.","fonetica":"la ˈkaːza ˈɛːra in siˈlent͡sjo e un ˈpɔ ˈbuːja"},
    "encuentro_40": {"texto":"Cappuccetto Rosso entrò con cautela.","fonetica":"kapputˈt͡ʃɛtto ˈrosso enˈtro kon kauˈtɛːla"},
    "dialogo_41": {"texto":"Si avvicinò al letto della nonna con curiosità.","fonetica":"si avːit͡ʃiˈno al ˈletto ˈdella ˈnonna kon kurjoziˈta"},
    "dialogo_42": {"texto":"Vide la nonna coperta fino alla testa.","fonetica":"ˈviːde la ˈnonna koˈpɛrta ˈfiːno ˈalla ˈtɛsta"},
    "dialogo_43": {"texto":"Nonna, che occhi grandi che hai, disse Cappuccetto Rosso.","fonetica":"ˈnonna ke ˈɔkkːi ˈɡrandi ke ˈai ˈdisse kapputˈt͡ʃɛtto ˈrosso"},
    "dialogo_44": {"texto":"Sono per vederti meglio, rispose il lupo travestito.","fonetica":"ˈsoːno per veˈderti ˈmɛʎʎo risˈpoːze il ˈluːpo traveˈstiːto"},
    "dialogo_45": {"texto":"Nonna, che orecchie grandi che hai.","fonetica":"ˈnonna ke oˈrekkje ˈɡrandi ke ˈai"},
    "dialogo_46": {"texto":"Sono per sentirti meglio, rispose il lupo.","fonetica":"ˈsoːno per senˈtirti ˈmɛʎʎo risˈpoːze il ˈluːpo"},
    "dialogo_47": {"texto":"Nonna, che denti affilati che hai.","fonetica":"ˈnonna ke ˈdɛnti affiˈlaːti ke ˈai"},
    "dialogo_48": {"texto":"Sono per mangiarti meglio, ruggì il lupo saltando giù dal letto.","fonetica":"ˈsoːno per manˈd͡ʒarti ˈmɛʎʎo rudˈd͡ʒi il ˈluːpo salˈtando ˈd͡ʒu dal ˈletto"},
    "dialogo_49": {"texto":"Cappuccetto Rosso gridò con tutte le sue forze.","fonetica":"kapputˈt͡ʃɛtto ˈrosso ɡriˈdo kon ˈtutte le ˈsue ˈfort͡se"},
    "dialogo_50": {"texto":"Un cacciatore che passava di lì sentì le grida.","fonetica":"un katːt͡ʃaˈtoːre ke pasˈsaːva di ˈli senˈti le ˈɡriːda"},
    "dialogo_51": {"texto":"Corse rapidamente verso la casa.","fonetica":"ˈkorse rapidamente ˈverso la ˈkaːsa"},
    "dialogo_52": {"texto":"Entrò e vide il lupo che cercava di afferrare la bambina.","fonetica":"enˈtro e ˈviːde il ˈluːpo ke t͡ʃerˈkaːva di afferˈraːre la bamˈbiːna"},
    "dialogo_53": {"texto":"Il cacciatore puntò il fucile e gridò forte.","fonetica":"il katːt͡ʃaˈtoːre punˈto il fuˈt͡ʃiːle e ɡriˈdo ˈforte"},
    "dialogo_54": {"texto":"Fermati, lupo malvagio!","fonetica":"ferˈmaːti ˈluːpo malˈvaːd͡ʒo"},
    "dialogo_55": {"texto":"Il lupo si spaventò e lasciò andare Cappuccetto Rosso.","fonetica":"il ˈluːpo si spavenˈto e laʃˈʃo anˈdaːre kapputˈt͡ʃɛtto ˈrosso"},
    "dialogo_56": {"texto":"Il cacciatore riuscì a catturarlo con una rete.","fonetica":"il katːt͡ʃaˈtoːre rjuʃˈʃi a katːtuˈraːrlo kon ˈuːna ˈreːte"},
    "dialogo_57": {"texto":"Cappuccetto Rosso abbracciò il cacciatore riconoscente.","fonetica":"kapputˈt͡ʃɛtto ˈrosso abːratˈt͡ʃo il katːt͡ʃaˈtoːre riconoʃˈʃɛnte"},
    "dialogo_58": {"texto":"Cercarono la nonna e la trovarono sana e salva nell'armadio.","fonetica":"t͡ʃerˈkaːrono la ˈnonna e la troˈvaːrono ˈsaːna e ˈsalva nellarˈmaːdjo"},
    "dialogo_59": {"texto":"La nonna uscì sollevata e felice.","fonetica":"la ˈnonna uʃˈʃi solleˈvaːta e feˈliːt͡ʃe"},
    "dialogo_60": {"texto":"Tutti si rallegrarono che il pericolo fosse passato.","fonetica":"ˈtutti si ralleˈɡraːrono ke il peˈriːkolo ˈfosse pasˈsaːto"},
    "final_61": {"texto":"La nonna ringraziò il cacciatore per il suo coraggio.","fonetica":"la ˈnonna rinɡraˈt͡sjo il katːt͡ʃaˈtoːre per il ˈsuːo korˈradːd͡ʒo"},
    "final_62": {"texto":"Cappuccetto Rosso promise di non allontanarsi mai più dal sentiero.","fonetica":"kapputˈt͡ʃɛtto ˈrosso proˈmiːze di ˈnon allontaˈnarsi ˈmai ˈpju dal senˈtjɛːro"},
    "final_63": {"texto":"Il cacciatore consigliò a entrambe di essere più attente.","fonetica":"il katːt͡ʃaˈtoːre konsiʎˈʎo a enˈtrambe di ˈɛssere ˈpju atˈtɛnte"},
    "final_64": {"texto":"Il lupo fu portato lontano dal bosco per non tornare.","fonetica":"il ˈluːpo ˈfu porˈtaːto lonˈtaːno dal ˈbosko per ˈnon torˈnaːre"},
    "final_65": {"texto":"La nonna servì tè caldo per tutti.","fonetica":"la ˈnonna serˈvi ˈtɛ ˈkaldo per ˈtutti"},
    "final_66": {"texto":"Cappuccetto Rosso raccontò l'avventura con emozione.","fonetica":"kapputˈt͡ʃɛtto ˈrosso rakːonˈto lavvenˈtuːra con emotˈt͡sjoːne"},
    "final_67": {"texto":"Il cacciatore ascoltò sorridendo e annuendo.","fonetica":"il katːt͡ʃaˈtoːre askolˈto sorriˈdendo e anːuˈendo"},
    "final_68": {"texto":"La nonna accarezzò la testa della nipote.","fonetica":"la ˈnonna akːaˈretːso la ˈtɛsta ˈdella niˈpoːte"},
    "final_69": {"texto":"Promisero di visitarsi più spesso.","fonetica":"proˈmiːsero di viˈzitarsi ˈpju ˈspɛsso"},
    "final_70": {"texto":"Il sole cominciò a calare sul bosco.","fonetica":"il ˈsoːle komintˈt͡ʃo a kaˈlaːre sul ˈbosko"},
    "final_71": {"texto":"Cappuccetto Rosso e il cacciatore intrapresero il viaggio di ritorno.","fonetica":"kapputˈt͡ʃɛtto ˈrosso e il katːt͡ʃaˈtoːre intrapˈreːsero il ˈvjadːd͡ʒo di riˈtorno"},
    "final_72": {"texto":"La bambina osservava i colori del tramonto.","fonetica":"la bamˈbiːna osːserˈvaːva i koˈloːri del traˈmonto"},
    "final_73": {"texto":"Ricordava le lezioni imparate quel giorno.","fonetica":"rikorˈdaːva le leˈt͡sjoːni imˈpaːrate ˈkwel ˈd͡ʒorno"},
    "final_74": {"texto":"Non si sarebbe mai più fidata degli sconosciuti nel bosco.","fonetica":"ˈnon si saˈrebbe ˈmai ˈpju fiˈdaːta deʎi skonoʃˈʃuːti nel ˈbosko"},
    "final_75": {"texto":"Sua madre l'aspettava ansiosa sulla porta di casa.","fonetica":"ˈsuːa ˈmaːdre laspetˈtaːva anˈsjoːza ˈsulla ˈporta di ˈkaːsa"},
    "final_76": {"texto":"Appena la vide, corse ad abbracciarla forte.","fonetica":"apˈpeːna la ˈviːde ˈkorse ad abːratˈt͡ʃarla ˈforte"},
    "final_77": {"texto":"Cappuccetto Rosso raccontò tutto l'accaduto nei dettagli.","fonetica":"kapputˈt͡ʃɛtto ˈrosso rakːonˈto ˈtutto lakːaˈduːto nei detˈtaʎʎi"},
    "final_78": {"texto":"La madre la complimentò per il suo coraggio.","fonetica":"la ˈmaːdre la komːpliˈmento per il ˈsuːo korˈradːd͡ʒo"},
    "final_79": {"texto":"Entrambe ringraziarono il cacciatore di cuore.","fonetica":"enˈtrambe rinɡraˈt͡sjaːrono il katːt͡ʃaˈtoːre di ˈkwoːre"},
    "final_80": {"texto":"Da quel giorno, Cappuccetto Rosso ricordò sempre di obbedire alla madre.","fonetica":"da ˈkwel ˈd͡ʒorno kapputˈt͡ʃɛtto ˈrosso riˈkordo ˈsɛmpre di obbeˈdiːre ˈalla ˈmaːdre"},
    "epilogo_81": {"texto":"Il cacciatore tornò alla sua capanna dopo aver accompagnato la bambina.","fonetica":"il katːt͡ʃaˈtoːre torˈno ˈalla ˈsuːa kaˈpanna ˈdopo ˈaver akːompaˈɲaːto la bamˈbiːna"},
    "epilogo_82": {"texto":"Pensava all'importanza di proteggere il bosco.","fonetica":"penˈsaːva allimporˈtant͡sa di protedˈd͡ʒere il ˈbosko"},
    "epilogo_83": {"texto":"La nonna riposava tranquilla nel suo letto.","fonetica":"la ˈnonna ripoˈzaːva traŋˈkwilla nel ˈsuːo ˈletto"},
    "epilogo_84": {"texto":"Ricordava lo spavento che aveva avuto.","fonetica":"rikorˈdaːva lo spavenˈto ke aˈveːva aˈvuːto"},
    "epilogo_85": {"texto":"Cappuccetto Rosso aiutò la madre a preparare la cena.","fonetica":"kapputˈt͡ʃɛtto ˈrosso ajuˈto la ˈmaːdre a prepaˈraːre la ˈt͡ʃeːna"},
    "epilogo_86": {"texto":"Mentre cucinavano, parlavano di quanto era successo.","fonetica":"ˈmentre kutːʃiˈnaːvano parˈlaːvano di ˈkwanto ˈɛːra sutˈt͡ʃɛsso"},
    "epilogo_87": {"texto":"La madre ricordò l'importanza dell'obbedienza.","fonetica":"la ˈmaːdre riˈkordo llimporˈtant͡sa dellobbeˈdjɛnt͡sa"},
    "epilogo_88": {"texto":"Cappuccetto Rosso promise di essere sempre prudente.","fonetica":"kapputˈt͡ʃɛtto ˈrosso proˈmiːze di ˈɛssere ˈsɛmpre pruˈdɛnte"},
    "epilogo_89": {"texto":"La notte scese con un cielo stellato.","fonetica":"la ˈnotte ˈʃeːze kon un ˈt͡ʃɛlo stelˈlaːto"},
    "epilogo_90": {"texto":"La famiglia cenò unita e felice.","fonetica":"la faˈmiʎʎa t͡ʃeˈno uˈniːta e feˈliːt͡ʃe"},
    "epilogo_91": {"texto":"Il bosco si fece silenzioso sotto la luna.","fonetica":"il ˈbosko si ˈfeːt͡ʃe silenˈt͡sjoːzo ˈsotto la ˈluːna"},
    "epilogo_92": {"texto":"Gli animali riposavano tranquilli.","fonetica":"ʎ aniˈmaːli ripoˈzaːvano traŋˈkwilli"},
    "epilogo_93": {"texto":"Il lupo, lontano, meditava sulla sua sconfitta.","fonetica":"il ˈluːpo lonˈtaːno mediˈtaːva ˈsulla ˈsuːa skonˈfitta"},
    "epilogo_94": {"texto":"Capì che la malvagità porta sempre conseguenze.","fonetica":"kaˈpi ke la malvaˈd͡ʒita ˈporta ˈsɛmpre konseˈɡwɛnt͡se"},
    "epilogo_95": {"texto":"Cappuccetto Rosso si addormentò con un sorriso di sollievo.","fonetica":"kapputˈt͡ʃɛtto ˈrosso si adːdorˈmento kon un sorˈriːzo di solˈljɛːvo"},
    "epilogo_96": {"texto":"Sognò giorni tranquilli nel bosco.","fonetica":"soɲˈɲo ˈd͡ʒorni traŋˈkwilli nel ˈbosko"},
    "epilogo_97": {"texto":"Sua madre la coprì con affetto.","fonetica":"ˈsuːa ˈmaːdre la koˈpri kon afˈfɛtto"},
    "epilogo_98": {"texto":"La nonna, da casa sua, pensava anche a loro.","fonetica":"la ˈnonna da ˈkaːsa ˈsuːa penˈsaːva ˈaːnke a ˈloːro"},
    "epilogo_99": {"texto":"Il cacciatore guardò le stelle prima di dormire.","fonetica":"il katːt͡ʃaˈtoːre ɡwarˈdo le ˈstelle ˈpriːma di dorˈmiːre"},
    "epilogo_100": {"texto":"Così terminò la giornata piena di insegnamenti per tutti.","fonetica":"koˈzi terˈmino la d͡ʒorˈnaːta ˈpieːna di inseɲɲaˈmenti per ˈtutti"},
    "epilogo_101": {"texto":"L'alba tinse d'oro gli alberi del bosco.","fonetica":"ˈlalba ˈtint͡se ˈdɔro ʎ ˈalberi del ˈbosko"},
    "epilogo_102": {"texto":"Gli uccelli iniziarono il loro canto mattutino.","fonetica":"ʎ utˈt͡ʃɛlli initˈt͡sjaːrono il ˈloːro ˈkanto matːuˈtiːno"},
    "epilogo_103": {"texto":"Cappuccetto Rosso si svegliò piena di energia.","fonetica":"kapputˈt͡ʃɛtto ˈrosso si zveʎˈʎo ˈpjeːna di enerˈd͡ʒiːa"},
    "epilogo_104": {"texto":"Ricordò con gratitudine il suo coraggioso amico cacciatore.","fonetica":"rikorˈdo kon ɡratiˈtuːdine il ˈsuːo koradˈd͡ʒoːzo aˈmiːko katːt͡ʃaˈtoːre"},
    "epilogo_105": {"texto":"Sua madre le preparò una colazione speciale.","fonetica":"ˈsuːa ˈmaːdre le prepaˈro ˈuːna kolatˈt͡sjoːne speˈt͡ʃaːle"},
    "epilogo_106": {"texto":"Mentre mangiavano, parlarono dei programmi per la giornata.","fonetica":"ˈmentre manˈd͡ʒaːvano parˈlaːrono dei proˈɡrammi per la d͡ʒorˈnaːta"},
    "epilogo_107": {"texto":"Decisero di visitare di nuovo la nonna tra qualche giorno.","fonetica":"deˈt͡ʃiːsero di viziˈtaːre di ˈnwɔvo la ˈnonna tra ˈkwalkwe ˈd͡ʒorno"},
    "epilogo_108": {"texto":"Volevano assicurarsi che tutto andasse bene.","fonetica":"voˈlevano asːiˈkurarsi ke ˈtutto anˈdasse ˈbɛːne"},
    "epilogo_109": {"texto":"La nonna, da parte sua, si godeva la calma.","fonetica":"la ˈnonna da ˈparte ˈsuːa si ˈɡoːdeva la ˈkalma"},
    "epilogo_110": {"texto":"Lavorava a maglia una sciarpa pensando alla nipote.","fonetica":"laˈvoːrava a ˈmaʎʎa ˈuːna ˈʃarpa penˈsando ˈalla niˈpoːte"},
    "epilogo_111": {"texto":"Il sole illuminava la capanna con una luce calda.","fonetica":"il ˈsoːle illumiˈnaːva la kaˈpanna kon ˈuːna ˈlut͡ʃe ˈkalda"},
    "epilogo_112": {"texto":"Il bosco respirava pace dopo l'avventura.","fonetica":"il ˈbosko respiˈraːva ˈpaːt͡ʃe ˈdopo lavvenˈtuːra"},
    "epilogo_113": {"texto":"Gli animali giocavano felici tra gli alberi.","fonetica":"ʎ aniˈmaːli d͡ʒoˈkaːvano feˈliːt͡ʃi tra ʎ ˈalberi"},
    "epilogo_114": {"texto":"Cappuccetto Rosso uscì in giardino a cogliere fiori.","fonetica":"kapputˈt͡ʃɛtto ˈrosso uʃˈʃi in d͡ʒarˈdiːno a ˈkoʎʎere ˈfjoːri"},
    "epilogo_115": {"texto":"Pensava a come la natura offra sempre bellezza.","fonetica":"penˈsaːva a ˈkoːme la naˈtuːra ˈɔffra ˈsɛmpre belˈletːsa"},
    "epilogo_116": {"texto":"Decise che ogni passeggiata sarebbe stata con cura e rispetto.","fonetica":"deˈt͡ʃiːze ke ˈoɲɲi pasːedˈd͡ʒaːta saˈrebbe ˈstaːta kon ˈkuːra e risˈpɛtto"},
    "epilogo_117": {"texto":"Sua madre sorrise nel vederla così riflessiva.","fonetica":"ˈsuːa ˈmaːdre sorˈriːze nel veˈderla koˈzi rifːleˈsiːva"},
    "epilogo_118": {"texto":"Entrambe sapevano che quel giorno aveva cambiato le loro vite.","fonetica":"enˈtrambe saˈpeːvano ke ˈkwel ˈd͡ʒorno aˈveːva kamˈbjaːto le ˈloːro ˈviːte"},
    "epilogo_119": {"texto":"Il ricordo dell'avventura rimase come una lezione eterna.","fonetica":"il riˈkordo dellavvenˈtuːra riˈmaːze ˈkoːme ˈuːna leˈt͡sjoːne eˈtɛrna"},
    "epilogo_120": {"texto":"E così termina la storia del coraggioso Cappuccetto Rosso.","fonetica":"e koˈzi ˈtermina la ˈstɔːria del koradˈd͡ʒoːzo kapputˈt͡ʃɛtto ˈrosso"}
  }