{
    "inicio_1": {"texto":"Era uma vez uma menina chamada Chapeuzinho Vermelho.","fonetica":"ˈɛɾɐ ˈũmɐ ˈvejz ˈũmɐ meˈnĩɲɐ ʃɐˈmezdɐ ʃɐpewˈziɲu veʁˈmeʎu"},
    "inicio_2": {"texto":"Ela morava numa pequena vila cercada pela floresta.","fonetica":"ˈɛlɐ moˈɾavɐ ˈnũmɐ peˈkẽnɐ ˈvilɐ seʁˈkadɐ ˈpelɐ floˈɾɛstɐ"},
    "inicio_3": {"texto":"Todos gostavam dela por sua bondade e alegria.","fonetica":"ˈtoðuʒ ɡoʃˈtavɐ̃w̃ ˈdɛlɐ puʁ ˈsuɐ bõˈdadʒi i aleˈɡɾiɐ"},
    "inicio_4": {"texto":"Um dia sua mãe pediu um importante favor a ela.","fonetica":"ˈũ ˈdʒiɐ ˈsuɐ ˈmɐ̃j̃ peˈdʒiw ˈũ j̃poʁˈtɐ̃tʃi faˈvoɾ ˈa ˈɛlɐ"},
    "inicio_5": {"texto":"Ela deveria levar uma cesta de comida para sua avó.","fonetica":"ˈɛlɐ deveˈɾiɐ leˈvaɾ ˈũmɐ ˈsɛstɐ dʒi koˈmidɐ ˈpaɾɐ ˈsuɐ aˈvɔ"},
    "inicio_6": {"texto":"A avó estava doente e precisava de cuidados.","fonetica":"ˈa aˈvɔ esˈtavɐ doˈẽtʃi i pɾesiˈzavɐ dʒi kwiˈdaduz"},
    "inicio_7": {"texto":"A mãe alertou a menina para não sair do caminho.","fonetica":"ˈa ˈmɐ̃j̃ aleʁˈtow ˈa meˈnĩnɐ ˈpaɾɐ ˈnɐ̃w̃ saˈiʁ du kaˈmiɲu"},
    "inicio_8": {"texto":"Também disse para não falar com estranhos.","fonetica":"tɐ̃ˈbẽj̃ ˈdʒisi ˈpaɾɐ ˈnɐ̃w̃ faˈlaʁ kõ esˈtɾɐɲus"},
    "inicio_9": {"texto":"Chapeuzinho prometeu obedecer às orientações da mãe.","fonetica":"ʃɐpewˈziɲu pɾomeˈtew obedeˈseɾ ˈaz oɾjẽˈtɐj̃sõj̃s ˈda ˈmɐ̃j̃"},
    "inicio_10": {"texto":"Pegou a cesta e começou seu caminho pela floresta.","fonetica":"peˈgow ˈa ˈsɛstɐ i koˈmeˈsow sew kaˈmiɲu ˈpelɐ floˈɾɛstɐ"},
    "camino_11": {"texto":"O sol brilhava e os pássaros cantavam entre as árvores.","fonetica":"ˈu ˈsɔw bɾiˈʎavɐ i us ˈpasɐɾus kɐ̃ˈtavɐ̃w̃ ˈẽtɾi ˈaz ˈaʁvoɾis"},
    "camino_12": {"texto":"A menina parou para admirar algumas flores vermelhas.","fonetica":"ˈa meˈnĩnɐ paˈɾow ˈpaɾɐ adʒmiˈɾaɾ awˈguɾɐs ˈfloɾis veʁˈmeʎɐs"},
    "camino_13": {"texto":"Lembrou das palavras da mãe e seguiu adiante.","fonetica":"lẽˈbɾow dɐs paˈlavɾɐs ˈda ˈmɐ̃j̃ i seˈɡiw adiˈɐ̃tʃi"},
    "camino_14": {"texto":"De repente ouviu um barulho atrás dos arbustos.","fonetica":"ˈdʒi ʁeˈpẽtʃi owˈviw ˈũ baˈɾuʎu aˈtɾajs duz aʁˈbustus"},
    "camino_15": {"texto":"Um lobo enorme apareceu no meio da trilha.","fonetica":"ˈũ ˈlobu eˈnoʁmi apaɾeˈsew nu ˈmeju ˈda ˈtɾiʎɐ"},
    "dialogo_16": {"texto":"O lobo a cumprimentou com um sorriso astuto.","fonetica":"ˈu ˈlobu ˈa kũpɾĩmẽˈtow kõ ˈũ soˈʁizu asˈtutu"},
    "dialogo_17": {"texto":"Bom dia, pequena, para onde você vai? perguntou.","fonetica":"ˈbõ ˈdʒiɐ peˈkẽnɐ ˈpaɾɐ ˈõdʒi voˈse ˈvaj peʁɡũˈtow"},
    "dialogo_18": {"texto":"Vou para casa da minha avó que mora do outro lado da floresta, respondeu.","fonetica":"ˈvow ˈpaɾɐ ˈkazɐ ˈda ˈmiɲɐ aˈvɔ ki ˈmɔɾɐ du ˈowtɾu ˈladu ˈda floˈɾɛstɐ ʁespõˈdew"},
    "dialogo_19": {"texto":"O lobo fingiu interesse e sorriu ainda mais.","fonetica":"ˈu ˈlobu fĩˈʒiw ĩteˈɾesi i soˈʁiw aˈĩdɐ ˈmajs"},
    "dialogo_20": {"texto":"Sugeriu que ela colhesse algumas flores para alegrar sua avó.","fonetica":"suʒeˈɾiw ki ˈɛlɐ koˈʎesi awˈguɾɐs ˈfloɾis ˈpaɾɐ aleˈɡɾaɾ ˈsuɐ aˈvɔ"},
    "dialogo_21": {"texto":"Chapeuzinho aceitou a ideia sem suspeitar de nada.","fonetica":"ʃɐpewˈziɲu asejˈtow ˈa jˈdɛjɐ ˈsẽj̃ suspejˈtaɾ dʒi ˈnadɐ"},
    "dialogo_22": {"texto":"Ela se abaixou para colher as flores mais bonitas.","fonetica":"ˈɛlɐ ˈsi abajˈʃow ˈpaɾɐ koˈʎeɾ ˈas ˈfloɾis ˈmajs boˈnitɐs"},
    "dialogo_23": {"texto":"Enquanto isso, o lobo bolou um plano rápido.","fonetica":"ẽˈkwɐ̃tu ˈisu ˈu ˈlobu boˈlow ˈũ ˈplɐ̃nu ˈʁapidʊ"},
    "dialogo_24": {"texto":"Correu por um atalho para chegar antes na casa da avó.","fonetica":"koˈʁew puɾ ˈũ aˈtaʎu ˈpaɾɐ ʃeˈɡaɾ ˈɐ̃tʃis ˈna ˈkazɐ ˈda aˈvɔ"},
    "dialogo_25": {"texto":"Bateu na porta suavemente.","fonetica":"baˈtew ˈna ˈpoʁtɐ suɐvẽˈmẽtʃi"},
    "dialogo_26": {"texto":"A avó perguntou quem era.","fonetica":"ˈa aˈvɔ peʁɡũˈtow ˈkẽj̃ ˈɛɾɐ"},
    "dialogo_27": {"texto":"O lobo imitou a voz da Chapeuzinho.","fonetica":"ˈu ˈlobu ĩmiˈtow ˈa ˈvɔjz ˈda ʃɐpewˈziɲu"},
    "dialogo_28": {"texto":"Sou eu, vovozinha, disse com doçura.","fonetica":"ˈsow ˈew vovoˈziɲɐ ˈdʒisi kõ doˈsuɾɐ"},
    "dialogo_29": {"texto":"A avó pediu que entrasse.","fonetica":"ˈa aˈvɔ peˈdʒiw ki ẽˈtɾasi"},
    "dialogo_30": {"texto":"O lobo entrou e fechou a porta rapidamente.","fonetica":"ˈu ˈlobu ẽˈtɾow i feˈʃow ˈa ˈpoʁtɐ ʁapidɐˈmẽtʃi"},
    "engaño_31": {"texto":"Ele atacou a avó e a trancou no armário.","fonetica":"ˈeli ataˈkow ˈa aˈvɔ i ˈa tɾɐ̃ˈkow nu aʁˈmaɾju"},
    "engaño_32": {"texto":"Depois colocou o roupão e os óculos dela.","fonetica":"deˈpojs koloˈkow ˈu ʁowˈpɐ̃w̃ i ˈuz ˈɔkuluz ˈdɛlɐ"},
    "engaño_33": {"texto":"Deitou-se na cama para esperar a Chapeuzinho.","fonetica":"dejˈtow si ˈna ˈkɐ̃mɐ ˈpaɾɐ espeˈɾaɾ ˈa ʃɐpewˈziɲu"},
    "camino_34": {"texto":"Enquanto isso, Chapeuzinho continuava colhendo flores.","fonetica":"ẽˈkwɐ̃tu ˈisu ʃɐpewˈziɲu kõtĩnuˈavɐ koˈʎẽdu ˈfloɾis"},
    "camino_35": {"texto":"Lembrou novamente do aviso da mãe.","fonetica":"lẽˈbɾow novaˈmẽtʃi du aˈvizʊ ˈda ˈmɐ̃j̃"},
    "camino_36": {"texto":"Percebeu que já estava ficando tarde.","fonetica":"peʁseˈbew ki ˈʒa esˈtavɐ fiˈkɐ̃du ˈtaʁdʒi"},
    "camino_37": {"texto":"Apressou o passo em direção à casa da avó.","fonetica":"apɾeˈsow ˈu ˈpasʊ ˈẽj̃ dʒiɾeˈsɐ̃w̃ ˈa ˈkazɐ ˈda aˈvɔ"},
    "encuentro_38": {"texto":"Ao chegar, notou a porta entreaberta.","fonetica":"ˈaw ʃeˈɡaʁ noˈtow ˈa ˈpoʁtɐ ẽtɾiaˈbɛʁtɐ"},
    "encuentro_39": {"texto":"A casa estava em silêncio e um pouco escura.","fonetica":"ˈa ˈkazɐ esˈtavɐ ˈẽj̃ siˈlẽsju i ˈũ ˈpowku esˈkuɾɐ"},
    "encuentro_40": {"texto":"Chapeuzinho entrou com cautela.","fonetica":"ʃɐpewˈziɲu ẽˈtɾow kõ kawˈtɛlɐ"},
    "dialogo_41": {"texto":"Ela se aproximou da cama da avó com curiosidade.","fonetica":"ˈɛlɐ ˈsi apɾoʃiˈmow ˈda ˈkɐ̃mɐ ˈda aˈvɔ kõ kuɾjosiˈdadʒi"},
    "dialogo_42": {"texto":"Viu a avó coberta até a cabeça.","fonetica":"ˈviw ˈa aˈvɔ koˈbɛɾtɐ aˈtɛ ˈa kaˈbesɐ"},
    "dialogo_43": {"texto":"Vovozinha, que olhos grandes você tem, disse Chapeuzinho.","fonetica":"vovoˈziɲɐ ki ˈoʎuz ˈɡɾɐ̃dʒiz voˈse ˈtẽj̃ ˈdʒisi ʃɐpewˈziɲu"},
    "dialogo_44": {"texto":"São para te ver melhor, respondeu o lobo disfarçado.","fonetica":"ˈsɐ̃w̃ ˈpaɾɐ ˈtʃi ˈveʁ meˈʎoʁ ʁespõˈdew ˈu ˈlobu dʒisfaʁˈsadu"},
    "dialogo_45": {"texto":"Vovozinha, que orelhas grandes você tem.","fonetica":"vovoˈziɲɐ ki oˈɾeʎɐz ˈɡɾɐ̃dʒiz voˈse ˈtẽj̃"},
    "dialogo_46": {"texto":"São para te ouvir melhor, respondeu o lobo.","fonetica":"ˈsɐ̃w̃ ˈpaɾɐ ˈtʃi owˈviʁ meˈʎoʁ ʁespõˈdew ˈu ˈlobu"},
    "dialogo_47": {"texto":"Vovozinha, que dentes afiados você tem.","fonetica":"vovoˈziɲɐ ki ˈdẽtʃiz afiˈaduz voˈse ˈtẽj̃"},
    "dialogo_48": {"texto":"São para te comer melhor, rugiu o lobo saltando da cama.","fonetica":"ˈsɐ̃w̃ ˈpaɾɐ ˈtʃi koˈmeʁ meˈʎoʁ ʁuˈʒiw ˈu ˈlobu sawˈtɐ̃du ˈda ˈkɐ̃mɐ"},
    "dialogo_49": {"texto":"Chapeuzinho gritou com todas as suas forças.","fonetica":"ʃɐpewˈziɲu ɡɾiˈtow kõ ˈtodɐz ˈas ˈsuɐs ˈfoʁsɐs"},
    "dialogo_50": {"texto":"Um caçador que passava por ali ouviu o grito.","fonetica":"ˈũ kɐsɐˈdoʁ ki paˈsavɐ puɾ aˈli owˈviw ˈu ˈɡɾitu"},
    "dialogo_51": {"texto":"Correu rapidamente para a casa.","fonetica":"koˈʁew ʁapidɐˈmẽtʃi ˈpaɾɐ ˈa ˈkazɐ"},
    "dialogo_52": {"texto":"Entrou e viu o lobo tentando pegar a menina.","fonetica":"ẽˈtɾow i ˈviw ˈu ˈlobu tẽˈtɐ̃du peˈɡaɾ ˈa meˈnĩnɐ"},
    "dialogo_53": {"texto":"O caçador apontou sua espingarda e gritou alto.","fonetica":"ˈu kɐsɐˈdoɾ apõˈtow ˈsuɐ espĩˈɡaʁdɐ i ɡɾiˈtow ˈawtu"},
    "dialogo_54": {"texto":"Pare, lobo malvado!","fonetica":"ˈpaɾi ˈlobu mawˈvadu"},
    "dialogo_55": {"texto":"O lobo se assustou e soltou a Chapeuzinho.","fonetica":"ˈu ˈlobu ˈsi asusˈtow i sowˈtow ˈa ʃɐpewˈziɲu"},
    "dialogo_56": {"texto":"O caçador conseguiu capturá-lo com uma rede.","fonetica":"ˈu kɐsɐˈdoɾ kõseˈɡiw kɐptuˈɾa lu kõ ˈũmɐ ˈʁɛdʒi"},
    "dialogo_57": {"texto":"Chapeuzinho abraçou o caçador agradecida.","fonetica":"ʃɐpewˈziɲu abɾaˈsow ˈu kɐsɐˈdoɾ aɡɾadeˈsidɐ"},
    "dialogo_58": {"texto":"Procuraram a avó e a encontraram sã no armário.","fonetica":"pɾokuˈɾaɾɐ̃w̃ ˈa aˈvɔ i ˈa ẽkõˈtɾaɾɐ̃w̃ ˈsɐ̃ nu aʁˈmaɾju"},
    "dialogo_59": {"texto":"A avó saiu aliviada e feliz.","fonetica":"ˈa aˈvɔ saˈjw aliˈvjadɐ i feˈlis"},
    "dialogo_60": {"texto":"Todos comemoraram que o perigo havia passado.","fonetica":"ˈtoðus komemoˈɾaɾɐ̃w̃ ki ˈu peˈɾiɡu aˈviɐ paˈsadu"},
    "final_61": {"texto":"A avó agradeceu ao caçador por sua coragem.","fonetica":"ˈa aˈvɔ aɡɾadeˈsew ˈaw kɐsɐˈdoʁ puʁ ˈsuɐ koˈɾaʒẽj̃"},
    "final_62": {"texto":"Chapeuzinho prometeu nunca mais sair do caminho.","fonetica":"ʃɐpewˈziɲu pɾomeˈtew ˈnũkɐ ˈmajs saˈiʁ du kaˈmiɲu"},
    "final_63": {"texto":"O caçador aconselhou ambas a serem mais cuidadosas.","fonetica":"ˈu kɐsɐˈdoɾ akõseˈʎow ˈɐ̃mbɐz ˈa ˈsɛɾẽj̃ ˈmajs kwiˈdɐdozɐs"},
    "final_64": {"texto":"O lobo foi levado para longe da floresta para não voltar.","fonetica":"ˈu ˈlobu ˈfoj leˈvadu ˈpaɾɐ ˈlõʒi ˈda floˈɾɛstɐ ˈpaɾɐ ˈnɐ̃w̃ vowˈtaʁ"},
    "final_65": {"texto":"A avó serviu chá quente para todos.","fonetica":"ˈa aˈvɔ seʁˈviw ˈʃa ˈkẽtʃi ˈpaɾɐ ˈtoðus"},
    "final_66": {"texto":"Chapeuzinho contou a aventura com emoção.","fonetica":"ʃɐpewˈziɲu kõˈtow ˈa ɐvẽˈtuɾɐ kõ emoˈsɐ̃w̃"},
    "final_67": {"texto":"O caçador ouviu sorrindo e concordando.","fonetica":"ˈu kɐsɐˈdoɾ owˈviw soˈʁĩdu i kõkoʁˈdɐ̃du"},
    "final_68": {"texto":"A avó acariciou a cabeça da neta.","fonetica":"ˈa aˈvɔ akaɾiˈsow ˈa kaˈbesɐ ˈda ˈnɛtɐ"},
    "final_69": {"texto":"Prometeram se visitar com mais frequência.","fonetica":"pɾomeˈteɾɐ̃w̃ si vizˈtaʁ kõ ˈmajs fɾeˈkwẽsjɐ"},
    "final_70": {"texto":"O sol começou a se pôr sobre a floresta.","fonetica":"ˈu ˈsɔw koˈmeˈsow ˈa si ˈpoʁ ˈsobrɐ ˈa floˈɾɛstɐ"},
    "final_71": {"texto":"Chapeuzinho e o caçador começaram a voltar.","fonetica":"ʃɐpewˈziɲu i ˈu kɐsɐˈdoʁ koˈmeˈsaɾɐ̃w̃ ˈa vowˈtaʁ"},
    "final_72": {"texto":"A menina observava as cores do pôr do sol.","fonetica":"ˈa meˈnĩnɐ obseʁˈvavɐ ˈas ˈkoɾiz du ˈpoʁ du ˈsɔw"},
    "final_73": {"texto":"Ela lembrava das lições aprendidas naquele dia.","fonetica":"ˈɛlɐ lẽˈbɾavɐ dɐs liˈsõj̃s apɾẽˈdidɐs naˈkeli ˈdʒiɐ"},
    "final_74": {"texto":"Nunca mais confiaria em estranhos da floresta.","fonetica":"ˈnũkɐ ˈmajs kõfjaˈɾiɐ ˈẽj̃ esˈtɾɐɲuz ˈda floˈɾɛstɐ"},
    "final_75": {"texto":"Sua mãe a esperava ansiosa na porta de casa.","fonetica":"ˈsuɐ ˈmɐ̃j̃ ˈa espeˈɾavɐ ɐ̃ˈsozɐ ˈna ˈpoʁtɐ dʒi ˈkazɐ"},
    "final_76": {"texto":"Ao vê-la, correu para abraçá-la com força.","fonetica":"ˈaw ˈve lɐ koˈʁew ˈpaɾɐ abɾaˈsa lɐ kõ ˈfoʁsɐ"},
    "final_77": {"texto":"Chapeuzinho contou tudo o que aconteceu em detalhes.","fonetica":"ʃɐpewˈziɲu kõˈtow ˈtudu ˈki akõteˈsew ˈẽj̃ deˈtaʎis"},
    "final_78": {"texto":"A mãe a parabenizou por sua coragem.","fonetica":"ˈa ˈmɐ̃j̃ ˈa paɾabẽˈnizow puʁ ˈsuɐ koˈɾaʒẽj̃"},
    "final_79": {"texto":"Ambas agradeceram de coração ao caçador.","fonetica":"ˈɐ̃mbɐz aɡɾadeˈseɾɐ̃w̃ dʒi koɾaˈsɐ̃w̃ ˈaw kɐsɐˈdoʁ"},
    "final_80": {"texto":"Desde aquele dia, Chapeuzinho sempre lembrou de obedecer à mãe.","fonetica":"ˈdɛzdʒi aˈkeli ˈdʒiɐ ʃɐpewˈziɲu ˈsẽpɾi lẽˈbɾow dʒi obedeˈseɾ ˈa ˈmɐ̃j̃"},
    "epilogo_81": {"texto":"O caçador voltou para sua cabana depois de acompanhar a menina.","fonetica":"ˈu kɐsɐˈdoʁ vowˈtow ˈpaɾɐ ˈsuɐ kaˈbɐ̃nɐ deˈpojz dʒi akõpɐˈɲaɾ ˈa meˈnĩnɐ"},
    "epilogo_82": {"texto":"Ele pensava na importância de proteger a floresta.","fonetica":"ˈeli pẽˈsavɐ ˈna ĩpoʁˈtɐ̃sjɐ dʒi pɾoteˈʒeɾ ˈa floˈɾɛstɐ"},
    "epilogo_83": {"texto":"A avó descansava tranquila em sua cama.","fonetica":"ˈa aˈvɔ deskɐ̃ˈsavɐ tɾɐ̃ˈkwilɐ ˈẽj̃ ˈsuɐ ˈkɐ̃mɐ"},
    "epilogo_84": {"texto":"Ela lembrava do susto que havia passado.","fonetica":"ˈɛlɐ lẽˈbɾavɐ du ˈsustu ki aˈviɐ paˈsadu"},
    "epilogo_85": {"texto":"Chapeuzinho ajudou sua mãe a preparar o jantar.","fonetica":"ʃɐpewˈziɲu aʒuˈdow ˈsuɐ ˈmɐ̃j̃ ˈa pɾepaˈɾaɾ ˈu ʒɐ̃ˈtaʁ"},
    "epilogo_86": {"texto":"Enquanto cozinhavam, conversavam sobre o acontecido.","fonetica":"ẽˈkwɐ̃tu kozĩˈɲavɐ̃w̃ kõveʁˈsavɐ̃w̃ ˈsobrɐ ˈu akõteˈsidu"},
    "epilogo_87": {"texto":"A mãe lembrou a importância da obediência.","fonetica":"ˈa ˈmɐ̃j̃ lẽˈbɾow ˈa ĩpoʁˈtɐ̃sjɐ ˈda obeˈdjẽsjɐ"},
    "epilogo_88": {"texto":"Chapeuzinho prometeu ser sempre prudente.","fonetica":"ʃɐpewˈziɲu pɾomeˈtew ˈseʁ ˈsẽpɾi pɾuˈdẽtʃi"},
    "epilogo_89": {"texto":"A noite chegou com um céu estrelado.","fonetica":"ˈa ˈnojtʃi ʃeˈgow kõ ˈũ ˈsɛw estɾeˈladʊ"},
    "epilogo_90": {"texto":"A família jantou unida e feliz.","fonetica":"ˈa faˈmiljɐ ʒɐ̃ˈtow uˈnidɐ i feˈlis"},
    "epilogo_91": {"texto":"A floresta ficou em silêncio sob a lua.","fonetica":"ˈa floˈɾɛstɐ fiˈkow ˈẽj̃ siˈlẽsju ˈsob ˈa ˈluɐ"},
    "epilogo_92": {"texto":"Os animais descansavam tranquilos.","fonetica":"ˈuz ɐniˈmajs deskɐ̃ˈsavɐ̃w̃ tɾɐ̃ˈkwilus"},
    "epilogo_93": {"texto":"O lobo, longe, refletia sobre sua derrota.","fonetica":"ˈu ˈlobu ˈlõʒi ʁefleˈtʃiɐ ˈsobrɐ ˈsuɐ deˈʁotɐ"},
    "epilogo_94": {"texto":"Ele entendeu que a maldade sempre traz consequências.","fonetica":"ˈeli ẽˈtẽdew ki ˈa mawˈdadʒi ˈsẽpɾi ˈtɾajs kõseˈkwẽsjɐs"},
    "epilogo_95": {"texto":"Chapeuzinho adormeceu com um sorriso de alívio.","fonetica":"ʃɐpewˈziɲu adoʁmeˈsew kõ ˈũ soˈʁizu dʒi aˈlivju"},
    "epilogo_96": {"texto":"Ela sonhou com dias tranquilos na floresta.","fonetica":"ˈɛlɐ soˈɲow kõ ˈdʒiɐs tɾɐ̃ˈkwilus ˈna floˈɾɛstɐ"},
    "epilogo_97": {"texto":"Sua mãe a cobriu com carinho.","fonetica":"ˈsuɐ ˈmɐ̃j̃ ˈa koˈbɾiw kõ kaˈɾiɲu"},
    "epilogo_98": {"texto":"A avó, de sua casa, também pensava nelas.","fonetica":"ˈa aˈvɔ dʒi ˈsuɐ ˈkazɐ tɐ̃ˈbẽj̃ pẽˈsavɐ ˈnɛlɐs"},
    "epilogo_99": {"texto":"O caçador olhou as estrelas antes de dormir.","fonetica":"ˈu kɐsɐˈdoɾ oˈʎow ˈas esˈtɾɛlɐz ˈɐ̃tʃiz dʒi doʁˈmiʁ"},
    "epilogo_100": {"texto":"Assim terminou o dia cheio de aprendizados para todos.","fonetica":"aˈsĩ teʁmiˈnow ˈu ˈdʒiɐ ˈʃejʊ dʒi apɾẽdiˈzaduz ˈpaɾɐ ˈtoðus"},
    "epilogo_101": {"texto":"O amanhecer pintou de ouro as árvores da floresta.","fonetica":"ˈu ɐmɐ̃ˈɲeseʁ pĩˈtow dʒi ˈowtɾu ˈaz ˈaʁvoɾiz ˈda floˈɾɛstɐ"},
    "epilogo_102": {"texto":"Os pássaros começaram seu canto matinal.","fonetica":"ˈus ˈpasɐɾus koˈmeˈsaɾɐ̃w̃ sew ˈkɐ̃tu mɐtʃiˈnaw"},
    "epilogo_103": {"texto":"Chapeuzinho acordou cheia de energia.","fonetica":"ʃɐpewˈziɲu akoʁˈdow ˈʃejɐ dʒi eneʁˈʒiɐ"},
    "epilogo_104": {"texto":"Ela lembrou com gratidão de seu corajoso amigo caçador.","fonetica":"ˈɛlɐ lẽˈbɾow kõ ɡɾɐtʃiˈdɐ̃w̃ dʒi sew koɾɐˈʒozu aˈmiɡu kɐsɐˈdoʁ"},
    "epilogo_105": {"texto":"Sua mãe preparou um café da manhã especial.","fonetica":"ˈsuɐ ˈmɐ̃j̃ pɾepaˈɾow ˈũ kaˈfɛ ˈda mɐˈɲɐ̃w̃ espeˈsjaw"},
    "epilogo_106": {"texto":"Enquanto comiam, conversaram sobre os planos para o dia.","fonetica":"ẽˈkwɐ̃tu koˈmiɐ̃w̃ kõveʁˈsaɾɐ̃w̃ ˈsobrɐ us ˈplɐ̃nus ˈpaɾɐ ˈu ˈdʒiɐ"},
    "epilogo_107": {"texto":"Decidiram visitar a avó novamente em alguns dias.","fonetica":"desiˈdʒiɾɐ̃w̃ vizˈtaɾ ˈa aˈvɔ novaˈmẽtʃi ˈẽj̃ awˈguɐs ˈdʒiɐs"},
    "epilogo_108": {"texto":"Queriam se certificar de que tudo estivesse bem.","fonetica":"keˈɾiɐ̃w̃ si seʁtifiˈkaɾ dʒi ki ˈtudu esˈtʃivɛsi ˈbẽj̃"},
    "epilogo_109": {"texto":"A avó, por sua vez, aproveitava a calma.","fonetica":"ˈa aˈvɔ puʁ ˈsuɐ ˈvejz apɾovejˈtavɐ ˈa ˈkawmɐ"},
    "epilogo_110": {"texto":"Ela tricotava um cachecol enquanto pensava na neta.","fonetica":"ˈɛlɐ tɾikoˈtavɐ ˈũ kaˈʃekɔw ẽˈkwɐ̃tu pẽˈsavɐ ˈna ˈnɛtɐ"},
    "epilogo_111": {"texto":"O sol iluminava a cabana com luz quente.","fonetica":"ˈu ˈsɔw ilumiˈnavɐ ˈa kaˈbɐ̃nɐ kõ ˈluʃ ˈkẽtʃi"},
    "epilogo_112": {"texto":"A floresta respirava paz depois da aventura.","fonetica":"ˈa floˈɾɛstɐ ʁespiˈɾavɐ ˈpas deˈpojz ˈda ɐvẽˈtuɾɐ"},
    "epilogo_113": {"texto":"Os animais brincavam felizes entre as árvores.","fonetica":"ˈuz ɐniˈmajs bɾĩˈkavɐ̃w̃ feˈliziz ˈẽtɾi ˈaz ˈaʁvoɾis"},
    "epilogo_114": {"texto":"Chapeuzinho saiu ao jardim para colher flores.","fonetica":"ʃɐpewˈziɲu saˈjw ˈaw ʒaʁˈdʒĩ ˈpaɾɐ koˈʎeʁ ˈfloɾis"},
    "epilogo_115": {"texto":"Ela pensava em como a natureza sempre oferece beleza.","fonetica":"ˈɛlɐ pẽˈsavɐ ˈẽj̃ ˈkomu ˈa nɐtuˈɾezɐ ˈsẽpɾi ofeˈɾesi beˈlezɐ"},
    "epilogo_116": {"texto":"Decidiu que cada passeio seria com cuidado e respeito.","fonetica":"desiˈdʒiw ki ˈkɐdɐ paˈseju seˈɾiɐ kõ kwiˈdadʊ i ʁesˈpejtu"},
    "epilogo_117": {"texto":"Sua mãe sorriu ao vê-la tão pensativa.","fonetica":"ˈsuɐ ˈmɐ̃j̃ soˈʁiw ˈaw ˈve lɐ ˈtɐ̃w̃ pẽsɐˈtʃivɐ"},
    "epilogo_118": {"texto":"Ambas sabiam que aquele dia mudou suas vidas.","fonetica":"ˈɐ̃mbɐs saˈbiɐ̃w̃ ki aˈkeli ˈdʒiɐ muˈdow ˈsuɐs ˈvivɐs"},
    "epilogo_119": {"texto":"A lembrança da aventura ficou como uma lição eterna.","fonetica":"ˈa lẽˈbɾɐ̃sɐ ˈda ɐvẽˈtuɾɐ fiˈkow ˈkomu ˈũmɐ liˈsɐ̃w̃ eˈtɛʁnɐ"},
    "epilogo_120": {"texto":"E assim termina a história da corajosa Chapeuzinho Vermelho.","fonetica":"ˈi aˈsĩ teʁˈminɐ ˈa isˈtɔɾjɐ ˈda koɾɐˈʒozɐ ʃɐpewˈziɲu veʁˈmeʎu"}
  }