{
    "feria_titulo": { "texto": "The Great Persuasion Fair", "fonetica": "ðə ɡreɪt pərˈsweɪʒən fɛr" },
    "feria_inicio": { "texto": "Today the town is holding the Great Persuasion Fair.", "fonetica": "təˈdeɪ ðə taʊn ɪz ˈhoʊldɪŋ ðə ɡreɪt pərˈsweɪʒən fɛr" },
    "feria_ambiente": { "texto": "Everyone wants to sell, persuade, or win something.", "fonetica": "ˈɛvriˌwʌn wɑnts tə sɛl pərˈsweɪd ɔr wɪn ˈsʌmθɪŋ" },
    "feria_expectativa": { "texto": "And nobody is ready for what is coming.", "fonetica": "ænd ˈnoʊbɑdi ɪz ˈrɛdi fɔr wʌt ɪz ˈkʌmɪŋ" },
    "don_paco_pide_favor": { "texto": "Don Paco asks his neighbor for a little favor.", "fonetica": "dɔn ˈpɑko æsks hɪz ˈneɪbər fɔr ə ˈlɪtəl ˈfeɪvər" },
    "don_paco_escoba": { "texto": "Neighbor, can I borrow your broom for a moment", "fonetica": "ˈneɪbər kæn aɪ ˈbɑroʊ jʊr brum fɔr ə ˈmoʊmənt" },
    "vecina_acepta": { "texto": "She says yes", "fonetica": "ʃi sɛz jɛs" },
    "don_paco_curioso": { "texto": "Later, Don Paco notices something odd.", "fonetica": "ˈleɪtər dɔn ˈpɑko ˈnoʊtəsɪz ˈsʌmθɪŋ ɑd" },
    "vecina_amable": { "texto": "After that small favor, the neighbor treats him more kindly.", "fonetica": "ˈæftər ðæt smɔl ˈfeɪvər ðə ˈneɪbər trits hɪm mɔr ˈkaɪndli" },
    "explicacion_ben_franklin": { "texto": "The Ben Franklin effect says that when someone does you a favor, they tend to like you more afterwards.", "fonetica": "ðə bɛn ˈfræŋklɪn ɪˈfɛkt sɛz ðət wɛn ˈsʌmˌwʌn dʌz ju ə ˈfeɪvər ðeɪ tɛnd tə laɪk ju mɔr ˈæftərwərdz" },
    "ben_franklin_razon": { "texto": "The brain reasons: If I helped them, I must like them.", "fonetica": "ðə breɪn ˈrizənz ɪf aɪ hɛlpt ðɛm aɪ məst laɪk ðɛm" },
    "nino_galletas": { "texto": "A kid selling cookies approaches with a smile.", "fonetica": "ə kɪd ˈsɛlɪŋ ˈkʊkiz əˈproʊtʃɪz wɪð ə smaɪl" },
    "nino_ofrece_galleta": { "texto": "Want to try a free cookie", "fonetica": "wɑnt tə traɪ ə fri ˈkʊki" },
    "adulto_prueba": { "texto": "After trying it, the adult smiles.", "fonetica": "ˈæftər ˈtraɪɪŋ ɪt ði əˈdʌlt smaɪlz" },
    "nino_vende_caja": { "texto": "Take the whole box, they're delicious", "fonetica": "teɪk ðə hoʊl bɑks ðer ɑr dɪˈlɪʃəs" },
    "explicacion_pie_puerta": { "texto": "The foot in the door technique asks for something small first.", "fonetica": "ðə fʊt ɪn ðə dɔr tɛkˈnik æsks fɔr ˈsʌmθɪŋ smɔl fɜrst" },
    "pie_puerta_efecto": { "texto": "Once you say yes to the small ask, it's easier to agree to a bigger one later.", "fonetica": "wʌns ju seɪ jɛs tə ðə smɔl æsk ɪts ˈizjər tə əˈgri tə ə ˈbɪɡər wʌn ˈleɪtər" },
    "precio_anuncio": { "texto": "A shop advertises: Before one million, now only three hundred thousand", "fonetica": "ə ʃɑp ˈædvərˌtaɪzɪz bɪˈfɔr wʌn ˈmɪljən naʊ ˈoʊnli θri ˈhʌndrəd ˈθaʊzənd" },
    "gente_compra": { "texto": "People rush to buy", "fonetica": "ˈpipəl rʌʃ tə baɪ" },
    "explicacion_anclaje": { "texto": "The anchoring bias makes the first number we hear stick in our minds.", "fonetica": "ði ˈæŋkərɪŋ ˈbaɪəs meɪks ðə fɜrst ˈnʌmbər wi hɪr stɪk ɪn aʊər maɪndz" },
    "anclaje_percepcion": { "texto": "So the new price seems cheap, even if it's not that much of a bargain.", "fonetica": "soʊ ðə nu praɪs simz ʧip ˈivɪn ɪf ɪts nɑt ðæt mʌʧ əv ə ˈbɑrɡən" },
    "negociacion_silencio": { "texto": "On another corner, two people are negotiating.", "fonetica": "ɑn əˈnʌðər ˈkɔrnər tu ˈpipəl ɑr nɪˈɡoʊʃieɪtɪŋ" },
    "uno_habla_mucho": { "texto": "One talks nonstop.", "fonetica": "wʌn tɔks ˈnɑnˌstɑp" },
    "otro_sonrie": { "texto": "The other just looks and smiles silently.", "fonetica": "ði ˈʌðər ʤəst lʊks ənd smaɪlz ˈsaɪləntli" },
    "hablador_nervioso": { "texto": "The talker gets nervous and ends up lowering the price.", "fonetica": "ðə ˈtɔkər ɡɛts ˈnɜrvəs ənd ɛndz ʌp ˈloʊərɪŋ ðə praɪs" },
    "explicacion_silencio": { "texto": "The power of silence is real, sometimes the quiet person wins the negotiation.", "fonetica": "ðə ˈpaʊər əv ˈsaɪləns ɪz ril ˈsʌmˌtaɪmz ðə ˈkwaɪət ˈpɜrsən wɪnz ðə nɪˌɡoʊʃiˈeɪʃən" },
    "maria_cliente": { "texto": "Maria notices her customer crossing his arms.", "fonetica": "məˈriə ˈnoʊtəsɪz hɜr ˈkʌstəmər ˈkrɔsɪŋ hɪz ɑrmz" },
    "maria_imita": { "texto": "She crosses her arms too.", "fonetica": "ʃi ˈkrɔsɪz hɜr ɑrmz tu" },
    "cliente_sonrie": { "texto": "The customer smiles and feels in sync.", "fonetica": "ðə ˈkʌstəmər smaɪlz ənd filz ɪn sɪŋk" },
    "explicacion_espejo": { "texto": "The mirroring effect happens when we subtly copy someone’s posture or gestures.", "fonetica": "ðə ˈmɪrərɪŋ ɪˈfɛkt ˈhæpənz wɛn wi ˈsʌtəli ˈkɑpi ˈsʌmwʌnz ˈpɑstʃər ɔr ˈʤɛstʃərz" },
    "espejo_confianza": { "texto": "That builds empathy and trust.", "fonetica": "ðæt bɪldz ˈɛmpəθi ənd trʌst" },
    "cancion_suena": { "texto": "The same song plays all over the fair again and again.", "fonetica": "ðə seɪm sɔŋ pleɪz ɔl ˈoʊvər ðə fɛr əˈgɛn ənd əˈgɛn" },
    "gente_canta": { "texto": "By the end of the day, everyone is humming along happily.", "fonetica": "baɪ ði ɛnd əv ðə deɪ ˈɛvriˌwʌn ɪz ˈhʌmɪŋ əˈlɔŋ ˈhæpɪli" },
    "explicacion_exposicion": { "texto": "The mere exposure effect says the more we see or hear something, the more we tend to like it.", "fonetica": "ðə mɪr ɪkˈspoʊʒər ɪˈfɛkt sɛz ðə mɔr wi si ɔr hɪr ˈsʌmθɪŋ ðə mɔr wi tɛnd tə laɪk ɪt" },
    "repeticion_publicidad": { "texto": "That's why ads keep repeating.", "fonetica": "ðæts waɪ ædz kip rɪˈpitɪŋ" },
    "frutas_saludo": { "texto": "The fruit seller calls out, Good morning Doña Rosa", "fonetica": "ðə frut ˈsɛlər kɔlz aʊt ɡʊd ˈmɔrnɪŋ ˈdoʊnjə ˈrosa" },
    "dona_rosa_sonrie": { "texto": "She smiles and buys twice as much.", "fonetica": "ʃi smaɪlz ənd baɪz twaɪs əz mʌʧ" },
    "explicacion_nombre": { "texto": "Hearing your own name feels good and quickly creates closeness.", "fonetica": "ˈhɪrɪŋ jʊr oʊn neɪm filz ɡʊd ənd ˈkwɪkli kriˈeɪts ˈkloʊsnəs" },
    "buffet_postres": { "texto": "At the dessert stall there are forty flavors.", "fonetica": "æt ðə dɪˈzɜrt stɔl ðɛr ɑr ˈfɔrti ˈfleɪvərz" },
    "nadie_elige": { "texto": "Everyone stares at the menu…and nobody chooses.", "fonetica": "ˈɛvriˌwʌn stɛrz æt ðə ˈmɛnju ənd ˈnoʊbədi ˈʧuzɪz" },
    "explicacion_eleccion": { "texto": "The paradox of choice shows that too many options can make us decide worse or not at all.", "fonetica": "ðə ˈpærədɑks əv ʧɔɪs ʃoʊz ðæt tu ˈmɛni ˈɑpʃənz kən meɪk ʌs dɪˈsaɪd wɜrs ɔr nɑt æt ɔl" },
    "paralisis_analisis": { "texto": "The brain goes into analysis paralysis.", "fonetica": "ðə breɪn ɡoʊz ˈɪntu əˈnæləsɪs pəˈræləsɪs" },
    "noticiero_tiburon": { "texto": "The announcer shouts, A shark attacked a tourist", "fonetica": "ði əˈnaʊnsər ʃaʊts ə ʃɑrk əˈtækt ə ˈtʊrɪst" },
    "gente_miedo": { "texto": "That night no one goes into the sea.", "fonetica": "ðæt naɪt noʊ wʌn ɡoʊz ˈɪntu ðə si" },
    "explicacion_disponibilidad": { "texto": "The availability heuristic makes us overestimate what we easily recall.", "fonetica": "ði əˌveɪləˈbɪlɪti daɪˈrɪstɪk meɪks ʌs ˌoʊvərˈɛstəˌmeɪt wʌt wi ˈizəli rɪˈkɔl" },
    "efecto_manada": { "texto": "A group yells that the burgers are the best", "fonetica": "ə ɡrup jɛlz ðæt ðə ˈbɜrgərz ɑr ðə bɛst" },
    "todos_fila": { "texto": "In seconds, a line forms.", "fonetica": "ɪn ˈsɛkəndz ə laɪn fɔrmz" },
    "explicacion_bandwagon": { "texto": "The bandwagon effect, or herd effect, happens when we copy what most people do.", "fonetica": "ðə ˈbændˌwæɡən ɪˈfɛkt ɔr hɜrd ɪˈfɛkt ˈhæpənz wɛn wi ˈkɑpi wʌt moʊst ˈpipəl du" },
    "bandwagon_creencia": { "texto": "We assume that if everyone does it, it must be good.", "fonetica": "wi əˈsum ðət ɪf ˈɛvriˌwʌn dʌz ɪt ɪt məst bi ɡʊd" },
    "cirujano_historia": { "texto": "A surgeon goes in to operate on his son but says I can't I am his parent", "fonetica": "ə ˈsɜrʤən ɡoʊz ɪn tə ˈɑpəˌreɪt ɑn hɪz sʌn bət seɪz aɪ kænt aɪ əm hɪz ˈpɛrənt" },
    "clase_confundida": { "texto": "The class is puzzled, How can that be two dads", "fonetica": "ðə klæs ɪz ˈpʌzəld haʊ kæn ðæt bi tu dædz" },
    "revelacion_madre": { "texto": "Until someone shouts, The surgeon is his mother", "fonetica": "ənˈtɪl ˈsʌmwʌn ʃaʊts ðə ˈsɜrʤən ɪz hɪz ˈmʌðər" },
    "explicacion_cirujano": { "texto": "The surgeon bias shows how stereotypes shape our perception.", "fonetica": "ðə ˈsɜrʤən ˈbaɪəs ʃoʊz haʊ ˈstɛriəˌtaɪps ʃeɪp aʊər pərˈsɛpʃən" },
    "moraleja_final": { "texto": "Everyone learned something: negotiating is not just about talking, it's about listening, watching, and understanding how the mind works.", "fonetica": "ˈɛvriˌwʌn lɜrnd ˈsʌmθɪŋ nɪˌɡoʊʃiˈeɪtɪŋ ɪz nɑt ʤʌst əˈbaʊt ˈtɔkɪŋ ɪts əˈbaʊt ˈlɪsənɪŋ ˈwɑʧɪŋ ənd ˌʌndərˈstændɪŋ haʊ ðə maɪnd wɜrks" }
  }
  