    {
      "feria_titulo": { "texto": "La Gran Feria de la Persuasión", "fonetica": "la ɡɾan ˈfeɾja ðe la peɾswaˈsjon" },
      "feria_inicio": { "texto": "Hoy en el pueblo se celebra la Gran Feria de la Persuasión.", "fonetica": "oj en el ˈpweβlo se seˈleβɾa la ˈɡɾan ˈfeɾja ðe la peɾswaˈsjon" },
      "feria_ambiente": { "texto": "Todo el mundo quiere vender, convencer o ganar algo.", "fonetica": "ˈtoðo el ˈmundo ˈkjeɾe benˈdeɾ kombenˈseɾ o ɡaˈnaɾ ˈalɣo" },
      "feria_expectativa": { "texto": "Y nadie está preparado para lo que viene.", "fonetica": "i ˈnaðje esˈta pɾepaˈɾaðo paɾa lo ke ˈbjene" },
      "don_paco_pide_favor": { "texto": "Don Paco le pide a su vecina un favorcito.", "fonetica": "don ˈpako le ˈpiðe a su βeˈsina un faβoɾˈsito" },
      "don_paco_escoba": { "texto": "Vecina, me presta su escoba un momentico.", "fonetica": "βeˈsina me ˈpɾesta su esˈkoβa un momenˈtiko" },
      "vecina_acepta": { "texto": "Ella acepta.", "fonetica": "ˈeʝa aˈsepta" },
      "don_paco_curioso": { "texto": "Luego, Don Paco nota algo curioso.", "fonetica": "ˈlweɣo don ˈpako ˈnota ˈalɣo kuˈɾjoso" },
      "vecina_amable": { "texto": "Después del pequeño favor, la vecina lo trata mejor.", "fonetica": "desˈpwes ðel peˈkeɲo faˈβoɾ la βeˈsina lo ˈtɾata meˈxoɾ" },
      "explicacion_ben_franklin": { "texto": "El Efecto Ben Franklin dice que cuando alguien te hace un favor, empieza a gustarle más ayudarte otra vez.", "fonetica": "el eˈfekto ben ˈfɾanklin ˈðise ke ˈkwando ˈalɣjen te ˈase un faˈβoɾ emˈpjesa a ɣusˈtaɾle mas aʝuˈðaɾte oˈtɾa βes" },
      "ben_franklin_razon": { "texto": "Porque el cerebro piensa: si le ayudé, debe caerme bien.", "fonetica": "ˈpoɾke el seˈɾeβɾo ˈpjensa si le aʝuˈðe ˈdeβe kaˈeɾme ˈbjen" },
      "nino_galletas": { "texto": "Un niño vendedor se acerca con una sonrisa.", "fonetica": "un ˈniɲo βendeˈðoɾ se aˈseɾka kon una sonˈɾisa" },
      "nino_ofrece_galleta": { "texto": "Quiere probar una galletita gratis.", "fonetica": "ˈkjeɾe pɾoˈβaɾ ˈuna ɣaʝeˈtita ˈɣɾatis" },
      "adulto_prueba": { "texto": "El adulto prueba y sonríe.", "fonetica": "el aˈðulto ˈpɾweβa i sonˈɾi.e" },
      "nino_vende_caja": { "texto": "Llévese la caja completa, están deliciosas.", "fonetica": "ˈʝeβese la ˈkaxa komˈpleta esˈtan ðeʎiˈsjosas" },
      "explicacion_pie_puerta": { "texto": "La técnica del pie en la puerta consiste en pedir primero algo pequeño.", "fonetica": "la ˈtek.nika ðel pje en la ˈpweɾ.ta konˈsiste en peˈðiɾ pɾiˈmeɾo ˈalɣo peˈkeɲo" },
      "pie_puerta_efecto": { "texto": "Cuando aceptas lo pequeño, es más fácil decir que sí a algo grande después.", "fonetica": "ˈkwando aˈseptas lo peˈkeɲo es mas ˈfasjl ðeˈsiɾ ke si a ˈalɣo ˈɡɾande desˈpwes" },
      "precio_anuncio": { "texto": "Una tienda anuncia antes un millón, ahora solo trescientos mil.", "fonetica": "ˈuna ˈtjenda aˈnunsja ˈantes un miˈʝon aˈoɾa ˈsolo tɾesˈsjentos mil" },
      "gente_compra": { "texto": "Todos corren a comprar.", "fonetica": "ˈtoðos ˈkoren a komˈpɾaɾ" },
      "explicacion_anclaje": { "texto": "El sesgo de anclaje hace que el primer número que vemos se quede pegado en la mente.", "fonetica": "el ˈsesɣo ðe aŋˈklaxe ˈase ke el pɾiˈmeɾ ˈnumeɾo ke ˈβemos se ˈkeðe peˈɣaðo en la ˈmente" },
      "anclaje_percepcion": { "texto": "Así el nuevo precio parece barato, aunque no lo sea tanto.", "fonetica": "aˈsi el ˈnweβo ˈpɾesjo paˈɾese βaˈɾato aŋke no lo ˈsea ˈtanto" },
      "negociacion_silencio": { "texto": "Dos personas negocian en una esquina.", "fonetica": "dos peɾˈsonas neɣoˈsj.an en ˈuna esˈkina" },
      "uno_habla_mucho": { "texto": "Uno habla sin parar.", "fonetica": "ˈuno ˈaβla sim paˈɾaɾ" },
      "otro_sonrie": { "texto": "El otro solo mira y sonríe en silencio.", "fonetica": "el ˈotɾo ˈsolo ˈmiɾa i sonˈɾi.e en siˈlensjo" },
      "hablador_nervioso": { "texto": "El hablador se pone nervioso y baja el precio.", "fonetica": "el aβlaˈðoɾ se ˈpone neɾˈβjoso i ˈβaxa el ˈpɾesjo" },
      "explicacion_silencio": { "texto": "El poder del silencio es real, a veces quien calla gana la negociación.", "fonetica": "el poˈðeɾ ðel siˈlensjo es reˈal a ˈβeses kj.en ˈkaʝa ˈɡana la neɣosjaˈsjon" },
      "maria_cliente": { "texto": "María nota que su cliente cruza los brazos.", "fonetica": "maˈɾi.a ˈnota ke su kljenˈte ˈkɾusa los ˈβɾasos" },
      "maria_imita": { "texto": "Ella cruza los brazos también.", "fonetica": "ˈeʝa ˈkɾusa los ˈβɾasos tamˈbjen" },
      "cliente_sonrie": { "texto": "El cliente sonríe y se siente en sintonía.", "fonetica": "el kljenˈte sonˈɾi.e i se ˈsjente en sin.toˈni.a" },
      "explicacion_espejo": { "texto": "El efecto espejo ocurre cuando imitamos sutilmente los gestos de otro.", "fonetica": "el eˈfekto esˈpexo oˈkuɾe ˈkwando imiˈtamos suˈtilmente los ˈxestos ðe ˈotɾo" },
      "espejo_confianza": { "texto": "Eso genera empatía y confianza.", "fonetica": "ˈeso xeˈneɾa empaˈti.a i konˈfjansa" },
      "cancion_suena": { "texto": "En toda la feria suena la misma canción muchas veces.", "fonetica": "en ˈtoða la ˈfeɾja ˈswena la ˈmisma kanˈsjon ˈmutʃas ˈβeses" },
      "gente_canta": { "texto": "Al final del día, todos la cantan felices.", "fonetica": "al fiˈnal ðel ˈdi.a ˈtoðos la ˈkantan feˈlises" },
      "explicacion_exposicion": { "texto": "El efecto de mera exposición dice que mientras más vemos o escuchamos algo, más nos gusta.", "fonetica": "el eˈfekto ðe ˈmeɾa eksposiˈsjon ˈðise ke ˈmjentɾas mas ˈβemos o eskuˈtʃamos ˈalɣo mas nos ˈɣusta" },
      "repeticion_publicidad": { "texto": "Por eso la publicidad repite tanto.", "fonetica": "poɾ ˈeso la puβlisiˈðað reˈpite ˈtanto" },
      "frutas_saludo": { "texto": "El joven del puesto de frutas grita saludando a Doña Rosa.", "fonetica": "el ˈxoβen ðel ˈpwesto ðe ˈfɾw.tas ˈɡɾita saluˈðando a ˈdoɲa ˈrosa" },
      "dona_rosa_sonrie": { "texto": "Ella sonríe y compra el doble.", "fonetica": "ˈeʝa sonˈɾi.e i ˈkompɾa el ˈdoβle" },
      "explicacion_nombre": { "texto": "A la gente le encanta oír su propio nombre, activa placer en el cerebro y crea cercanía.", "fonetica": "a la ˈxente le enˈkanta oˈiɾ su ˈpɾopjo ˈnom.bɾe akˈtiβa plaˈseɾ en el seˈɾeβɾo i ˈkɾea seɾkaˈni.a" },
      "buffet_postres": { "texto": "En el puesto de postres hay cuarenta sabores.", "fonetica": "en el ˈpwesto ðe ˈpostɾes aj kwaˈɾenta saˈβoɾes" },
      "nadie_elige": { "texto": "Todos miran el cartel y nadie elige.", "fonetica": "ˈtoðos ˈmiɾan el kaɾˈtel i ˈnaðje eˈlixe" },
      "explicacion_eleccion": { "texto": "La paradoja de la elección muestra que demasiadas opciones confunden al cerebro.", "fonetica": "la paɾaˈðoxa ðe la eʝekˈsjon ˈmw.es.tɾa ke ðemaˈsjadas opˈsjones konˈfunden al seˈɾeβɾo" },
      "paralisis_analisis": { "texto": "El cerebro entra en parálisis por análisis.", "fonetica": "el seˈɾeβɾo ˈentɾa en paˈɾalisis poɾ aˈnalisis" },
      "noticiero_tiburon": { "texto": "El noticiero grita que un tiburón atacó a un turista.", "fonetica": "el notiˈsjeɾo ˈɡɾita ke un tiβuˈɾon ataˈko a un tuˈɾista" },
      "gente_miedo": { "texto": "Esa noche nadie entra al mar.", "fonetica": "ˈesa ˈnotʃe ˈnaðje ˈentɾa al maɾ" },
      "explicacion_disponibilidad": { "texto": "La heurística de disponibilidad hace que sobrevaloremos lo más fácil de recordar.", "fonetica": "la ewˈɾistika ðe ðisponiβiliˈðað ˈase ke soβɾeβaloˈɾemos lo mas ˈfasjl ðe rekoɾˈðaɾ" },
      "efecto_manada": { "texto": "Un grupo grita que las hamburguesas son las mejores.", "fonetica": "un ˈɡɾupo ˈɡɾita ke las amβuɾˈɣesas son las meˈxoɾes" },
      "todos_fila": { "texto": "En segundos, todos hacen fila.", "fonetica": "en seˈɣundos ˈtoðos ˈasen ˈfila" },
      "explicacion_bandwagon": { "texto": "El efecto bandwagon o efecto manada ocurre cuando imitamos lo que hace la mayoría.", "fonetica": "el eˈfekto banˈdwaɣon o eˈfekto maˈnaða oˈkuɾe ˈkwando imiˈtamos lo ke ˈase la maʝoˈɾi.a" },
      "bandwagon_creencia": { "texto": "Creemos que si todos lo hacen, debe ser bueno.", "fonetica": "kɾeˈemos ke si ˈtoðos lo ˈasen ˈdeβe seɾ ˈbweno" },
      "cirujano_historia": { "texto": "Un cirujano entra a operar a su hijo, pero dice no puedo, es mi hijo.", "fonetica": "un siɾuˈxano ˈentɾa a opeˈɾaɾ a su ˈixo peɾo ˈðise no ˈpwedo es mi ˈixo" },
      "clase_confundida": { "texto": "La clase se confunde, creen que son dos papás.", "fonetica": "la ˈklase se konˈfunde kɾen ke son dos paˈpas" },
      "revelacion_madre": { "texto": "Hasta que alguien grita, el cirujano es su mamá.", "fonetica": "ˈasta ke ˈalɣjen ˈɡɾita el siɾuˈxano es su maˈma" },
      "explicacion_cirujano": { "texto": "El sesgo del cirujano muestra cómo los estereotipos influyen en nuestra percepción.", "fonetica": "el ˈsesɣo ðel siɾuˈxano ˈmw.es.tɾa ˈkomo los esteɾeoˈtipos inˈflujen en nuestɾa peɾsepˈsjon" },
      "moraleja_final": { "texto": "Todos aprendieron algo: negociar no es solo hablar, también es escuchar, observar y entender la mente.", "fonetica": "ˈtoðos apɾenˈdjeɾon ˈalɣo neɣosjaɾ no es ˈsolo aβlaɾ tamˈbjen es eskuˈtʃaɾ oβseɾˈβaɾ i entenˈdeɾ la ˈmente" }
    }
    